Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/lib/include/rtl8735b_aon_type.h
#ifndef _RTL8735B_AON_TYPE_H_
#define _RTL8735B_AON_TYPE_H_
#include "platform_conf.h"

/**************************************************************************//**
 * @defgroup AON_REG_AON_PWR_CTRL
 * @brief                                            (@ 0X000)
 * @{
 *****************************************************************************/
#define AON_SHIFT_WLON_LPC_EN                        3
#define AON_BIT_WLON_LPC_EN                          ((u32)0x00000001 << 3)                              /*!<R/W 0  WLAN on domain large power 0:Disable, 1: Enable */
#define AON_SHIFT_WLON_SPC_EN                        2
#define AON_BIT_WLON_SPC_EN                          ((u32)0x00000001 << 2)                              /*!<R/W 0  WLAN on domain small power 0:Disable, 1: Enable */
#define AON_SHIFT_PON_LPC_EN                         1
#define AON_BIT_PON_LPC_EN                           ((u32)0x00000001 << 1)                              /*!<R/W 0  Peripheral on domain large power 0:Disable, 1: Enable */
#define AON_SHIFT_PON_SPC_EN                         0
#define AON_BIT_PON_SPC_EN                           ((u32)0x00000001 << 0)                              /*!<R/W 0  Peripheral on domain small power 0:Disable, 1: Enable */
/** @} */

/**************************************************************************//**
 * @defgroup AON_REG_AON_ISO_CTRL
 * @brief                                            (@ 0X004)
 * @{
 *****************************************************************************/
#define AON_SHIFT_SYS_ISO_WLON                       17
#define AON_BIT_SYS_ISO_WLON                         ((u32)0x00000001 << 17)                             /*!<R/W 1  1: isolatino WLON to AON; 0: disable isolation */
#define AON_SHIFT_SYS_ISO_PON                        16
#define AON_BIT_SYS_ISO_PON                          ((u32)0x00000001 << 16)                             /*!<R/W 1  1: isolatino PON to AON; 0: disable isolation */
#define AON_SHIFT_ISO_SYSON_EN                       15
#define AON_BIT_ISO_SYSON_EN                         ((u32)0x00000001 << 15)                             /*!<R/W 1  1: isolation SYSON to AON domain; 0: disable isolation */
#define AON_SHIFT_SYS_ISO_XTAL                       4
#define AON_BIT_SYS_ISO_XTAL                         ((u32)0x00000001 << 4)                              /*!<R/W 1  1: isolatino XTAL to AON; 0: disable isolation */
#define AON_SHIFT_FEPHY_ISO                          2
#define AON_BIT_FEPHY_ISO                            ((u32)0x00000001 << 2)                              /*!<R/W 1  1: Isolation FEPHY digital to analog. */
#define AON_SHIFT_FEPHY_POW_STATE                    1
#define AON_BIT_FEPHY_POW_STATE                      ((u32)0x00000001 << 1)                              /*!<R/W 0  1: Enable Power state */
#define AON_SHIFT_FEPHY_RSTB_L                       0
#define AON_BIT_FEPHY_RSTB_L                         ((u32)0x00000001 << 0)                              /*!<R/W 0  0: Reset */
/** @} */

/**************************************************************************//**
 * @defgroup AON_REG_AON_FUNC_CTRL
 * @brief                                            (@ 0X008)
 * @{
 *****************************************************************************/
#define AON_SHIFT_SYS_AMACRO_EN                      31
#define AON_BIT_SYS_AMACRO_EN                        ((u32)0x00000001 << 31)                             /*!<R/W 1  Analog IP PWD_B, REGU hw_pdb_12 */
#define AON_SHIFT_SYS_FEN_SIC_MST                    25
#define AON_BIT_SYS_FEN_SIC_MST                      ((u32)0x00000001 << 25)                             /*!<R/W 0  1: enable SIC to access register by CPU  */
#define AON_SHIFT_SYS_FEN_SIC                        24
#define AON_BIT_SYS_FEN_SIC                          ((u32)0x00000001 << 24)                             /*!<R/W 0  1: enable SIC function enable; 0: reset */
#define AON_SHIFT_SDM_FEN                            7
#define AON_BIT_SDM_FEN                              ((u32)0x00000001 << 7)                              /*!<R/W 0  1:Enable OSC 32K SDM */
#define AON_SHIFT_GPIO_FEN                           6
#define AON_BIT_GPIO_FEN                             ((u32)0x00000001 << 6)                              /*!<R/W 0  1: Enable AON GPIO */
#define AON_SHIFT_COMP_FEN                           5
#define AON_BIT_COMP_FEN                             ((u32)0x00000001 << 5)                              /*!<R/W 0  1: Enable AON Comparator */
#define AON_SHIFT_RTC_INTF_FEN                       3
#define AON_BIT_RTC_INTF_FEN                         ((u32)0x00000001 << 3)                              /*!<R/W 0  RTC Enable (need delay 4ms?) 0: disable RTC , 1: enable RTC  */
#define AON_SHIFT_SYS_PON_FEN                        1
#define AON_BIT_SYS_PON_FEN                          ((u32)0x00000001 << 1)                              /*!<R/W 0  1: Enable PON */
/** @} */

/**************************************************************************//**
 * @defgroup AON_REG_AON_CLK_CTRL
 * @brief                                            (@ 0X00C)
 * @{
 *****************************************************************************/
#define AON_SHIFT_REG_CLK_SEL                        31
#define AON_BIT_REG_CLK_SEL                          ((u32)0x00000001 << 31)                             /*!<R/W 0  AON register clock source selection, 0: 100K, 1: 4M */
#define AON_SHIFT_INT_CLK_SEL                        30
#define AON_BIT_INT_CLK_SEL                          ((u32)0x00000001 << 30)                             /*!<R/W 0  Comparator interrupt clock source selection, 0:pclk, 1:sclk */
#define AON_SHIFT_GPIO_INTR_CLK                      7
#define AON_BIT_GPIO_INTR_CLK                        ((u32)0x00000001 << 7)                              /*!<R/W 0  0:pclk, 1:sclk */
#define AON_SHIFT_GPIO_SCLK_EN                       6
#define AON_BIT_GPIO_SCLK_EN                         ((u32)0x00000001 << 6)                              /*!<R/W 0  1:AON GPIO Sclk Enable */
#define AON_SHIFT_GPIO_PCLK_EN                       5
#define AON_BIT_GPIO_PCLK_EN                         ((u32)0x00000001 << 5)                              /*!<R/W 0  1:AON GPIO Pclk Enable */
#define AON_SHIFT_OSC_SDM_CK_EN                      4
#define AON_BIT_OSC_SDM_CK_EN                        ((u32)0x00000001 << 4)                              /*!<R/W 0  1: SDM Pclk enable */
#define AON_SHIFT_RTC_CK_FEN                         3
#define AON_BIT_RTC_CK_FEN                           ((u32)0x00000001 << 3)                              /*!<R/W 1  1: enable RTC clock */
#define AON_SHIFT_SYS_CK_PON_EN                      1
#define AON_BIT_SYS_CK_PON_EN                        ((u32)0x00000001 << 1)                              /*!<R/W 0  1: enable PON register clock */
#define AON_SHIFT_RET_MEM_AUTO_GATE                  0
#define AON_BIT_RET_MEM_AUTO_GATE                    ((u32)0x00000001 << 0)                              /*!<R/W 0  1: disable memory clock gating in mbist wrap */
/** @} */

/**************************************************************************//**
 * @defgroup AON_REG_AON_LDO_CTRL0
 * @brief                                            (@ 0X010)
 * @{
 *****************************************************************************/
#define AON_SHIFT_LDO_CTRL                           24
#define AON_BIT_LDO_CTRL                             ((u32)0x00000001 << 24)                             /*!<R/W 0  0:The AON_LDO control was come from AON+0x10[7:4] 1:The AON_LDO control was come from AON+0x10[23:20] */
#define AON_SHIFT_LDOH09_V09ADJ_PMC                  20
#define AON_MASK_LDOH09_V09ADJ_PMC                   ((u32)0x0000000F << 20)                             /*!<R/W 0100  AONLDO09 voltage select VREF 0P600V 0P575V 0000: 0.593V 0.568V 0001: 0.708V 0.678V 0010: 0.739V 0.708V 0011: 0.774V 0.742V 0100: 0.812V 0.778V 0101: 0.833V 0.798V 0110: 0.854V 0.819V 0111: 0.877V 0.840V 1000: 0.901V 0.863V 1001: 0.926V 0.888V 1010: 0.953V 0.913V 1011: 0.981V 0.940V 1100: 1.012V 0.969V 1101: 1.044V 1.000V 1110: 1.077V 1.033V 1111: 1.111V 1.067V */
#define AON_SHIFT_BOD_EN                             19
#define AON_BIT_BOD_EN                               ((u32)0x00000001 << 19)                             /*!<R/W 1  Brown-Out-Detect 1 : enable (default) 0 : disable */
#define AON_SHIFT_BOD_VTHSEL                         16
#define AON_MASK_BOD_VTHSEL                          ((u32)0x00000007 << 16)                             /*!<R/W 001  Brown-Out-Detect VTH selection BOD H L 000 0.475 0.450 001 2.426 2.298 010 2.533 2.400 011 2.591 2.455 100 2.651 2.512 101 2.714 2.571 110 2.780 2.634 111 2.850 2.700 INT H L 000 0.520 0.500 001 2.655 2.553 010 2.773 2.667 011 2.836 2.727 100 2.902 2.791 101 2.971 2.857 110 3.044 2.927 111 3.120 3.000 */
#define AON_SHIFT_LDO_CTRL0_DUMMY_0                  12
#define AON_MASK_LDO_CTRL0_DUMMY_0                   ((u32)0x0000000F << 12)                             /*!<R/W 0000  Dummy */
#define AON_SHIFT_CK12M_EN                           11
#define AON_BIT_CK12M_EN                             ((u32)0x00000001 << 11)                             /*!<R/W 1  1: enable 12M ring */
#define AON_SHIFT_CK_SEL                             10
#define AON_BIT_CK_SEL                               ((u32)0x00000001 << 10)                             /*!<R/W 0  1: 12MHz 0:100kHz Choose between 12M and 100K, when selecting 100k, keep 12M enabled. */
#define AON_SHIFT_LDO_CTRL0_DUMMY_1                  9
#define AON_BIT_LDO_CTRL0_DUMMY_1                    ((u32)0x00000001 << 9)                              /*!<R/W 0  Dummy */
#define AON_SHIFT_EN_SLEEP_L                         8
#define AON_BIT_EN_SLEEP_L                           ((u32)0x00000001 << 8)                              /*!<R/W 0  Enable LDO09H sleep mode 0 : disable (default) 1 : enable */
#define AON_SHIFT_LDOH09_V09ADJ_L_3_0                4
#define AON_MASK_LDOH09_V09ADJ_L_3_0                 ((u32)0x0000000F << 4)                              /*!<R/W 1000  AONLDO09 voltage select VREF 0P600V 0P575V 0000: 0.593V 0.568V 0001: 0.708V 0.678V 0010: 0.739V 0.708V 0011: 0.774V 0.742V 0100: 0.812V 0.778V 0101: 0.833V 0.798V 0110: 0.854V 0.819V 0111: 0.877V 0.840V 1000: 0.901V 0.863V 1001: 0.926V 0.888V 1010: 0.953V 0.913V 1011: 0.981V 0.940V 1100: 1.012V 0.969V 1101: 1.044V 1.000V 1110: 1.077V 1.033V 1111: 1.111V 1.067V */
#define AON_SHIFT_DUMMY_REG_ANAPAR_LDO_B3_B2         2
#define AON_MASK_DUMMY_REG_ANAPAR_LDO_B3_B2          ((u32)0x00000003 << 2)                              /*!<R/W 00  // [REGU][AONLDO] dummy */
#define AON_SHIFT_LV_POR_VREF_SEL                    1
#define AON_BIT_LV_POR_VREF_SEL                      ((u32)0x00000001 << 1)                              /*!<R/W 0  LV_POR VREF 0 (default) VREF = 0P600V 1 VREF = 0P450V */
#define AON_SHIFT_AONLDO_VREF_SEL                    0
#define AON_BIT_AONLDO_VREF_SEL                      ((u32)0x00000001 << 0)                              /*!<R/W 0  AONLDO VREF_SEL 0 (default) VREF = 0P600V 1 VREF = 0P575V */
/** @} */

/**************************************************************************//**
 * @defgroup AON_REG_WLON_LDO_CTRL0
 * @brief                                            (@ 0X014)
 * @{
 *****************************************************************************/
#define AON_SHIFT_RESERVED1                          16
#define AON_MASK_RESERVED1                           ((u32)0x0000000F << 16)                             /*!<R/W 0000  // dummy */
#define AON_SHIFT_REG_DMY_LDO_L                      14
#define AON_MASK_REG_DMY_LDO_L                       ((u32)0x00000003 << 14)                             /*!<R/W 00  // [REGU][LDO] REG_CTRL // LDO extra Power Cut Control <1> : large pwrcut mos, <0> : small pwrcut mos 0 (default): disable pwrcut mos 1 : enable pwrcut mos enable sequence should be first enable small then delay >50us to enable large */
#define AON_SHIFT_REG_FORCE_DIODE_L                  13
#define AON_BIT_REG_FORCE_DIODE_L                    ((u32)0x00000001 << 13)                             /*!<R/W 0  // [REGU][LDO_WLON] REG_CTRL // PGATE diode clamp (this is directly force no gating) // (purpose for powerCut mode iOCP) // 0: disable force diode clamp (default) // 1: enable force diode clamp */
#define AON_SHIFT_REG_BUFFERTYPE_SEL_L               12
#define AON_BIT_REG_BUFFERTYPE_SEL_L                 ((u32)0x00000001 << 12)                             /*!<R/W 1  // [REGU][LDO] REG_CTRL // LDO Buffer Type Select // 0: PMOS buffer (for HV 3P3V) // 1(default): NMOS buffer (for SWR 1P35V) */
#define AON_SHIFT_REG_DMYLOAD_L                      10
#define AON_MASK_REG_DMYLOAD_L                       ((u32)0x00000003 << 10)                             /*!<R/W 00  // [REGU][LDO_WLON] REG_CTRL // LDO dmy load ctrl // 00(default): dmy load disable // 01: light dmy load enable (~160kohm) // 10: dmy load enable (~1kohm) // 11: dmy load + light dmy load both enable */
#define AON_SHIFT_REG_ITAIL_HALF_EN_L                9
#define AON_BIT_REG_ITAIL_HALF_EN_L                  ((u32)0x00000001 << 9)                              /*!<R/W 0  // [REGU][LDO_WLON] REG_CTRL // LDO iq half ctrl // 0(default): iq normal (for normal mode) // 1: iq half (for standby mode) */
#define AON_SHIFT_REG_STANDBY_L                      7
#define AON_MASK_REG_STANDBY_L                       ((u32)0x00000003 << 7)                              /*!<R/W 00  // [REGU][LDO_WLON] REG_CTRL // LDO standby mode ctrl: // 00 (default): normal mode (iq normal + pwrmos 8x) // 01: debug mode (iq reduce + pwrmos 1x) // 10: debug mode (iq normal + pwrmos 8x) // 11: standby mode (iq reduce + pwrmos 1x) */
#define AON_SHIFT_EN_DIODE_L                         6
#define AON_BIT_EN_DIODE_L                           ((u32)0x00000001 << 6)                              /*!<R/W 1  // [REGU][LDO_WLON] REG_CTRL // PGATE diode clamp (this gating to disable by pd_regu_L) // 0: disable clamp // 1: enable clamp (default) */
#define AON_SHIFT_VOADJ_L                            2
#define AON_MASK_VOADJ_L                             ((u32)0x0000000F << 2)                              /*!<R/W 1000  // [REGU][LDO_WLON] REG_CTRL // LDO VOSEL // 0000 0.722 // 0001 0.740 // 0010 0.760 // 0011 0.780 // 0100 0.802 // 0101 0.825 // 0110 0.850 // 0111 0.875 // 1000 0.903 // 1001 0.932 // 1010 0.963 // 1011 0.997 // 1100 1.032 // 1101 1.071 // 1110 1.112 // 1111 1.157 */
#define AON_SHIFT_PD_REGU_L                          1
#define AON_BIT_PD_REGU_L                            ((u32)0x00000001 << 1)                              /*!<R/W 1  // [REGU][LDO_WLON] REG_CTRL // PowerDown CTRL // 0: normal-Mode // 1: power-down Mode (default) */
#define AON_SHIFT_EN_PC_BT_L                         0
#define AON_BIT_EN_PC_BT_L                           ((u32)0x00000001 << 0)                              /*!<R/W 0  // [REGU][LDO_WLON] REG_CTRL // PWRCUT enable // 0: LDO-Mode (default) // 1: PWRCUT-Mode */
/** @} */

/**************************************************************************//**
 * @defgroup AON_REG_SWR_SRC_CTRL0
 * @brief                                            (@ 0X018)
 * @{
 *****************************************************************************/
#define AON_SHIFT_FORCE_ZCD_BIAS                     31
#define AON_BIT_FORCE_ZCD_BIAS                       ((u32)0x00000001 << 31)                             /*!<R/W 1  //0:ZCD bias on after SS //1:ZCD bias on when ZCD enable */
#define AON_SHIFT_ZCD_SDZ_L_1                        30
#define AON_BIT_ZCD_SDZ_L_1                          ((u32)0x00000001 << 30)                             /*!<R/W 0  //Increase ZCD delay cell */
#define AON_SHIFT_ZCD_SDZ_L_0                        29
#define AON_BIT_ZCD_SDZ_L_0                          ((u32)0x00000001 << 29)                             /*!<R/W 1  //Increase ZCD delay cell */
#define AON_SHIFT_ZCDC_H                             27
#define AON_MASK_ZCDC_H                              ((u32)0x00000003 << 27)                             /*!<R 10  //00:0.1u //01:0.2u(PFM) //10:0.7u (PWM Loading > 50mA) //11:0.8u (PWM Loading <= 50mA) */
#define AON_SHIFT_POW_ZCD_L                          26
#define AON_BIT_POW_ZCD_L                            ((u32)0x00000001 << 26)                             /*!<R/W 1  //Enable ZCD */
#define AON_SHIFT_OCP_L1                             23
#define AON_MASK_OCP_L1                              ((u32)0x00000007 << 23)                             /*!<R 011  //PWM current (A) / PFM Current (A) //000 0.398 0.178 //001 0.486 0.222 //010 0.573 0.266 //011 0.660 0.310 //100 0.747 0.354 //101 0.834 0.398 //110 0.920 0.442 //111 1.008 VIN/10 */
#define AON_SHIFT_POWOCP_L1                          22
#define AON_BIT_POWOCP_L1                            ((u32)0x00000001 << 22)                             /*!<R/W 1  //POWOCP_L1=1 : enable over current protection */
#define AON_SHIFT_SAW_FREQ_L                         18
#define AON_MASK_SAW_FREQ_L                          ((u32)0x0000000F << 18)                             /*!<R/W 1000  0000 458.0k 0001 680.2k 0010 898.9k 0011 1.113M 0100 1.321M 0101 1.522M 0110 1.716M 0111 1.902M 1000 2.087M 1001 2.258M 1010 2.426M 1011 2.582M 1100 2.743M 1101 2.888M 1110 3.035M 1111 3.165M */
#define AON_SHIFT_BYPASS_L                           17
#define AON_BIT_BYPASS_L                             ((u32)0x00000001 << 17)                             /*!<R/W 1  1:bypass SSR latch */
#define AON_SHIFT_FPWM_L1                            16
#define AON_BIT_FPWM_L1                              ((u32)0x00000001 << 16)                             /*!<R/W 1  FPWM_L1 = 1 : force PWM FPWM_L1 = 0 : force PFM */
#define AON_SHIFT_STD_L1                             14
#define AON_MASK_STD_L1                              ((u32)0x00000003 << 14)                             /*!<R/W 01  STD_L1[1:0] time 00 750u 01 1.5m 10 3m 11 12.288m */
#define AON_SHIFT_VOL_L1                             10
#define AON_MASK_VOL_L1                              ((u32)0x0000000F << 10)                             /*!<R/W 1000  // bits SWR / LDO //VREF 0P600V 0P575V 0P500V 0P450V //0000 1.426 1.367 1.189 1.070 //0001 1.455 1.394 1.213 1.091 //0010 1.501 1.438 1.251 1.125 //0011 1.549 1.484 1.291 1.162 //0100 1.583 1.517 1.319 1.187 //0101 1.637 1.569 1.364 1.228 //0110 1.695 1.624 1.412 1.271 //0111 1.736 1.664 1.446 1.302 //1000 1.801 1.726 1.501 1.351 (default) //1001 1.871 1.793 1.559 1.403 //1010 1.921 1.841 1.601 1.441 //1011 2.001 1.918 1.667 1.501 //1100 2.088 2.001 1.740 1.566 //1101 2.150 2.060 1.792 1.613 //1110 2.251 2.157 1.876 1.688 //1111 2.362 2.264 1.968 1.771 */
#define AON_SHIFT_SRC_ENB_LDO_1P8_DIODE              3
#define AON_BIT_SRC_ENB_LDO_1P8_DIODE                ((u32)0x00000001 << 3)                              /*!<R/W 0  [no function] LDOMODE need followed sequence of LDOS->LDO */
#define AON_SHIFT_SRC_POW_LDOS_1P8                   2
#define AON_BIT_SRC_POW_LDOS_1P8                     ((u32)0x00000001 << 2)                              /*!<R/W 0  small LDO enable // default 1'b0 disable */
#define AON_SHIFT_SRC_POW_LDO_1P8                    1
#define AON_BIT_SRC_POW_LDO_1P8                      ((u32)0x00000001 << 1)                              /*!<R/W 0  large LDO enable // default 1'b0 disable */
#define AON_SHIFT_SRC_POW_SW                         0
#define AON_BIT_SRC_POW_SW                           ((u32)0x00000001 << 0)                              /*!<R/W 0  SWR enable // default 1'b0 disable */
/** @} */

