Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/lib/include/rtl8735b_aon_type.h
/**************************************************************************//**
 * @defgroup AON_REG_SWR_SRC_CTRL1
 * @brief                                            (@ 0X01C)
 * @{
 *****************************************************************************/
#define AON_SHIFT_SRC_SSOVER_L                       30
#define AON_BIT_SRC_SSOVER_L                         ((u32)0x00000001 << 30)                             /*!<R 0  SWR_SRC vout soft-start-over ready signal 1:ready 0:(default) not ready */
#define AON_SHIFT_SP_P_L                             26
#define AON_MASK_SP_P_L                              ((u32)0x0000000F << 26)                             /*!<R/W 0011  PGATE PMOS driving */
#define AON_SHIFT_VO_DISCHG_PWM_H                    25
#define AON_BIT_VO_DISCHG_PWM_H                      ((u32)0x00000001 << 25)                             /*!<R/W 0  1 : dummy load RES 178ohm (~10mA for 1P8V) */
#define AON_SHIFT_MODE_PREDRIVER                     24
#define AON_BIT_MODE_PREDRIVER                       ((u32)0x00000001 << 24)                             /*!<R/W 1  1 : enable 3 level predriver */
#define AON_SHIFT_ADJSLDO_L                          20
#define AON_MASK_ADJSLDO_L                           ((u32)0x0000000F << 20)                             /*!<R/W 0110  bits / voltage (for VREF0p6V) (as for others VREF is in ratio) 4'b0000 1.413 4'b0001 1.451 4'b0010 1.491 4'b0011 1.534 4'b0100 1.579 4'b0101 1.627 4'b0110 1.678 4'b0111 1.732 4'b1000 1.790 4'b1001 1.852 4'b1010 1.918 4'b1011 1.989 4'b1100 2.065 4'b1101 2.148 4'b1110 2.238 4'b1111 2.335 */
#define AON_SHIFT_EN_LDOS_DIODE                      19
#define AON_BIT_EN_LDOS_DIODE                        ((u32)0x00000001 << 19)                             /*!<R/W 1  1 : LDOS diode enable */
#define AON_SHIFT_PWM_FORCE                          18
#define AON_BIT_PWM_FORCE                            ((u32)0x00000001 << 18)                             /*!<R/W 0  0 : bias enabled only at PWM mode 1 : force bias enable before mode tran from PFM to PWM */
#define AON_SHIFT_PFM_PD_RST                         17
#define AON_BIT_PFM_PD_RST                           ((u32)0x00000001 << 17)                             /*!<R/W 1  //1: When leave PFM mode, COT logic is reset */
#define AON_SHIFT_VC_PFM_RSTB                        16
#define AON_BIT_VC_PFM_RSTB                          ((u32)0x00000001 << 16)                             /*!<R/W 0  //When into PFM, VC is, //0: clamped (bit 40 also =1) 1. floating */
#define AON_SHIFT_PFM_IN_SEL                         15
#define AON_BIT_PFM_IN_SEL                           ((u32)0x00000001 << 15)                             /*!<R/W 1  //Power MOS into PFM when PFM CTRL, //0: rising 1: falling */
#define AON_SHIFT_VC_RSTB                            14
#define AON_BIT_VC_RSTB                              ((u32)0x00000001 << 14)                             /*!<R/W 0  //Before SS VC is, 0: pulled low 1: floating */
#define AON_SHIFT_FPWMDELAY                          13
#define AON_BIT_FPWMDELAY                            ((u32)0x00000001 << 13)                             /*!<R/W 0  //1:PFM[=]PWM //PFM/PWM change by using DFF(CKMOD) */
#define AON_SHIFT_ENFPWMDELAY_H                      12
#define AON_BIT_ENFPWMDELAY_H                        ((u32)0x00000001 << 12)                             /*!<R/W 0  //1:PFM=]PWM delay //PWM enable and wait one clock cycle then PFM off */
#define AON_SHIFT_MOS_HALF_L                         11
#define AON_BIT_MOS_HALF_L                           ((u32)0x00000001 << 11)                             /*!<R 0  //1:power mos half */
#define AON_SHIFT_CURRENT_SENSE_MOS                  10
#define AON_BIT_CURRENT_SENSE_MOS                    ((u32)0x00000001 << 10)                             /*!<R/W 0  //1: current sensing MOS for large OC current */
#define AON_SHIFT_PFMCMP_IQ                          9
#define AON_BIT_PFMCMP_IQ                            ((u32)0x00000001 << 9)                              /*!<R/W 1  //PFM comparator bias, //0: 50nA 1:250nA */
#define AON_SHIFT_REG_FORCE_SRC_IMIRROR_EN           8
#define AON_BIT_REG_FORCE_SRC_IMIRROR_EN             ((u32)0x00000001 << 8)                              /*!<R/W 0  // Force SWR_SRC IBIAS Generation circuit enable 1: force enable (need enable this circuit before enable small LDO for SRC, LDO_SDIO, LDO_WLON) 0: non force, IBIAS enable listen to REG_SRC_POW_SW (default) */
#define AON_SHIFT_OFF_END_SEL                        7
#define AON_BIT_OFF_END_SEL                          ((u32)0x00000001 << 7)                              /*!<R/W 1  //COT off time controlled by, //0: ZCD 1: min off time */
#define AON_SHIFT_POW_MINOFF_L                       6
#define AON_BIT_POW_MINOFF_L                         ((u32)0x00000001 << 6)                              /*!<R/W 1  //COT off time controlled by, //0: ZCD 1: min off time */
#define AON_SHIFT_COT_I_L                            4
#define AON_MASK_COT_I_L                             ((u32)0x00000003 << 4)                              /*!<R/W 01  //COT ON Current //00:150nA //01:150nA+100nA //10:150nA+150nA //11:150nA+250nA */
#define AON_SHIFT_VREFPFM_L                          0
#define AON_MASK_VREFPFM_L                           ((u32)0x0000000F << 0)                              /*!<R/W 1010  // SWR/LDO //0000 0.750 //0001 0.800 //0010 0.850 //0011 0.900 //0100 0.950 //0101 1.000 <== step between these two //0110 1.150 <== step between these two //0111 1.200 //1000 1.250 //1001 1.300 //1010 1.350 (default) //1011 1.400 //1100 1.450 //1101 1.500 //1110 1.550 //1111 1.600 */
/** @} */

/**************************************************************************//**
 * @defgroup AON_REG_SWR_SRC_CTRL2
 * @brief                                            (@ 0X020)
 * @{
 *****************************************************************************/
#define AON_SHIFT_REG_SWR_RSV_CTRL                   16
#define AON_MASK_REG_SWR_RSV_CTRL                    ((u32)0x00000003 << 16)                             /*!<R/W 00  // BG current adjustment // 00 default 23.9n // 01 54.6n // 10 117.8n */
#define AON_SHIFT_REG_SWR_ZCD_CTRL                   14
#define AON_MASK_REG_SWR_ZCD_CTRL                    ((u32)0x00000003 << 14)                             /*!<R/W 10  // SWR ZCD CTRL control <1> 1'b1: extra current add if zcdc is 2'b11, 1'b0 : no extra current (default) <0> 1'b1: force in CCM/DCM boundary mode, 1'b0 : no boundary (default) */
#define AON_SHIFT_REG_PWM_VREF_SEL                   12
#define AON_MASK_REG_PWM_VREF_SEL                    ((u32)0x00000003 << 12)                             /*!<R/W 0  PWM_VREF_SEL 2'b11 0P600V for SWR1P8V (DDR2) 2'b10 0P575V for SWR1P725V (DDR2 trim) 2'b01 0P500V for SWR1P5V (DDR3) 2'b00 0P450V for SWR1P35V (DDR3L) (default) */
#define AON_SHIFT_SN_N_L                             8
#define AON_MASK_SN_N_L                              ((u32)0x0000000F << 8)                              /*!<R/W 1011  NGATE NMOS driving */
#define AON_SHIFT_SP_N_L                             4
#define AON_MASK_SP_N_L                              ((u32)0x0000000F << 4)                              /*!<R/W 1000  NGATE PMOS driving */
#define AON_SHIFT_SN_P_L                             0
#define AON_MASK_SN_P_L                              ((u32)0x0000000F << 0)                              /*!<R/W 0011  PGATE NMOS driving */
/** @} */

/**************************************************************************//**
 * @defgroup AON_REG_SWR_SRC_CTRL3
 * @brief                                            (@ 0X024)
 * @{
 *****************************************************************************/
#define AON_SHIFT_SDZN_L                             30
#define AON_MASK_SDZN_L                              ((u32)0x00000003 << 30)                             /*!<R/W 01  //Nonoverlap delay cell for NMOS */
#define AON_SHIFT_AUTOZCD_L                          29
#define AON_BIT_AUTOZCD_L                            ((u32)0x00000001 << 29)                             /*!<R/W 0  //0:register 1:10000 */
#define AON_SHIFT_VOFB_SEL                           28
#define AON_BIT_VOFB_SEL                             ((u32)0x00000001 << 28)                             /*!<R/W 0  //0:vo18 //1:LX_SPS */
#define AON_SHIFT_TBOX_L1                            26
#define AON_MASK_TBOX_L1                             ((u32)0x00000003 << 26)                             /*!<R/W 00  //TBOX_L1[1:0] output //00 CKOVER/RAMPOVER //01 // NI/PI //10 CKSS/SSOVER //11 // i/NIOFF_H */
#define AON_SHIFT_ENOCPMUX_L                         25
#define AON_BIT_ENOCPMUX_L                           ((u32)0x00000001 << 25)                             /*!<R/W 1  1:OCP signal control by MUX 0:OCP signal control by I */
#define AON_SHIFT_FORCE_LDOS                         24
#define AON_BIT_FORCE_LDOS                           ((u32)0x00000001 << 24)                             /*!<R/W 0  //1 : LDOS force into Standby Mode //0 : LDOS at normal mode (default) */
#define AON_SHIFT_VO_DISCHG                          23
#define AON_BIT_VO_DISCHG                            ((u32)0x00000001 << 23)                             /*!<R/W 0  //1:VO with 2mA discharge (internal RES ~ 893ohm) */
#define AON_SHIFT_LDO_OC_CLAMP                       22
#define AON_BIT_LDO_OC_CLAMP                         ((u32)0x00000001 << 22)                             /*!<R/W 1  // no function */
#define AON_SHIFT_MINOFF_LIQ                         21
#define AON_BIT_MINOFF_LIQ                           ((u32)0x00000001 << 21)                             /*!<R/W 1  //0:Min. off circuit always on //1:Min. off circuit pulse on */
#define AON_SHIFT_MINON_LIQ                          20
#define AON_BIT_MINON_LIQ                            ((u32)0x00000001 << 20)                             /*!<R/W 1  //0:Min. on circuit always on //1:Min. on circuit pulse on */
#define AON_SHIFT_POW_AUTO_L                         19
#define AON_BIT_POW_AUTO_L                           ((u32)0x00000001 << 19)                             /*!<R/W 0  //1:auto PFM/PWM //0:register control */
#define AON_SHIFT_REG_VC_CLAMP_SEL_L                 18
#define AON_BIT_REG_VC_CLAMP_SEL_L                   ((u32)0x00000001 << 18)                             /*!<R/W 0  // 0(default) : unity gain feedback clamp VC=VREF // 1.orignal clamp(roll back option) */
#define AON_SHIFT_NO_OFFTIME_L                       17
#define AON_BIT_NO_OFFTIME_L                         ((u32)0x00000001 << 17)                             /*!<R/W 0  //0:from min OFF time(PFM COT) //1:always on */
#define AON_SHIFT_EN_ON_END_L                        16
#define AON_BIT_EN_ON_END_L                          ((u32)0x00000001 << 16)                             /*!<R/W 1  //1:EN min OFF time (PFM COT) */
#define AON_SHIFT_ENCOT_L                            15
#define AON_BIT_ENCOT_L                              ((u32)0x00000001 << 15)                             /*!<R/W 1  //1:PFM COT */
#define AON_SHIFT_CLK_SEL                            13
#define AON_MASK_CLK_SEL                             ((u32)0x00000003 << 13)                             /*!<R/W 11  //00:out of phase CKSS //01:out of phase PWM_CTRIL //10:ckout //11:HG */
#define AON_SHIFT_TYPE_L                             12
#define AON_BIT_TYPE_L                               ((u32)0x00000001 << 12)                             /*!<R/W 1  //1:type3 0:type2 */
#define AON_SHIFT_R3_L1                              10
#define AON_MASK_R3_L1                               ((u32)0x00000003 << 10)                             /*!<R/W 10  //00 => 36k //01 => 30k //10 => 24k //11 => 24k */
#define AON_SHIFT_R2_L1                              8
#define AON_MASK_R2_L1                               ((u32)0x00000003 << 8)                              /*!<R/W 10  //00 => 2.5M //01 => 2.0M //10 => 1.5M //11 => 1.0M */
#define AON_SHIFT_R1_L1                              6
#define AON_MASK_R1_L1                               ((u32)0x00000003 << 6)                              /*!<R/W 10  //00 => 900k //01 => 720k //10 => 900k //11 => 1080k */
#define AON_SHIFT_C3_L1                              4
#define AON_MASK_C3_L1                               ((u32)0x00000003 << 4)                              /*!<R/W 10  //00 => 1.59p //01 => 3.2p //10 => 4.76p //11 => 6.34p */
#define AON_SHIFT_C2_L1                              2
#define AON_MASK_C2_L1                               ((u32)0x00000003 << 2)                              /*!<R/W 10  //00 => 13f //01 => 26f //10 => 39f //11 => 41f */
#define AON_SHIFT_C1_L1                              0
#define AON_MASK_C1_L1                               ((u32)0x00000003 << 0)                              /*!<R/W 10  //00 => 1.03p //01 => 2.06p //10 => 3.1p //11 => 4.12p */
/** @} */

/**************************************************************************//**
 * @defgroup AON_REG_SWR_SRC_CTRL4
 * @brief                                            (@ 0X028)
 * @{
 *****************************************************************************/
#define AON_SHIFT_SRC_DBG                            28
#define AON_MASK_SRC_DBG                             ((u32)0x00000003 << 28)                             /*!<R 00  REG_SRC_ANAPARSW_MAC_OFF[27:26] SRC_DTEST_SWREG_L<1> SRC_DTEST_SWREG_L<0> 2'b00 (1'b1=PWM, 1'b0=PFM) RAMPOVER 2'b01 NI PI 2'b10 CKSS SSOVER 2'b11 i NIOFF_H  */
#define AON_SHIFT_TESTCHIP_DIG_ZCD_CNT_SELECT        13
#define AON_BIT_TESTCHIP_DIG_ZCD_CNT_SELECT          ((u32)0x00000001 << 13)                             /*!<R/W 0  //TOP ZCD counter select //0(default) : reset by 10000 //1 : reset by 11111 */
#define AON_SHIFT_SWR_SRC_CTRL4_DUMMY_0              12
#define AON_BIT_SWR_SRC_CTRL4_DUMMY_0                ((u32)0x00000001 << 12)                             /*!<R/W 0  //Dummy */
#define AON_SHIFT_BG_R1_TUNE2                        11
#define AON_BIT_BG_R1_TUNE2                          ((u32)0x00000001 << 11)                             /*!<R/W 1  // 0(default) : unity gain feedback clamp VC=VREF // 1.orignal clamp(roll back option) */
#define AON_SHIFT_BG_R1_TUNE1                        10
#define AON_BIT_BG_R1_TUNE1                          ((u32)0x00000001 << 10)                             /*!<R/W 0  //LDO feedforward cap //0 : disable //1 : enable (default) */
#define AON_SHIFT_SRC_LDO_BUFFER_DIS_L               9
#define AON_BIT_SRC_LDO_BUFFER_DIS_L                 ((u32)0x00000001 << 9)                              /*!<R/W 0  //LDO buffer //0 : enable (default) //1 : disable */
#define AON_SHIFT_BG_R2_TUNE2                        8
#define AON_BIT_BG_R2_TUNE2                          ((u32)0x00000001 << 8)                              /*!<R/W 1  //LDO_MODE //0 : Normal Mode (default) //1 : Standby Mode */
#define AON_SHIFT_BG_R2_TUNE1                        6
#define AON_MASK_BG_R2_TUNE1                         ((u32)0x00000003 << 6)                              /*!<R/W 00  BG TC tune */
#define AON_SHIFT_NMOS_OFF_L                         5
#define AON_BIT_NMOS_OFF_L                           ((u32)0x00000001 << 5)                              /*!<R/W 0  //0:normal //1:NMOS always off */
#define AON_SHIFT_MUX_PI_L                           4
#define AON_BIT_MUX_PI_L                             ((u32)0x00000001 << 4)                              /*!<R/W 0  //1:PI (original) //0:i */
#define AON_SHIFT_PWM_CTRL_L                         3
#define AON_BIT_PWM_CTRL_L                           ((u32)0x00000001 << 3)                              /*!<R/W 0  //0:internal PWM //1:external PWM */
#define AON_SHIFT_ENSR_L                             2
#define AON_BIT_ENSR_L                               ((u32)0x00000001 << 2)                              /*!<R/W 1  //1:with SSR latch */
#define AON_SHIFT_SDZP_L                             0
#define AON_MASK_SDZP_L                              ((u32)0x00000003 << 0)                              /*!<R/W 01  //Nonoverlap delay cell for PMOS */
/** @} */

/**************************************************************************//**
 * @defgroup AON_REG_SWR_SRC_OCP
 * @brief                                            (@ 0X02C)
 * @{
 *****************************************************************************/
#define AON_SHIFT_SWR_OCP_EN                         31
#define AON_BIT_SWR_OCP_EN                           ((u32)0x00000001 << 31)                             /*!<R/W 1  SRC OCP function enable */
#define AON_SHIFT_SWR_OCP_THD                        16
#define AON_MASK_SWR_OCP_THD                         ((u32)0x00007FFF << 16)                             /*!<R/W 0  SRC OCP threshold */
#define AON_SHIFT_SWR_OCP_WND                        0
#define AON_MASK_SWR_OCP_WND                         ((u32)0x0000FFFF << 0)                              /*!<R/W 0  SRC OCP time windows */
/** @} */

/**************************************************************************//**
 * @defgroup AON_REG_SWR_ZCD_CTRL
 * @brief                                            (@ 0X030)
 * @{
 *****************************************************************************/
#define AON_SHIFT_ZCD_FORCE_VALUE                    8
#define AON_MASK_ZCD_FORCE_VALUE                     ((u32)0x0000001F << 8)                              /*!<R/W 0  ZCD Force Value */
#define AON_SHIFT_ZCD_FORCE_EN                       7
#define AON_BIT_ZCD_FORCE_EN                         ((u32)0x00000001 << 7)                              /*!<R/W 0  1:Enable ZCD Force */
#define AON_SHIFT_ZCD_VALUE                          1
#define AON_MASK_ZCD_VALUE                           ((u32)0x0000003F << 1)                              /*!<R 0x10  Read zero current detection value */
#define AON_SHIFT_ZCD_EN                             0
#define AON_BIT_ZCD_EN                               ((u32)0x00000001 << 0)                              /*!<R/W 0  1:Enable ZCD Circuit */
/** @} */

/**************************************************************************//**
 * @defgroup AON_REG_SWR_SRC_LV_CTRL
 * @brief                                            (@ 0X034)
 * @{
 *****************************************************************************/
#define AON_SHIFT_COUNT_READY                        6
#define AON_BIT_COUNT_READY                          ((u32)0x00000001 << 6)                              /*!<R 0  1:PMC Done */
#define AON_SHIFT_UP_EN                              5
#define AON_BIT_UP_EN                                ((u32)0x00000001 << 5)                              /*!<R/W 0  1:Enable PMC to Increase SWR_SRC output Level */
#define AON_SHIFT_DOWN_EN                            4
#define AON_BIT_DOWN_EN                              ((u32)0x00000001 << 4)                              /*!<R/W 0  1:Enable PMC to Decrease SWR_SRC output Level */
#define AON_SHIFT_PFM_LV                             0
#define AON_MASK_PFM_LV                              ((u32)0x0000000F << 0)                              /*!<R/W 2  PFM Output level under LDO WLON at Bypss Mode */
/** @} */

/**************************************************************************//**
 * @defgroup AON_REG_AON_XTAL32K_CTRL0
 * @brief                                            (@ 0X040)
 * @{
 *****************************************************************************/
#define AON_SHIFT_XTAL32K_GM_3_0                     28
#define AON_MASK_XTAL32K_GM_3_0                      ((u32)0x0000000F << 28)                             /*!<R/W 1111  gm size */
#define AON_SHIFT_XTAL32K_CUR_REP_1_0                26
#define AON_MASK_XTAL32K_CUR_REP_1_0                 ((u32)0x00000003 << 26)                             /*!<R/W 01  replica buffer current */
#define AON_SHIFT_XTAL32K_CUR_GM_3_0                 22
#define AON_MASK_XTAL32K_CUR_GM_3_0                  ((u32)0x0000000F << 22)                             /*!<R/W 0101  awake gm current, 7pXtal: 0100 */
#define AON_SHIFT_XTAL32K_CUR_GM_INI_3_0             18
#define AON_MASK_XTAL32K_CUR_GM_INI_3_0              ((u32)0x0000000F << 18)                             /*!<R/W 1001  initial gm current, 7pXtal: 0100 */
#define AON_SHIFT_XTAL32K_CUR_MAIN_1_0               16
#define AON_MASK_XTAL32K_CUR_MAIN_1_0                ((u32)0x00000003 << 16)                             /*!<R/W 01  xtal main current */
#define AON_SHIFT_POW_XTAL32K                        0
#define AON_BIT_POW_XTAL32K                          ((u32)0x00000001 << 0)                              /*!<R/W 0  xtal 32KHz enable */
/** @} */

/**************************************************************************//**
 * @defgroup AON_REG_AON_XTAL32K_CTRL1
 * @brief                                            (@ 0X044)
 * @{
 *****************************************************************************/
#define AON_SHIFT_RESERVED2                          23
#define AON_BIT_RESERVED2                            ((u32)0x00000001 << 23)                             /*!<R/W 0  Reserved */
#define AON_SHIFT_XTAL32K_GPIO_SEL                   22
#define AON_BIT_XTAL32K_GPIO_SEL                     ((u32)0x00000001 << 22)                             /*!<R/W 1  0: 32K 1: GPIO Should be efuse control */
#define AON_SHIFT_XTAL32K_SC_XO_EXTRA                21
#define AON_BIT_XTAL32K_SC_XO_EXTRA                  ((u32)0x00000001 << 21)                             /*!<R/W 0  0: w/i 2.8pF cap 1: w/o 2.8pF cap  */
#define AON_SHIFT_XTAL32K_SC_XI_EXTRA                20
#define AON_BIT_XTAL32K_SC_XI_EXTRA                  ((u32)0x00000001 << 20)                             /*!<R/W 0  0: w/i 2.8pF cap 1: w/o 2.8pF cap  */
#define AON_SHIFT_XTAL32K_GM_REP_2_0                 17
#define AON_MASK_XTAL32K_GM_REP_2_0                  ((u32)0x00000007 << 17)                             /*!<R/W 111  repilca size */
#define AON_SHIFT_ENB_XTAL32K_FBRES                  16
#define AON_BIT_ENB_XTAL32K_FBRES                    ((u32)0x00000001 << 16)                             /*!<R/W 0  0: enable feedback resistor */
#define AON_SHIFT_XTAL32K_TOK_1_0                    14
#define AON_MASK_XTAL32K_TOK_1_0                     ((u32)0x00000003 << 14)                             /*!<R/W 11  00: 100ms 01:200ms 10:400ms 11: 800ms */
#define AON_SHIFT_XTAL32K_SC_XO_5_0                  8
#define AON_MASK_XTAL32K_SC_XO_5_0                   ((u32)0x0000003F << 8)                              /*!<R/W 100000  xo cap */
#define AON_SHIFT_XTAL32K_SC_XI_5_0                  2
#define AON_MASK_XTAL32K_SC_XI_5_0                   ((u32)0x0000003F << 2)                              /*!<R/W 100000  xi cap */
#define AON_SHIFT_EN_XTAL32K_CAP_AWAKE               1
#define AON_BIT_EN_XTAL32K_CAP_AWAKE                 ((u32)0x00000001 << 1)                              /*!<R/W 1  internal cap enable as awake */
#define AON_SHIFT_EN_XTAL32K_CAP_INITIAL             0
#define AON_BIT_EN_XTAL32K_CAP_INITIAL               ((u32)0x00000001 << 0)                              /*!<R/W 1  internal cap enable as initial */
/** @} */

