Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/lib/include/rtl8735b_aon_type.h
/**************************************************************************//**
 * @defgroup AON_REG_AON_OSC32K_CTRL0
 * @brief                                            (@ 0X048)
 * @{
 *****************************************************************************/
#if IS_CUT_TEST(CONFIG_CHIP_VER)
#define AON_SHIFT_DUMMY_2                            30
#define AON_BIT_DUMMY_2                              ((u32)0x00000001 << 30)                             /*!<R/W 0  RSVD */
#else
#define AON_SHIFT_SWR_SRC_SWITCH                     30
#define AON_BIT_SWR_SRC_SWITCH                       ((u32)0x00000001 << 30)                             /*!<R/W 0  1: Connect to AON+0x1C[3:0] 0: Connect to swr_ctrl for sleep up/down in Low power mode transition */
#endif
#define AON_SHIFT_SEL_LDO_VREF                       29
#define AON_BIT_SEL_LDO_VREF                         ((u32)0x00000001 << 29)                             /*!<R/W 0  0: LDO low valtage setting 1:high voltage */
#define AON_SHIFT_RCAL_5_0                           16
#define AON_MASK_RCAL_5_0                            ((u32)0x0000003F << 16)                             /*!<R/W 100000  osc frequency is highier as RCAL's larger */
#define AON_SHIFT_DUMMY_14_6                         3
#define AON_MASK_DUMMY_14_6                          ((u32)0x000001FF << 3)                              /*!<R/W 0x000  Dummy */
#define AON_SHIFT_DUMMY_1_0                          1
#define AON_MASK_DUMMY_1_0                           ((u32)0x00000003 << 1)                              /*!<R/W 00  // [RF][32KOSC] dummy */
#define AON_SHIFT_POW_OSC32K                         0
#define AON_BIT_POW_OSC32K                           ((u32)0x00000001 << 0)                              /*!<R/W 0  32k osc enable */
/** @} */

/**************************************************************************//**
 * @defgroup AON_REG_AON_PLATFORM_VER
 * @brief                                            (@ 0X04C)
 * @{
 *****************************************************************************/
#define AON_SHIFT_PLATFORM_VER                       0
#define AON_MASK_PLATFORM_VER                        ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0  Platform Version number */
/** @} */

/**************************************************************************//**
 * @defgroup AON_REG_AON_OSC4M_CTRL
 * @brief                                            (@ 0X050)
 * @{
 *****************************************************************************/
#define AON_SHIFT_C_SEL                              29
#define AON_BIT_C_SEL                                ((u32)0x00000001 << 29)                             /*!<R/W 0   */
#define AON_SHIFT_EN_4MOSC                           28
#define AON_BIT_EN_4MOSC                             ((u32)0x00000001 << 28)                             /*!<R/W 0  [4MOSC] 1'b1 : enable */
#define AON_SHIFT_POW33_LVSFT                        27
#define AON_BIT_POW33_LVSFT                          ((u32)0x00000001 << 27)                             /*!<R/W 0   */
#define AON_SHIFT_IB_BIAS_SEL                        22
#define AON_MASK_IB_BIAS_SEL                         ((u32)0x0000001F << 22)                             /*!<R/W 01111   */
#define AON_SHIFT_VCM_SEL_H                          18
#define AON_MASK_VCM_SEL_H                           ((u32)0x0000000F << 18)                             /*!<R/W 1011   */
#define AON_SHIFT_VCM_SEL_L                          14
#define AON_MASK_VCM_SEL_L                           ((u32)0x0000000F << 14)                             /*!<R/W 1011   */
#define AON_SHIFT_FREQ_R_SEL                         6
#define AON_MASK_FREQ_R_SEL                          ((u32)0x000000FF << 6)                              /*!<R/W 10000000   */
#define AON_SHIFT_POW_4MOSC_YCC                      5
#define AON_BIT_POW_4MOSC_YCC                        ((u32)0x00000001 << 5)                              /*!<R/W 1  REG_POW_4MOSC_YCC */
#define AON_SHIFT_OSC4M_FSET_YCC_3_0                 1
#define AON_MASK_OSC4M_FSET_YCC_3_0                  ((u32)0x0000000F << 1)                              /*!<R/W 1000  osc freq control ,code up freq up */
#define AON_SHIFT_POW_4MOSC                          0
#define AON_BIT_POW_4MOSC                            ((u32)0x00000001 << 0)                              /*!<R/W 0  REG_POW_4MOSC */
/** @} */

/**************************************************************************//**
 * @defgroup AON_REG_AON_SW_DBG0
 * @brief                                            (@ 0X054)
 * @{
 *****************************************************************************/
#define AON_SHIFT_SW_USE0                            0
#define AON_MASK_SW_USE0                             ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup AON_REG_AON_SW_DBG1
 * @brief                                            (@ 0X058)
 * @{
 *****************************************************************************/
#define AON_SHIFT_SW_USE1                            0
#define AON_MASK_SW_USE1                             ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup AON_REG_AON_XTAL_CLK_CTRL0
 * @brief                                            (@ 0X05C)
 * @{
 *****************************************************************************/
#define AON_SHIFT_XTAL_SC_XO                         21
#define AON_MASK_XTAL_SC_XO                          ((u32)0x0000007F << 21)                             /*!<R/W 1000000  1: reduce cap, 0: increase cap. (160fF per unit) [efuse for BT only ] */
#define AON_SHIFT_XTAL_SC_XI                         14
#define AON_MASK_XTAL_SC_XI                          ((u32)0x0000007F << 14)                             /*!<R/W 1000000  1: reduce cap, 0: increase cap. (160fF per unit) [efuse for BT only ] */
#define AON_SHIFT_XTAL_GMN                           9
#define AON_MASK_XTAL_GMN                            ((u32)0x0000001F << 9)                              /*!<R/W 11111  GMN: 0~31 */
#define AON_SHIFT_XTAL_GMP                           4
#define AON_MASK_XTAL_GMP                            ((u32)0x0000001F << 4)                              /*!<R/W 11111  GMP: 0~31 */
#define AON_SHIFT_XTAL_POR                           3
#define AON_BIT_XTAL_POR                             ((u32)0x00000001 << 3)                              /*!<R/W 0  1: Enable xtal 0.9V */
#define AON_SHIFT_XTAL_HW33_EN                       2
#define AON_BIT_XTAL_HW33_EN                         ((u32)0x00000001 << 2)                              /*!<R/W 0  1: Enable xtal 3.3V */
#define AON_SHIFT_POW_XTAL                           1
#define AON_BIT_POW_XTAL                             ((u32)0x00000001 << 1)                              /*!<R/W 0  0 to 1 Enable xtal  */
#define AON_SHIFT_POW_BG                             0
#define AON_BIT_POW_BG                               ((u32)0x00000001 << 0)                              /*!<R/W 0  Enable BG (BG for xtal and AFE) */
/** @} */

/**************************************************************************//**
 * @defgroup AON_REG_AON_XTAL_CLK_CTRL1
 * @brief                                            (@ 0X060)
 * @{
 *****************************************************************************/
#define AON_SHIFT_XTAL_LPS_DIVISOR                   29
#define AON_BIT_XTAL_LPS_DIVISOR                     ((u32)0x00000001 << 29)                             /*!<R/W 0  XTAL LPS clock divider 0: XTAL/128(40M), 1: XTAL/64 */
#define AON_SHIFT_XTAL_CKDIGI_SEL                    28
#define AON_BIT_XTAL_CKDIGI_SEL                      ((u32)0x00000001 << 28)                             /*!<R/W 1  1: DIGI CLK from self-bias 0: DIGI CLK from Schmitt */
#define AON_SHIFT_EN_XTAL_LPS_CLK                    27
#define AON_BIT_EN_XTAL_LPS_CLK                      ((u32)0x00000001 << 27)                             /*!<R/W 1  1: enable XTAL LPS clock (312.5kHz enable) */
#define AON_SHIFT_EN_XTAL_SCHMITT                    26
#define AON_BIT_EN_XTAL_SCHMITT                      ((u32)0x00000001 << 26)                             /*!<R/W 1  1: enable XTAL SCHMITT  */
#define AON_SHIFT_XTAL_LDO_VREF                      23
#define AON_MASK_XTAL_LDO_VREF                       ((u32)0x00000007 << 23)                             /*!<R/W 011  111: 1.25V 110: 1.2V 101:1.15V 100:1.1V 011: 1.05V 010: 1V 001: 0.95V 000: 0.9V */
#define AON_SHIFT_XTAL_SEL_TOK                       20
#define AON_MASK_XTAL_SEL_TOK                        ((u32)0x00000007 << 20)                             /*!<R/W 100  For cycles / 40MHz / 26MHz 000: 8 / 200n / 300n 001: 16 / 400n / 600n 010: 32 / 800n / 1.2u 011: 64 / 1.6u / 2.5u 100: 2^14 / 0.4m / 0.6m 101: 2^15 / 0.8m / 1.2m 110: 2^16 / 1.6m / 2.5m 111: 2^17 / 3.2m / 4.9m  */
#define AON_SHIFT_EN_XTAL_DRV_LPS                    19
#define AON_BIT_EN_XTAL_DRV_LPS                      ((u32)0x00000001 << 19)                             /*!<R/W 0  LPS enable clock source control, 1:enable, 0: gated (312.5kHz enable) */
#define AON_SHIFT_EN_XTAL_DRV_DIGI                   18
#define AON_BIT_EN_XTAL_DRV_DIGI                     ((u32)0x00000001 << 18)                             /*!<R/W 0  DIGI enable clock source control, 1:enable, 0: gated  */
#define AON_SHIFT_EN_XTAL_DRV_USB                    17
#define AON_BIT_EN_XTAL_DRV_USB                      ((u32)0x00000001 << 17)                             /*!<R/W 0  USB enable clock source control, 1:enable, 0: gated  */
#define AON_SHIFT_EN_XTAL_DRV_AFE                    16
#define AON_BIT_EN_XTAL_DRV_AFE                      ((u32)0x00000001 << 16)                             /*!<R/W 0  AFE enable clock source control, 1:enable, 0: gated (for WL AFE PLL) */
#define AON_SHIFT_EN_XTAL_DRV_RF2                    15
#define AON_BIT_EN_XTAL_DRV_RF2                      ((u32)0x00000001 << 15)                             /*!<R/W 0  RF2 enable clock source control, 1:enable, 0: gated (for BT) */
#define AON_SHIFT_EN_XTAL_DRV_RF1                    14
#define AON_BIT_EN_XTAL_DRV_RF1                      ((u32)0x00000001 << 14)                             /*!<R/W 0  RF1 enable clock source control, 1:enable, 0: gated (for WL SYN) */
#define AON_SHIFT_XTAL_SC_LPS_RO                     7
#define AON_MASK_XTAL_SC_LPS_RO                      ((u32)0x0000007F << 7)                              /*!<R 0x3f  0: reduce cap, 1: incease cap. (160fF per unit) efuse for BT only Singal from XMD output XTAL_SC_LPS_i<6:0> */
#define AON_SHIFT_XTAL_SC_INIT                       0
#define AON_MASK_XTAL_SC_INIT                        ((u32)0x0000007F << 0)                              /*!<R/W 0000000  0: reduce cap, 1: increase cap. (160fF per unit) efuse for BT only Set to 0 if external Cap is available */
/** @} */

/**************************************************************************//**
 * @defgroup AON_REG_AON_XTAL_CLK_CTRL2
 * @brief                                            (@ 0X064)
 * @{
 *****************************************************************************/
#define AON_SHIFT_XTAL_LPMODE                        31
#define AON_BIT_XTAL_LPMODE                          ((u32)0x00000001 << 31)                             /*!<R/W 0  1: low power mode enable 22C turn off replica path, RF1 no CLK RF2 sweep to LPS buf  */
#define AON_SHIFT_XTAL_DELAY_DIGI                    30
#define AON_BIT_XTAL_DELAY_DIGI                      ((u32)0x00000001 << 30)                             /*!<R/W 1  1: turn on XI/XO Cfix, single side 8pF */
#define AON_SHIFT_XTAL_DELAY_USB                     29
#define AON_BIT_XTAL_DELAY_USB                       ((u32)0x00000001 << 29)                             /*!<R/W 1  0: short, 1:long */
#define AON_SHIFT_XTAL_DELAY_AFE                     28
#define AON_BIT_XTAL_DELAY_AFE                       ((u32)0x00000001 << 28)                             /*!<R/W 1  0: short, 1:long */
#define AON_SHIFT_XTAL_DRV_DIGI                      26
#define AON_MASK_XTAL_DRV_DIGI                       ((u32)0x00000003 << 26)                             /*!<R/W 11  Driving control of DIGI/LPS clock buffer, 11:large current, 00: small current  */
#define AON_SHIFT_XTAL_DRV_USB                       24
#define AON_MASK_XTAL_DRV_USB                        ((u32)0x00000003 << 24)                             /*!<R/W 11  Driving control of USB clock buffer, 11:large current, 00: small current */
#define AON_SHIFT_XTAL_DRV_AFE                       22
#define AON_MASK_XTAL_DRV_AFE                        ((u32)0x00000003 << 22)                             /*!<R/W 11  Driving control of AFE clock buffer, 11:large current, 00: small current */
#define AON_SHIFT_XTAL_DRV_RF2                       20
#define AON_MASK_XTAL_DRV_RF2                        ((u32)0x00000003 << 20)                             /*!<R/W 11  Driving control of RF2 clock buffer, 11:large current, 00: small current */
#define AON_SHIFT_XTAL_DRV_RF1                       18
#define AON_MASK_XTAL_DRV_RF1                        ((u32)0x00000003 << 18)                             /*!<R/W 11  Driving control of RF1 clock buffer, 11:large current, 00: small current */
#define AON_SHIFT_XTAL_DRV_RF_LATCH                  17
#define AON_BIT_XTAL_DRV_RF_LATCH                    ((u32)0x00000001 << 17)                             /*!<R/W 1  1: latch enable */
#define AON_SHIFT_XTAL_GM_SEP                        16
#define AON_BIT_XTAL_GM_SEP                          ((u32)0x00000001 << 16)                             /*!<R/W 0  0: GMP=GMN */
#define AON_SHIFT_XQSEL_RF_AWAKE                     15
#define AON_BIT_XQSEL_RF_AWAKE                       ((u32)0x00000001 << 15)                             /*!<R/W 1  0: Schmitt trigger, 1:replica INV(for OK0=1) */
#define AON_SHIFT_XQSEL_RF_INITIAL                   14
#define AON_BIT_XQSEL_RF_INITIAL                     ((u32)0x00000001 << 14)                             /*!<R/W 0  0: Schmitt trigger, 1:replica INV(for OK0=0) */
#define AON_SHIFT_XQSEL                              13
#define AON_BIT_XQSEL                                ((u32)0x00000001 << 13)                             /*!<R/W 0  0: Schmitt trigger, 1:replica INV(for AFE) */
#define AON_SHIFT_GATED_XTAL_OK0                     12
#define AON_BIT_GATED_XTAL_OK0                       ((u32)0x00000001 << 12)                             /*!<R/W 0  1:Gated xtal OK0 */
#define AON_SHIFT_EN_XTAL_DRV_IQK_BCN                11
#define AON_BIT_EN_XTAL_DRV_IQK_BCN                  ((u32)0x00000001 << 11)                             /*!<R/W 1  IQKPLL enable clock source control, 1:enable, 0: gate */
#define AON_SHIFT_AAC_MODE                           9
#define AON_MASK_AAC_MODE                            ((u32)0x00000003 << 9)                              /*!<R/W 01  AAC_MODE for LPS 00: all XOXI cap off 01: cap from XTAL_SC_LPS 10: cap from XTAL_SC_INIT 11: cap from XTAL_SC_XI/XO */
#define AON_SHIFT_XTAL_CFIX                          7
#define AON_MASK_XTAL_CFIX                           ((u32)0x00000003 << 7)                              /*!<R/W 11  11: 7.9pF, 10: 4.5pF, 01: 3.4pF, 00: off */
#define AON_SHIFT_XTAL_AAC_OPCUR                     5
#define AON_MASK_XTAL_AAC_OPCUR                      ((u32)0x00000003 << 5)                              /*!<R/W 11  00: 200nA , 200n/step For AAC robust 11 */
#define AON_SHIFT_XTAL_VREF_SEL                      0
#define AON_MASK_XTAL_VREF_SEL                       ((u32)0x0000001F << 0)                              /*!<R/W 11000  Analog AAC VREF, 390mV~700mV, 10mV/step 11000: Vpp 500mV  */
/** @} */

/**************************************************************************//**
 * @defgroup AON_REG_AON_XTAL_CLK_CTRL3
 * @brief                                            (@ 0X068)
 * @{
 *****************************************************************************/
#define AON_SHIFT_XTAL_SRC_BT                        29
#define AON_MASK_XTAL_SRC_BT                         ((u32)0x00000007 << 29)                             /*!<R/W 000  Dummy(w/o SRC) */
#define AON_SHIFT_XTAL_SRC_RF                        26
#define AON_MASK_XTAL_SRC_RF                         ((u32)0x00000007 << 26)                             /*!<R/W 000  Dummy(w/o SRC) */
#define AON_SHIFT_XTAL_DUMMY                         22
#define AON_MASK_XTAL_DUMMY                          ((u32)0x0000000F << 22)                             /*!<R/W 0000  Dummy control bits  */
#define AON_SHIFT_XTAL_EN_LNBUF                      21
#define AON_BIT_XTAL_EN_LNBUF                        ((u32)0x00000001 << 21)                             /*!<R/W 0  0: separate bias buffer (lower current higher noise) 1: self-bias (higher current lower noise) */
#define AON_SHIFT_XTAL__AAC_TIE_MID                  20
#define AON_BIT_XTAL__AAC_TIE_MID                    ((u32)0x00000001 << 20)                             /*!<R/W 0  XTAL_ AAC_TIE_MID=1 & EN_XTAL_PDCK_VREF=0 & using XTAL_VREF_SEL<4:0> for lock detect */
#define AON_SHIFT_XTAL_AAC_IOFFSET                   18
#define AON_MASK_XTAL_AAC_IOFFSET                    ((u32)0x00000003 << 18)                             /*!<R/W 00  Analog AAC IOFFSET current 00: off, 01:2uA, 10:4uA, 11:6uA */
#define AON_SHIFT_XTAL_AAC_CAP                       16
#define AON_MASK_XTAL_AAC_CAP                        ((u32)0x00000003 << 16)                             /*!<R/W 11  Analog AAC domain pole cap 3pF/step 00: no cap,11: max cap */
#define AON_SHIFT_XTAL_PDSW                          14
#define AON_MASK_XTAL_PDSW                           ((u32)0x00000003 << 14)                             /*!<R/W 01  XTAL analog AAC peak detector source follower size, 00: small 11: large */
#define AON_SHIFT_XTAL_LPS_BUF_VB                    12
#define AON_MASK_XTAL_LPS_BUF_VB                     ((u32)0x00000003 << 12)                             /*!<R/W 00  00: small current, 11: large current */
#define AON_SHIFT_XTAL_PDCK_MANU                     11
#define AON_BIT_XTAL_PDCK_MANU                       ((u32)0x00000001 << 11)                             /*!<R/W 0  1: open analog AAC loop for PDCK manual  */
#define AON_SHIFT_XTAL_PDCK_OK_MANU                  10
#define AON_BIT_XTAL_PDCK_OK_MANU                    ((u32)0x00000001 << 10)                             /*!<R/W 1  1: force PDCK_OK=1 for PDCK manual */
#define AON_SHIFT_EN_XTAL_PDCK_VREF                  9
#define AON_BIT_EN_XTAL_PDCK_VREF                    ((u32)0x00000001 << 9)                              /*!<R/W 1  1: analog AAC VREF from PDCK digital circuit 0: analog AAC VREF from XTAL_VREF_SEL for BT only mode */
#define AON_SHIFT_XTAL_SEL_PWR                       8
#define AON_BIT_XTAL_SEL_PWR                         ((u32)0x00000001 << 8)                              /*!<R/W 0  1: external 0.9V, 0: internal 0.9V (FIB) */
#define AON_SHIFT_XTAL_PK_SEL_OFFSET                 7
#define AON_BIT_XTAL_PK_SEL_OFFSET                   ((u32)0x00000001 << 7)                              /*!<R/W 0  1: XI Vpk-to-Vpk offset to 00: 0.4V 01: 0.5V 10: 0.6V 11: 0.7V */
#define AON_SHIFT_XTAL_MANU_PK_SEL                   5
#define AON_MASK_XTAL_MANU_PK_SEL                    ((u32)0x00000003 << 5)                              /*!<R/W 11  XI Vpk-to-Vpk 00: 0.7V 01: 0.8V 10: 0.9V 11: 1V */
#define AON_SHIFT_XTAL_AACK_PK_MANU                  4
#define AON_BIT_XTAL_AACK_PK_MANU                    ((u32)0x00000001 << 4)                              /*!<R/W 0  1: manual for peak detector peak selection  */
#define AON_SHIFT_EN_XTAL_AAC_PKDET                  3
#define AON_BIT_EN_XTAL_AAC_PKDET                    ((u32)0x00000001 << 3)                              /*!<R/W 0  1: enable xtal aac peak detector */
#define AON_SHIFT_EN_XTAL_AAC_GM                     2
#define AON_BIT_EN_XTAL_AAC_GM                       ((u32)0x00000001 << 2)                              /*!<R/W 0  1: enable xtal aac gm control ,Note: This bit must be able to write by SW */
#define AON_SHIFT_XTAL_LDO_OPVB_SEL                  1
#define AON_BIT_XTAL_LDO_OPVB_SEL                    ((u32)0x00000001 << 1)                              /*!<R/W 0  0: OP bias from IBG, 1: OP bias from Res divider */
#define AON_SHIFT_XTAL_LDO_NC                        0
#define AON_BIT_XTAL_LDO_NC                          ((u32)0x00000001 << 0)                              /*!<R/W 0  1: low current normal mode (22C) 0:high current normal mode (BT could be control this pin) */
/** @} */

/**************************************************************************//**
 * @defgroup AON_REG_AON_XTAL_CLK_CTRL4
 * @brief                                            (@ 0X06C)
 * @{
 *****************************************************************************/
#define AON_SHIFT__XTAL_MODE_DEC                     15
#define AON_MASK__XTAL_MODE_DEC                      ((u32)0x00000003 << 15)                             /*!<R 10  XTAL Dec Mode */
#define AON_SHIFT_XMD_STATE                          10
#define AON_MASK_XMD_STATE                           ((u32)0x0000001F << 10)                             /*!<R 01011  XMD State */
#define AON_SHIFT_XTAL_SC_LPS                        3
#define AON_MASK_XTAL_SC_LPS                         ((u32)0x0000007F << 3)                              /*!<R/W 0000000  XTAL cap setting @LP 0: reduce cap, 1: increase cap. (160fF per unit) */
#define AON_SHIFT_XTAL_SRC_IQK_BCN                   0
#define AON_MASK_XTAL_SRC_IQK_BCN                    ((u32)0x00000007 << 0)                              /*!<R/W 000  Dummy(w/o SRC) */
/** @} */

