Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/lib/include/rtl8735b_aon_type.h
/**************************************************************************//**
 * @defgroup AON_REG_AON_XTAL_CLK_CTRL5
 * @brief                                            (@ 0X070)
 * @{
 *****************************************************************************/
#define AON_SHIFT_XAAC_LPOW                          31
#define AON_BIT_XAAC_LPOW                            ((u32)0x00000001 << 31)                             /*!<R/W 0  AACK low power mode, 1:gating input clk */
#define AON_SHIFT_AAC_MODE_ON                        29
#define AON_MASK_AAC_MODE_ON                         ((u32)0x00000003 << 29)                             /*!<R/W 11  11: XTAL_AACK_PK_SEL=<11>'s XTAL_GM_OUT3 10: XTAL_AACK_PK_SEL=<10>'s XTAL_GM_OUT2 01: XTAL_AACK_PK_SEL=<01>'s XTAL_GM_OUT1 00: XTAL_AACK_PK_SEL=<00>'s XTAL_GM_OUT0 */
#define AON_SHIFT_EN_XTAL_AAC_TRIG                   28
#define AON_BIT_EN_XTAL_AAC_TRIG                     ((u32)0x00000001 << 28)                             /*!<R/W 0  Set by pmc and clr by HW finish calibration */
#define AON_SHIFT_EN_XTAL_AAC                        27
#define AON_BIT_EN_XTAL_AAC                          ((u32)0x00000001 << 27)                             /*!<R/W 0  0:aac off 1:aac power on */
#define AON_SHIFT_EN_XTAL_AAC_DIGI                   26
#define AON_BIT_EN_XTAL_AAC_DIGI                     ((u32)0x00000001 << 26)                             /*!<R/W 0  1:enable aac digital circuit */
#define AON_SHIFT_GM_MANUAL                          21
#define AON_MASK_GM_MANUAL                           ((u32)0x0000001F << 21)                             /*!<R/W 11111  Gm manual at EN_XTAL_AAC_DIGI=0 */
#define AON_SHIFT_GM_STUP                            16
#define AON_MASK_GM_STUP                             ((u32)0x0000001F << 16)                             /*!<R/W 11111  aac gm initial setting */
#define AON_SHIFT_XTAL_CK_SET_2_0                    13
#define AON_MASK_XTAL_CK_SET_2_0                     ((u32)0x00000007 << 13)                             /*!<R/W 011  aac settling cycles (4M CLK) 000: 64us 001: 128us 010: 256us 011: 512us 100: 1024us 101: 2048us 110: 4096us 111: 8192us */
#define AON_SHIFT_GM_INIT                            8
#define AON_MASK_GM_INIT                             ((u32)0x0000001F << 8)                              /*!<R/W 11111  aac gm initial setting  */
#define AON_SHIFT_GM_STEP                            7
#define AON_BIT_GM_STEP                              ((u32)0x00000001 << 7)                              /*!<R/W 0  aac gm searching step. 0:step 1, 1:step 2 */
#define AON_SHIFT_XAAC_GM_OFFSET                     2
#define AON_MASK_XAAC_GM_OFFSET                      ((u32)0x0000001F << 2)                              /*!<R/W 00000  aac calibrated gm result +/- offset */
#define AON_SHIFT_OFFSET_PLUS                        1
#define AON_BIT_OFFSET_PLUS                          ((u32)0x00000001 << 1)                              /*!<R/W 1  0: aac calibrated gm result - offset , 1:aac calibrated gm result + offset  */
#define AON_SHIFT_RESET_N                            0
#define AON_BIT_RESET_N                              ((u32)0x00000001 << 0)                              /*!<R/W 0  AAC digital circuit reset (low to high) */
/** @} */

/**************************************************************************//**
 * @defgroup AON_REG_AON_XTAL_CLK_CTRL6
 * @brief                                            (@ 0X074)
 * @{
 *****************************************************************************/
#define AON_SHIFT_XTAL_LDO_LPS                       26
#define AON_MASK_XTAL_LDO_LPS                        ((u32)0x00000007 << 26)                             /*!<R/W 010  (after oscillation, into LPS) 111: 1.1V 110: 1.05V 101:1V 100:0.95V 011: 0.9V 010: 0.85V 001: 0.8V 000: 0.75V */
#define AON_SHIFT_XTAL_WAIT_CYC                      20
#define AON_MASK_XTAL_WAIT_CYC                       ((u32)0x0000003F << 20)                             /*!<R/W 000011  Next state wait cycle, 83ns/unit */
#define AON_SHIFT_XTAL_LDO_OK                        17
#define AON_MASK_XTAL_LDO_OK                         ((u32)0x00000007 << 17)                             /*!<R/W 011  (after oscillation) X11: 1.3V X10: 1.2V X01:1.1V X00:0.9V XTAL_LDO_OK<2>: no use  */
#define AON_SHIFT_XTAL_MD_LPOW                       16
#define AON_BIT_XTAL_MD_LPOW                         ((u32)0x00000001 << 16)                             /*!<R/W 0  XTAL mode decoder low power mode 1: gated input clock */
#define AON_SHIFT_XTAL_OV_RATIO                      14
#define AON_MASK_XTAL_OV_RATIO                       ((u32)0x00000003 << 14)                             /*!<R/W 01  overlap unit times (4M ring) 00: 128us 01: 256us 10: 512us 11: 1024us */
#define AON_SHIFT_XTAL_OV_UNIT                       11
#define AON_MASK_XTAL_OV_UNIT                        ((u32)0x00000007 << 11)                             /*!<R/W 011  overlap time settling cycles (4M ring) 000: 2us 001: 4us 010: 8us 011: 16us 100: 32us 101: 64us 110: 128us 111: 256us */
#define AON_SHIFT_XTAL_MODE_MANUAL                   9
#define AON_MASK_XTAL_MODE_MANUAL                    ((u32)0x00000003 << 9)                              /*!<R/W 11  01: LPS mode 10: Normal mode 11: high performance mode */
#define AON_SHIFT_XTAL_MANU_SEL                      8
#define AON_BIT_XTAL_MANU_SEL                        ((u32)0x00000001 << 8)                              /*!<R/W 0  1: enable xtal mode manual */
#define AON_SHIFT_POW_XTAL_LPS                       7
#define AON_BIT_POW_XTAL_LPS                         ((u32)0x00000001 << 7)                              /*!<R/W 0  POW_XTAL_LPS */
#define AON_SHIFT_XTAL_MODE                          6
#define AON_BIT_XTAL_MODE                            ((u32)0x00000001 << 6)                              /*!<R/W 1  xtal mode define: 0: LPS mode 1: high performance mode */
#define AON_SHIFT_XDECODE_RESET_N                    5
#define AON_BIT_XDECODE_RESET_N                      ((u32)0x00000001 << 5)                              /*!<R/W 1  Decoder digital circuit reset (low to high) */
#define AON_SHIFT_PK_END_AR                          3
#define AON_MASK_PK_END_AR                           ((u32)0x00000003 << 3)                              /*!<R/W 11  AAC peak sel end (star>end) */
#define AON_SHIFT_PK_START_AR                        1
#define AON_MASK_PK_START_AR                         ((u32)0x00000003 << 1)                              /*!<R/W 11  AACK peak sel start (star>end) */
#define AON_SHIFT_XAAC_LUT_MANUAL_EN                 0
#define AON_BIT_XAAC_LUT_MANUAL_EN                   ((u32)0x00000001 << 0)                              /*!<R/W 0  1: enable LUT data: GM_MANUAL<4:0> , sel: AAC_MODE<1:0> */
/** @} */

/**************************************************************************//**
 * @defgroup AON_REG_AON_XTAL_CLK_CTRL7
 * @brief                                            (@ 0X078)
 * @{
 *****************************************************************************/
#define AON_SHIFT_XTAL_LPS_CAP_CTRL                  30
#define AON_BIT_XTAL_LPS_CAP_CTRL                    ((u32)0x00000001 << 30)                             /*!<R/W 1  1:cap step control */
#define AON_SHIFT_XTAL_LPS_CAP_STEP                  28
#define AON_MASK_XTAL_LPS_CAP_STEP                   ((u32)0x00000003 << 28)                             /*!<R/W 10  00:1 step/01:2 step/10:4 step /11:8 step */
#define AON_SHIFT_XTAL_LPS_CAP_CYC                   26
#define AON_MASK_XTAL_LPS_CAP_CYC                    ((u32)0x00000003 << 26)                             /*!<R/W 01  00:8u/01:16u/10:32u/11:64u */
#define AON_SHIFT_XMD_SEL                            24
#define AON_MASK_XMD_SEL                             ((u32)0x00000003 << 24)                             /*!<R/W 10  00:100K/01:500K/10:4M/11:12M */
#define AON_SHIFT_SCAN_MODE_XMD                      23
#define AON_BIT_SCAN_MODE_XMD                        ((u32)0x00000001 << 23)                             /*!<R/W 0  1:scan mode */
#define AON_SHIFT_PDCK_LPOW                          22
#define AON_BIT_PDCK_LPOW                            ((u32)0x00000001 << 22)                             /*!<R/W 0  PDCK low power mode, 1:gating input clk Set to 1 when PDCK finished */
#define AON_SHIFT_XPDCK_VREF_SEL                     17
#define AON_MASK_XPDCK_VREF_SEL                      ((u32)0x0000001F << 17)                             /*!<R/W 00011  PDCK calibrated result +offset For AAC robust +3 */
#define AON_SHIFT_XTAL_PDCK_UNIT                     15
#define AON_MASK_XTAL_PDCK_UNIT                      ((u32)0x00000003 << 15)                             /*!<R/W 01  PDCK settling cycles (4M CLK) 00: 4us 01: 8us 10: 16us 11: 32us */
#define AON_SHIFT_VREF_INIT                          10
#define AON_MASK_VREF_INIT                           ((u32)0x0000001F << 10)                             /*!<R/W 11111  PDCK VREF initial setting */
#define AON_SHIFT_VREF_MANUAL                        5
#define AON_MASK_VREF_MANUAL                         ((u32)0x0000001F << 5)                              /*!<R/W 11111  VREF manual at EN_XTAL_PDCK_DIGI=0 */
#define AON_SHIFT_PDCK_WAIT_CYC                      3
#define AON_MASK_PDCK_WAIT_CYC                       ((u32)0x00000003 << 3)                              /*!<R/W 01  Enable PDCK waiting (4M CLK) 00: 64us 01:128us 10:256us 11:512us */
#define AON_SHIFT_PDCK_SEARCH_MODE                   2
#define AON_BIT_PDCK_SEARCH_MODE                     ((u32)0x00000001 << 2)                              /*!<R/W 0  0: binary search, 1: full search from 31  */
#define AON_SHIFT_EN_XTAL_PDCK_DIGI                  1
#define AON_BIT_EN_XTAL_PDCK_DIGI                    ((u32)0x00000001 << 1)                              /*!<R/W 0  Default set 0 due to POW_XTAL will 1 before do PDCK */
#define AON_SHIFT_PDCK_RESET_N                       0
#define AON_BIT_PDCK_RESET_N                         ((u32)0x00000001 << 0)                              /*!<R/W 0  PDCK digital circuit reset (low to high) */
/** @} */

/**************************************************************************//**
 * @defgroup AON_REG_AON_SRC_CLK_CTRL
 * @brief                                            (@ 0X07C)
 * @{
 *****************************************************************************/
#define AON_SHIFT_LP_CLK_SEL                         26
#define AON_MASK_LP_CLK_SEL                          ((u32)0x00000007 << 26)                             /*!<R/W 000  32K clock source of WLON selection b'000: OSC 32K (32K output of OSC 128K) b'001: OSC 128K with SDM b'011: XTAL (high speed) with divider b'100: XTAL 32K others: rsvd */
#define AON_SHIFT_TIMER_SCLK_SEL                     4
#define AON_BIT_TIMER_SCLK_SEL                       ((u32)0x00000001 << 4)                              /*!<R/W 0  0: AON LP 32K clock source 1: ANACLK 100KHz */
#define AON_SHIFT_COMP_SCLK_SEL                      3
#define AON_BIT_COMP_SCLK_SEL                        ((u32)0x00000001 << 3)                              /*!<R/W 0  0: AON LP 32K clock source 1: OSC 128K/4(without SDM?) */
#define AON_SHIFT_GPIO_SCLK_SEL                      2
#define AON_BIT_GPIO_SCLK_SEL                        ((u32)0x00000001 << 2)                              /*!<R/W 0  0: AON LP 32K clock source 1: OSC 128K/4(without SDM?) */
#define AON_SHIFT_XTAL_DIVIDER_EN                    0
#define AON_BIT_XTAL_DIVIDER_EN                      ((u32)0x00000001 << 0)                              /*!<R/W 0  1: Enable XTAL divider */
/** @} */

/**************************************************************************//**
 * @defgroup AON_REG_AON_CLK_STS
 * @brief                                            (@ 0X080)
 * @{
 *****************************************************************************/
#if IS_CUT_TEST(CONFIG_CHIP_VER)
#define AON_SHIFT_ANA4M_CLK_RDY                      3
#define AON_BIT_ANA4M_CLK_RDY                        ((u32)0x00000001 << 3)                              /*!<R 0  OSC4MHz Clock Ready */
#endif
#define AON_SHIFT_REGU_CLK_RDY                       2
#define AON_BIT_REGU_CLK_RDY                         ((u32)0x00000001 << 2)                              /*!<R 1  Regulator Clock 100KHz Clock Ready */
#define AON_SHIFT_32KXTAL_RDY                        1
#define AON_BIT_32KXTAL_RDY                          ((u32)0x00000001 << 1)                              /*!<R 0  32KHz XTALClock Ready */
#define AON_SHIFT_XTAL_RDY                           0
#define AON_BIT_XTAL_RDY                             ((u32)0x00000001 << 0)                              /*!<R 0  High performance XTALClock Ready */
/** @} */

/**************************************************************************//**
 * @defgroup AON_REG_AON_WAKE_TIMER
 * @brief                                            (@ 0X084)
 * @{
 *****************************************************************************/
#define AON_SHIFT_WAKE_TM_EN                         31
#define AON_BIT_WAKE_TM_EN                           ((u32)0x00000001 << 31)                             /*!<R/W 0  AON wake timer Enable */
#define AON_SHIFT_TIMER_ISR                          30
#define AON_BIT_TIMER_ISR                            ((u32)0x00000001 << 30)                             /*!<R/W1C 0  1: Indicate AON Timer Interrupt Status */
#define AON_SHIFT_WAKE_TM_TC                         0
#define AON_MASK_WAKE_TM_TC                          ((u32)0x3FFFFFFF << 0)                              /*!<R/W 0  AON wake timer counter value */
/** @} */

/**************************************************************************//**
 * @defgroup AON_REG_AON_PLL_CTRL0
 * @brief                                            (@ 0X088)
 * @{
 *****************************************************************************/
#define AON_SHIFT_SETTLE_TIME_FACTOR                 24
#define AON_MASK_SETTLE_TIME_FACTOR                  ((u32)0x00000003 << 24)                             /*!<R/W 0  0: delay *1, 1:delay *2, 2: delay *4, 3:delay *8 */
#define AON_SHIFT_SW_LDO2PWRCUT                      23
#define AON_BIT_SW_LDO2PWRCUT                        ((u32)0x00000001 << 23)                             /*!<R/W 0  0: LDO 1: power cut */
#define AON_SHIFT_SW_LDO_OUT                         21
#define AON_MASK_SW_LDO_OUT                          ((u32)0x00000003 << 21)                             /*!<R/W 01  00/01/10/11 0.85/0.9/0.95/1 */
#define AON_SHIFT_VPULSE_LDO                         20
#define AON_BIT_VPULSE_LDO                           ((u32)0x00000001 << 20)                             /*!<R/W 1   */
#define AON_SHIFT_POW_LDO09                          19
#define AON_BIT_POW_LDO09                            ((u32)0x00000001 << 19)                             /*!<R/W 0  Power on 13to09 LDO */
#define AON_SHIFT_VSET_1_0                           17
#define AON_MASK_VSET_1_0                            ((u32)0x00000003 << 17)                             /*!<R/W 01   */
#define AON_SHIFT_POW_LDO18                          16
#define AON_BIT_POW_LDO18                            ((u32)0x00000001 << 16)                             /*!<R/W 0  Power on 33to18 LDO */
#define AON_SHIFT_PLL_CTRL0_DUMMY_0                  15
#define AON_BIT_PLL_CTRL0_DUMMY_0                    ((u32)0x00000001 << 15)                             /*!<R/W 0   */
#define AON_SHIFT_PLL_VR1200_TUNE_2_0                12
#define AON_MASK_PLL_VR1200_TUNE_2_0                 ((u32)0x00000007 << 12)                             /*!<R/W 100  Add 40k per step fine tune BG */
#define AON_SHIFT_PLL_CTRL0_DUMMY_1                  11
#define AON_BIT_PLL_CTRL0_DUMMY_1                    ((u32)0x00000001 << 11)                             /*!<R/W 0   */
#define AON_SHIFT_PLL_R2_TUNE_2_0                    8
#define AON_MASK_PLL_R2_TUNE_2_0                     ((u32)0x00000007 << 8)                              /*!<R/W 100  Add 20k per step fine tune BG */
#define AON_SHIFT_PLL_CTRL0_DUMMY_2                  7
#define AON_BIT_PLL_CTRL0_DUMMY_2                    ((u32)0x00000001 << 7)                              /*!<R/W 0   */
#define AON_SHIFT_PLL_R1_TUNE_2_0                    4
#define AON_MASK_PLL_R1_TUNE_2_0                     ((u32)0x00000007 << 4)                              /*!<R/W 100  Add 200k per step fine tune BG */
#define AON_SHIFT_PLL_CTRL0_DUMMY_3                  3
#define AON_BIT_PLL_CTRL0_DUMMY_3                    ((u32)0x00000001 << 3)                              /*!<R/W 0   */
#define AON_SHIFT_PLL_POW_MBIAS                      2
#define AON_BIT_PLL_POW_MBIAS                        ((u32)0x00000001 << 2)                              /*!<R/W 0  power on mbias */
#define AON_SHIFT_PLL_POW_I                          1
#define AON_BIT_PLL_POW_I                            ((u32)0x00000001 << 1)                              /*!<R/W 0  power on BG current */
#define AON_SHIFT_PLL_POW_BG                         0
#define AON_BIT_PLL_POW_BG                           ((u32)0x00000001 << 0)                              /*!<R/W 0  power on BG */
/** @} */

/**************************************************************************//**
 * @defgroup AON_REG_AON_SD_CTRL0
 * @brief                                            (@ 0X08C)
 * @{
 *****************************************************************************/
#define AON_SHIFT_SD_CTRL0_DUMMY_0                   18
#define AON_MASK_SD_CTRL0_DUMMY_0                    ((u32)0x00000003 << 18)                             /*!<R/W 00   */
#define AON_SHIFT_SD_VOS_L                           15
#define AON_MASK_SD_VOS_L                            ((u32)0x00000007 << 15)                             /*!<R/W 011  Offset tunning for comparator */
#define AON_SHIFT_SD_VOS_H                           12
#define AON_MASK_SD_VOS_H                            ((u32)0x00000007 << 12)                             /*!<R/W 011  Offset tunning for comparator */
#define AON_SHIFT_SEL_VREFL                          7
#define AON_MASK_SEL_VREFL                           ((u32)0x0000001F << 7)                              /*!<R/W 00000  vref low voltage 0000:25mV, 25mV/step */
#define AON_SHIFT_SEL_VREFH                          2
#define AON_MASK_SEL_VREFH                           ((u32)0x0000001F << 2)                              /*!<R/W 00000  vref high voltage 0000:25mV, 25mV/step */
#define AON_SHIFT_SD_POSEDGE                         1
#define AON_BIT_SD_POSEDGE                           ((u32)0x00000001 << 1)                              /*!<R/W 1  1: vin>vref output high */
#define AON_SHIFT_POW_SD                             0
#define AON_BIT_POW_SD                               ((u32)0x00000001 << 0)                              /*!<R/W 0  Power on signal detector */
/** @} */

/**************************************************************************//**
 * @defgroup AON_REG_AON_PAD_CTRL
 * @brief                                            (@ 0X090)
 * @{
 *****************************************************************************/
#define AON_SHIFT_PON_GPIO_WDT_RST_MSK               9
#define AON_BIT_PON_GPIO_WDT_RST_MSK                 ((u32)0x00000001 << 9)                              /*!<R/W 0  1: Mask this bit and then WDOG_RST and CPU_RST can reset PON GPIO block */
#define AON_SHIFT_SYSON_GPIO_WDT_RST_MSK             8
#define AON_BIT_SYSON_GPIO_WDT_RST_MSK               ((u32)0x00000001 << 8)                              /*!<R/W 0  1: Mask this bit and then WDOG_RST and CPU_RST can reset SYSON GPIO block */
#define AON_SHIFT_AON_GPIO_WDT_RST_MSK               7
#define AON_BIT_AON_GPIO_WDT_RST_MSK                 ((u32)0x00000001 << 7)                              /*!<R/W 0  1: Mask this bit and then WDOG_RST and CPU_RST can reset AON GPIO block */
#define AON_SHIFT_SYSON_GPIOS_PWD33                  6
#define AON_BIT_SYSON_GPIOS_PWD33                    ((u32)0x00000001 << 6)                              /*!<R/W 1  1: power down GPIOS */
#define AON_SHIFT_PON_GPIOF_PWD33                    5
#define AON_BIT_PON_GPIOF_PWD33                      ((u32)0x00000001 << 5)                              /*!<R/W 1  1: power down GPIOF */
#define AON_SHIFT_SYSON_GPIOE_PWD33                  4
#define AON_BIT_SYSON_GPIOE_PWD33                    ((u32)0x00000001 << 4)                              /*!<R/W 1  1: power down GPIOE */
#define AON_SHIFT_SYSON_GPIOD_PWD33                  3
#define AON_BIT_SYSON_GPIOD_PWD33                    ((u32)0x00000001 << 3)                              /*!<R/W 1  1: power down GPIOD */
#define AON_SHIFT_SYSON_GPIOC_PWD33                  2
#define AON_BIT_SYSON_GPIOC_PWD33                    ((u32)0x00000001 << 2)                              /*!<R/W 1  1: power down GPIOC */
#define AON_SHIFT_SYSON_GPIOB_PWD33                  1
#define AON_BIT_SYSON_GPIOB_PWD33                    ((u32)0x00000001 << 1)                              /*!<R/W 1  1: power down GPIOB */
#define AON_SHIFT_AON_GPIOA_PWD33                    0
#define AON_BIT_AON_GPIOA_PWD33                      ((u32)0x00000001 << 0)                              /*!<R/W 0  1: power down GPIOA */
/** @} */

/**************************************************************************//**
 * @defgroup AON_REG_AON_GPIOA_0_1_CTRL
 * @brief                                            (@ 0X094)
 * @{
 *****************************************************************************/
#define AON_SHIFT_AON_GPIO1_SLEW_RATE                28
#define AON_BIT_AON_GPIO1_SLEW_RATE                  ((u32)0x00000001 << 28)                             /*!<R/W 0  0:Disable,1:Enable */
#define AON_SHIFT_AON_GPIO1_DRIVING                  26
#define AON_MASK_AON_GPIO1_DRIVING                   ((u32)0x00000003 << 26)                             /*!<R/W 0  0:4mA, 1:8mA */
#define AON_SHIFT_AON_GPIO1_SMT_EN                   25
#define AON_BIT_AON_GPIO1_SMT_EN                     ((u32)0x00000001 << 25)                             /*!<R/W 0  Enable AON GPIO1 Schmitt trigger; 1: enable */
#define AON_SHIFT_AON_GPIO1_PULL_CTRL                22
#define AON_MASK_AON_GPIO1_PULL_CTRL                 ((u32)0x00000003 << 22)                             /*!<R/W 0  2b'00: high impedence; 2b'01: pull low; 2b'10: pull high; 2b'11: reserved */
#define AON_SHIFT_AON_GPIO1_PINMUX_SEL               16
#define AON_MASK_AON_GPIO1_PINMUX_SEL                ((u32)0x0000000F << 16)                             /*!<R/W 1111  0000: Comparator_ADC 0001: I2C0_SDA 0010: 0011:JTAG_CLK/SWD_CK 0100: 0101: 0110: 0111: 1000: 1001: 1010: 1011: 1100: 1101: 1110: 1111: GPIO */
#define AON_SHIFT_AON_GPIO0_SLEW_RATE                12
#define AON_BIT_AON_GPIO0_SLEW_RATE                  ((u32)0x00000001 << 12)                             /*!<R/W 0  0:Disable,1:Enable */
#define AON_SHIFT_AON_GPIO0_DRIVING                  10
#define AON_MASK_AON_GPIO0_DRIVING                   ((u32)0x00000003 << 10)                             /*!<R/W 0  0:4mA, 1:8mA */
#define AON_SHIFT_AON_GPIO0_SMT_EN                   9
#define AON_BIT_AON_GPIO0_SMT_EN                     ((u32)0x00000001 << 9)                              /*!<R/W 0  Enable AON GPIO0 Schmitt trigger; 1: enable */
#define AON_SHIFT_AON_GPIO0_PULL_CTRL                6
#define AON_MASK_AON_GPIO0_PULL_CTRL                 ((u32)0x00000003 << 6)                              /*!<R/W 0  2b'00: high impedence; 2b'01: pull low; 2b'10: pull high; 2b'11: reserved */
#define AON_SHIFT_AON_GPIO0_PINMUX_SEL               0
#define AON_MASK_AON_GPIO0_PINMUX_SEL                ((u32)0x0000000F << 0)                              /*!<R/W 1111  0000: Comparator_ADC 0001: I2C0_SCL 0010: 0011: JTAG_TMS/SWD_IO 0100: 0101: 0110: 0111: 1000: 1001: 1010: 1011: 1100: 1101: 1110: 1111: GPIO */
/** @} */

