Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/lib/include/rtl8735b_aon_type.h
/**************************************************************************//**
 * @defgroup AON_REG_AON_GPIOA_2_3_CTRL
 * @brief                                            (@ 0X098)
 * @{
 *****************************************************************************/
#define AON_SHIFT_AON_GPIO3_SLEW_RATE                28
#define AON_BIT_AON_GPIO3_SLEW_RATE                  ((u32)0x00000001 << 28)                             /*!<R/W 0  0:Disable,1:Enable */
#define AON_SHIFT_AON_GPIO3_DRIVING                  26
#define AON_MASK_AON_GPIO3_DRIVING                   ((u32)0x00000003 << 26)                             /*!<R/W 0  0:4mA, 1:8mA */
#define AON_SHIFT_AON_GPIO3_SMT_EN                   25
#define AON_BIT_AON_GPIO3_SMT_EN                     ((u32)0x00000001 << 25)                             /*!<R/W 0  Enable AON GPIO3 Schmitt trigger; 1: enable */
#define AON_SHIFT_AON_GPIO3_PULL_CTRL                22
#define AON_MASK_AON_GPIO3_PULL_CTRL                 ((u32)0x00000003 << 22)                             /*!<R/W 0  2b'00: high impedence; 2b'01: pull low; 2b'10: pull high; 2b'11: reserved */
#define AON_SHIFT_AON_GPIO3_PINMUX_SEL               16
#define AON_MASK_AON_GPIO3_PINMUX_SEL                ((u32)0x0000000F << 16)                             /*!<R/W 1111  0000:Comparator_ADC 0001: SIC_SDA 0010: 0011: 0100: 0101: 0110: UART0_IN 0111: 1000: 1001: 1010: 1011: 1100: 1101: 1110: 1111: GPIO */
#define AON_SHIFT_AON_GPIO2_SLEW_RATE                12
#define AON_BIT_AON_GPIO2_SLEW_RATE                  ((u32)0x00000001 << 12)                             /*!<R/W 0  0:Disable,1:Enable */
#define AON_SHIFT_AON_GPIO2_DRIVING                  10
#define AON_MASK_AON_GPIO2_DRIVING                   ((u32)0x00000003 << 10)                             /*!<R/W 0  0:4mA, 1:8mA */
#define AON_SHIFT_AON_GPIO2_SMT_EN                   9
#define AON_BIT_AON_GPIO2_SMT_EN                     ((u32)0x00000001 << 9)                              /*!<R/W 0  Enable AON GPIO2 Schmitt trigger; 1: enable */
#define AON_SHIFT_AON_GPIO2_PULL_CTRL                6
#define AON_MASK_AON_GPIO2_PULL_CTRL                 ((u32)0x00000003 << 6)                              /*!<R/W 0  2b'00: high impedence; 2b'01: pull low; 2b'10: pull high; 2b'11: reserved */
#define AON_SHIFT_AON_GPIO2_PINMUX_SEL               0
#define AON_MASK_AON_GPIO2_PINMUX_SEL                ((u32)0x0000000F << 0)                              /*!<R/W 1111  0000: Comparator_ADC 0001: SIC_SCL 0010: 0011: 0100: 0101: 0110: UART0_OUT 0111: 1000: 1001: 1010: 1011: 1100: 1101: 1110: 1111: GPIO */
/** @} */

/**************************************************************************//**
 * @defgroup AON_REG_AON_GPIOA_4_5_CTRL
 * @brief                                            (@ 0X09C)
 * @{
 *****************************************************************************/
#define AON_SHIFT_AON_GPIO5_SLEW_RATE                28
#define AON_BIT_AON_GPIO5_SLEW_RATE                  ((u32)0x00000001 << 28)                             /*!<R/W 0  0:Disable,1:Enable */
#define AON_SHIFT_AON_GPIO5_DRIVING                  26
#define AON_MASK_AON_GPIO5_DRIVING                   ((u32)0x00000003 << 26)                             /*!<R/W 0  0:4mA, 1:8mA */
#define AON_SHIFT_AON_GPIO5_SMT_EN                   25
#define AON_BIT_AON_GPIO5_SMT_EN                     ((u32)0x00000001 << 25)                             /*!<R/W 0  Enable AON GPIO5 Schmitt trigger; 1: enable */
#define AON_SHIFT_AON_GPIO5_PULL_CTRL                22
#define AON_MASK_AON_GPIO5_PULL_CTRL                 ((u32)0x00000003 << 22)                             /*!<R/W 1  2b'00: high impedence; 2b'01: pull low; 2b'10: pull high; 2b'11: reserved */
#define AON_SHIFT_AON_GPIO5_PINMUX_SEL               16
#define AON_MASK_AON_GPIO5_PINMUX_SEL                ((u32)0x0000000F << 16)                             /*!<R/W 1111  0000:VP_LOW 0001: 0010: 0011: 0100: 0101: 0110: 0111: 1000: 1001: 1010: 1011: 1100: 1101: 1110: 1111: GPIO */
#define AON_SHIFT_AON_GPIO4_SLEW_RATE                12
#define AON_BIT_AON_GPIO4_SLEW_RATE                  ((u32)0x00000001 << 12)                             /*!<R/W 0  0:Disable,1:Enable */
#define AON_SHIFT_AON_GPIO4_DRIVING                  10
#define AON_MASK_AON_GPIO4_DRIVING                   ((u32)0x00000003 << 10)                             /*!<R/W 0  0:4mA, 1:8mA */
#define AON_SHIFT_AON_GPIO4_SMT_EN                   9
#define AON_BIT_AON_GPIO4_SMT_EN                     ((u32)0x00000001 << 9)                              /*!<R/W 0  Enable AON GPIO4 Schmitt trigger; 1: enable */
#define AON_SHIFT_AON_GPIO4_PULL_CTRL                6
#define AON_MASK_AON_GPIO4_PULL_CTRL                 ((u32)0x00000003 << 6)                              /*!<R/W 1  2b'00: high impedence; 2b'01: pull low; 2b'10: pull high; 2b'11: reserved */
#define AON_SHIFT_AON_GPIO4_PINMUX_SEL               0
#define AON_MASK_AON_GPIO4_PINMUX_SEL                ((u32)0x0000000F << 0)                              /*!<R/W 1111  0000:VP_HIGH 0001: 0010: 0011: 0100: 0101: 0110: 0111: 1000: 1001: 1010: 1011: 1100: 1101: 1110: 1111: GPIO */
/** @} */

/**************************************************************************//**
 * @defgroup AON_REG_AON_IO1_RSVD
 * @brief                                            (@ 0X0A0)
 * @{
 *****************************************************************************/
#define AON_SHIFT_SW0                                0
#define AON_MASK_SW0                                 ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0  Reserve for SW DBG */
/** @} */

/**************************************************************************//**
 * @defgroup AON_REG_AON_IO2_RSVD
 * @brief                                            (@ 0X0A4)
 * @{
 *****************************************************************************/
#define AON_SHIFT_SW1                                0
#define AON_MASK_SW1                                 ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0  Reserve for SW DBG */
/** @} */

/**************************************************************************//**
 * @defgroup AON_REG_AON_LSFIF_CMD
 * @brief                                            (@ 0X0A8)
 * @{
 *****************************************************************************/
#define AON_SHIFT_AON_LSFIF_POLL                     31
#define AON_BIT_AON_LSFIF_POLL                       ((u32)0x00000001 << 31)                             /*!<R/W 0  LSF (low speed function) register access polling bit. Set this bit to do LSF register read or write transfer depend on BIT_AON_LSFIF_WR. When transfer done, this bit will be clear by HW */
#define AON_SHIFT_LSF_SEL                            28
#define AON_MASK_LSF_SEL                             ((u32)0x00000007 << 28)                             /*!<R/W 0  000: RTC 001: OSC32K SDM 010: XTAL (high speed) with divider 011: AON Comparator 100: RSVD */
#define AON_SHIFT_AON_LSFIF_WR                       27
#define AON_BIT_AON_LSFIF_WR                         ((u32)0x00000001 << 27)                             /*!<R/W 0  LSF register write transfer indicator.1: LSF register write transfer, 0: LSF register read transfer */
#define AON_SHIFT_AON_LSFIF_WE                       23
#define AON_MASK_AON_LSFIF_WE                        ((u32)0x0000000F << 23)                             /*!<R/W 0  LSF register byte write enable. This field is valid during LSF register write transfer, and is ignored during LSF register read transfer */
#define AON_SHIFT_LSFIF_CMD_DUMMY_0                  16
#define AON_MASK_LSFIF_CMD_DUMMY_0                   ((u32)0x0000007F << 16)                             /*!<R/W 0  Dummy */
#define AON_SHIFT_AON_LSFIF_AD                       0
#define AON_MASK_AON_LSFIF_AD                        ((u32)0x0000FFFF << 0)                              /*!<R/W 0  LSF register access address. BIT_AON_LSFIF_AD[15:8]=8'h00: Indirect register base address */
/** @} */

/**************************************************************************//**
 * @defgroup AON_REG_AON_LSFIF_RWD
 * @brief                                            (@ 0X0AC)
 * @{
 *****************************************************************************/
#define AON_SHIFT_AON_LSFIF_RWD                      0
#define AON_MASK_AON_LSFIF_RWD                       ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0  LSF(low speed function) write */
/** @} */

/**************************************************************************//**
 * @defgroup AON_REG_AON_TEST_MUX_CTRL
 * @brief                                            (@ 0X0B0)
 * @{
 *****************************************************************************/
#if IS_CUT_TEST(CONFIG_CHIP_VER)
#define AON_SHIFT_TEST3                              25
#define AON_MASK_TEST3                               ((u32)0x0000007F << 25)                             /*!<R/W 0  RSVD */
#define AON_SHIFT_SDIO_HOST_TEST_MUX_EN              24
#define AON_BIT_SDIO_HOST_TEST_MUX_EN                ((u32)0x00000001 << 24)                             /*!<R/W 0  1: enable SDIO HOST test mux */
#define AON_SHIFT_SD_HOST_TEST_MUX_EN                23
#define AON_BIT_SD_HOST_TEST_MUX_EN                  ((u32)0x00000001 << 23)                             /*!<R/W 0  1: enable SD HOST test mux */
#define AON_SHIFT_ETHERNET_TEST_MUX_EN               22
#define AON_BIT_ETHERNET_TEST_MUX_EN                 ((u32)0x00000001 << 22)                             /*!<R/W 0  1: enable Ethernet PHY test mux */
#define AON_SHIFT_AUDIO_TEST_MUX_EN                  21
#define AON_BIT_AUDIO_TEST_MUX_EN                    ((u32)0x00000001 << 21)                             /*!<R/W 0  1: enable AUDIO CODEC test mux */
#define AON_SHIFT_PLL_TEST_MUX_EN                    20
#define AON_BIT_PLL_TEST_MUX_EN                      ((u32)0x00000001 << 20)                             /*!<R/W 0  1: enable PLL test mux */
#define AON_SHIFT_AUX_TEST_MUX_EN                    19
#define AON_BIT_AUX_TEST_MUX_EN                      ((u32)0x00000001 << 19)                             /*!<R/W 0  1: enable AUX test mux */
#define AON_SHIFT_RSVD                               18
#define AON_BIT_RSVD                                 ((u32)0x00000001 << 18)                             /*!<R/W 0  RSVD */
#define AON_SHIFT_WL_BT_RF_TEST_MUX_EN               17
#define AON_BIT_WL_BT_RF_TEST_MUX_EN                 ((u32)0x00000001 << 17)                             /*!<R/W 0  1: enable WLAN BT RF test mux */
#define AON_SHIFT_REGU_TEST_MUX_EN                   16
#define AON_BIT_REGU_TEST_MUX_EN                     ((u32)0x00000001 << 16)                             /*!<R/W 0  1: enable REGU test mux */
#define AON_SHIFT_TEST2                              9
#define AON_MASK_TEST2                               ((u32)0x0000007F << 9)                              /*!<R/W 0  RSVD */
#define AON_SHIFT_MBIST_EN                           8
#define AON_BIT_MBIST_EN                             ((u32)0x00000001 << 8)                              /*!<R/W 0  1: enable MBIST test mux */
#define AON_SHIFT_TEST1                              3
#define AON_MASK_TEST1                               ((u32)0x0000001F << 3)                              /*!<R/W 0  RSVD */
#define AON_SHIFT_SCAN_MOD2_EN                       2
#define AON_BIT_SCAN_MOD2_EN                         ((u32)0x00000001 << 2)                              /*!<R/W 0  1: enable FT2 scan test mux */
#define AON_SHIFT_SCAN_MOD1_EN                       1
#define AON_BIT_SCAN_MOD1_EN                         ((u32)0x00000001 << 1)                              /*!<R/W 0  1: enable FT1 scan test mux */
#define AON_SHIFT_SCAN_MOD0_EN                       0
#define AON_BIT_SCAN_MOD0_EN                         ((u32)0x00000001 << 0)                              /*!<R/W 0  1: enable CP scan test mux */
#else
#define AON_SHIFT_TEST_MOD31_EN                      31
#define AON_BIT_TEST_MOD31_EN                        ((u32)0x00000001 << 31)                             /*!<R/W 0  1: enable test mode 31 mux */
#define AON_SHIFT_TEST_MOD30_EN                      30
#define AON_BIT_TEST_MOD30_EN                        ((u32)0x00000001 << 30)                             /*!<R/W 0  1: enable test mode 30 mux */
#define AON_SHIFT_TEST_MOD29_EN                      29
#define AON_BIT_TEST_MOD29_EN                        ((u32)0x00000001 << 29)                             /*!<R/W 0  1: enable test mode 29 mux */
#define AON_SHIFT_TEST_MOD28_EN                      28
#define AON_BIT_TEST_MOD28_EN                        ((u32)0x00000001 << 28)                             /*!<R/W 0  1: enable test mode 28 mux */
#define AON_SHIFT_TEST_MOD27_EN                      27
#define AON_BIT_TEST_MOD27_EN                        ((u32)0x00000001 << 27)                             /*!<R/W 0  1: enable test mode 27 mux */
#define AON_SHIFT_TEST_MOD26_EN                      26
#define AON_BIT_TEST_MOD26_EN                        ((u32)0x00000001 << 26)                             /*!<R/W 0  1: enable test mode 26 mux */
#define AON_SHIFT_TEST_MOD25_EN                      25
#define AON_BIT_TEST_MOD25_EN                        ((u32)0x00000001 << 25)                             /*!<R/W 0  1: enable test mode 25 mux */
#define AON_SHIFT_SDIO_HOST_TEST_MUX_EN              24
#define AON_BIT_SDIO_HOST_TEST_MUX_EN                ((u32)0x00000001 << 24)                             /*!<R/W 0  1: enable SDIO HOST test mux */
#define AON_SHIFT_SD_HOST_TEST_MUX_EN                23
#define AON_BIT_SD_HOST_TEST_MUX_EN                  ((u32)0x00000001 << 23)                             /*!<R/W 0  1: enable SD HOST test mux */
#define AON_SHIFT_ETHERNET_TEST_MUX_EN               22
#define AON_BIT_ETHERNET_TEST_MUX_EN                 ((u32)0x00000001 << 22)                             /*!<R/W 0  1: enable Ethernet PHY test mux */
#define AON_SHIFT_AUDIO_TEST_MUX_EN                  21
#define AON_BIT_AUDIO_TEST_MUX_EN                    ((u32)0x00000001 << 21)                             /*!<R/W 0  1: enable AUDIO CODEC test mux */
#define AON_SHIFT_PLL_TEST_MUX_EN                    20
#define AON_BIT_PLL_TEST_MUX_EN                      ((u32)0x00000001 << 20)                             /*!<R/W 0  1: enable PLL test mux */
#define AON_SHIFT_AUX_TEST_MUX_EN                    19
#define AON_BIT_AUX_TEST_MUX_EN                      ((u32)0x00000001 << 19)                             /*!<R/W 0  1: enable AUX test mux */
#define AON_SHIFT_RSVD                               18
#define AON_BIT_RSVD                                 ((u32)0x00000001 << 18)                             /*!<R/W 0  RSVD */
#define AON_SHIFT_WL_BT_RF_TEST_MUX_EN               17
#define AON_BIT_WL_BT_RF_TEST_MUX_EN                 ((u32)0x00000001 << 17)                             /*!<R/W 0  1: enable WLAN BT RF test mux */
#define AON_SHIFT_REGU_TEST_MUX_EN                   16
#define AON_BIT_REGU_TEST_MUX_EN                     ((u32)0x00000001 << 16)                             /*!<R/W 0  1: enable REGU test mux */
#define AON_SHIFT_TEST_MOD15_EN                      15
#define AON_BIT_TEST_MOD15_EN                        ((u32)0x00000001 << 15)                             /*!<R/W 0  1: enable test mode 15 mux */
#define AON_SHIFT_TEST_MOD14_EN                      14
#define AON_BIT_TEST_MOD14_EN                        ((u32)0x00000001 << 14)                             /*!<R/W 0  1: enable test mode 14 mux */
#define AON_SHIFT_TEST_MOD13_EN                      13
#define AON_BIT_TEST_MOD13_EN                        ((u32)0x00000001 << 13)                             /*!<R/W 0  1: enable test mode 13 mux */
#define AON_SHIFT_TEST_MOD12_EN                      12
#define AON_BIT_TEST_MOD12_EN                        ((u32)0x00000001 << 12)                             /*!<R/W 0  1: enable test mode 12 mux */
#define AON_SHIFT_TEST_MOD11_EN                      11
#define AON_BIT_TEST_MOD11_EN                        ((u32)0x00000001 << 11)                             /*!<R/W 0  1: enable test mode 11 mux */
#define AON_SHIFT_TEST_MOD10_EN                      10
#define AON_BIT_TEST_MOD10_EN                        ((u32)0x00000001 << 10)                             /*!<R/W 0  1: enable test mode 10 mux */
#define AON_SHIFT_TEST_MOD9_EN                       9
#define AON_BIT_TEST_MOD9_EN                         ((u32)0x00000001 << 9)                              /*!<R/W 0  1: enable test mode 9 mux */
#define AON_SHIFT_TEST_MOD8_EN                       8
#define AON_BIT_TEST_MOD8_EN                         ((u32)0x00000001 << 8)                              /*!<R/W 0  1: enable test mode 8 mux */
#define AON_SHIFT_TEST_MOD7_EN                       7
#define AON_BIT_TEST_MOD7_EN                         ((u32)0x00000001 << 7)                              /*!<R/W 0  1: enable test mode 7 mux */
#define AON_SHIFT_TEST_MOD6_EN                       6
#define AON_BIT_TEST_MOD6_EN                         ((u32)0x00000001 << 6)                              /*!<R/W 0  1: enable test mode 6 mux */
#define AON_SHIFT_SCAN_MOD5_EN                       5
#define AON_BIT_SCAN_MOD5_EN                         ((u32)0x00000001 << 5)                              /*!<R/W 0  1: enable FT3 scan test mux */
#define AON_SHIFT_SCAN_MOD4_EN                       4
#define AON_BIT_SCAN_MOD4_EN                         ((u32)0x00000001 << 4)                              /*!<R/W 0  1: enable FT2 scan test mux */
#define AON_SHIFT_SCAN_MOD3_EN                       3
#define AON_BIT_SCAN_MOD3_EN                         ((u32)0x00000001 << 3)                              /*!<R/W 0  1: enable FT1 scan test mux */
#define AON_SHIFT_SCAN_MOD2_EN                       2
#define AON_BIT_SCAN_MOD2_EN                         ((u32)0x00000001 << 2)                              /*!<R/W 0  1: enable FT0 scan test mux */
#define AON_SHIFT_SCAN_MOD1_EN                       1
#define AON_BIT_SCAN_MOD1_EN                         ((u32)0x00000001 << 1)                              /*!<R/W 0  1: enable CP1 scan test mux */
#define AON_SHIFT_SCAN_MOD0_EN                       0
#define AON_BIT_SCAN_MOD0_EN                         ((u32)0x00000001 << 0)                              /*!<R/W 0  1: enable CP0 scan test mux */
#endif
/** @} */

/**************************************************************************//**
 * @defgroup AON_REG_AON_WDT_TIMER
 * @brief                                            (@ 0X0B4)
 * @{
 *****************************************************************************/
#define AON_SHIFT_RSVD1                              17
#define AON_MASK_RSVD1                               ((u32)0x00007FFF << 17)                             /*!<R 0   */
#define AON_SHIFT_CNT                                1
#define AON_MASK_CNT                                 ((u32)0x0000FFFF << 1)                              /*!<R/W 0xFFF  WDT Counter value */
#define AON_SHIFT_WDT_EN_BYTE                        0
#define AON_BIT_WDT_EN_BYTE                          ((u32)0x00000001 << 0)                              /*!<R/W 1  Set 1 to enable watch dog timer */
/** @} */

/**************************************************************************//**
 * @defgroup AON_REG_AON_TEST_MUX_CTRL1
 * @brief                                            (@ 0X0B8)
 * @{
 *****************************************************************************/
#define AON_SHIFT_TEST                               0
#define AON_MASK_TEST                                ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0  RSVD */
/** @} */

