Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/lib/include/rtl8735b_aon_type.h
/**************************************************************************//**
 * @defgroup AON_REG_AON_ATLOAD_CTRL1
 * @brief                                            (@ 0X0BC)
 * @{
 *****************************************************************************/
#define AON_SHIFT_OTP1                               16
#define AON_MASK_OTP1                                ((u32)0x0000FFFF << 16)                             /*!<R/W 0  For OTP Use */
#define AON_SHIFT_OTP0                               13
#define AON_MASK_OTP0                                ((u32)0x00000007 << 13)                             /*!<R/W 0  For OTP Use */
#define AON_SHIFT_AON_OTP_IND_ACCESS_EN              12
#define AON_BIT_AON_OTP_IND_ACCESS_EN                ((u32)0x00000001 << 12)                             /*!<R/W Once 1  This bit is the control bit for AON OTP indirect access 1: Enable that master(CPU/SIC) can access OTP via AON OTP indirect access. (Default) 0: Disable that master(CPU/SIC) cannot access OTP via AON OTP indirect access. This register just can be written once. After that, hardware need disable the writing function. */
#define AON_SHIFT_JTAG_OTP_KEY_SELECT                10
#define AON_MASK_JTAG_OTP_KEY_SELECT                 ((u32)0x00000003 << 10)                             /*!<R/W Once 11  Secure JTAG OTP Key select. The first bit (Bit 10) determines which Secure Key pair is used. 1: Secure Key 1 (Default) 0: Secure Key 2 The last bit (Bit 11) determines which Non-Secure Key pair is used. 1: Non-Secure Key 1 (Default) 0: Non-Secure Key 2 This register just can be written once. After that, hardware need disable the writing function. */
#define AON_SHIFT_NS_JTAG_SWD_MODE                   8
#define AON_MASK_NS_JTAG_SWD_MODE                    ((u32)0x00000003 << 8)                              /*!<R/W Once 11  3(Default): Enable non-secure world JTAG/SWD 2: RSVD 1: Enable password non-secure world JTAG/SWD 0: disable non-secure world JTAG/SWD This register just can be written once. After that, hardware need disable the writing function. */
#define AON_SHIFT_S_JTAG_SWD_MODE                    6
#define AON_MASK_S_JTAG_SWD_MODE                     ((u32)0x00000003 << 6)                              /*!<R/W Once 11  3(Default): Enable secure world JTAG/SWD 2: RSVD 1: Enable password secure world JTAG/SWD 0: disable secure world JTAG/SWD This register just can be written once. After that, hardware need disable the writing function. */
#define AON_SHIFT_FIXED_JTAG_KEY_EN                  5
#define AON_BIT_FIXED_JTAG_KEY_EN                    ((u32)0x00000001 << 5)                              /*!<R/W Once 1  0: "DAP Protection IP" cannot request "OTP Key Control" to read the OTP key. The key will be stored into register. The length of key: 256 bits. 1: "DAP Protection IP" can request "OTP Key Control" to read the OTP key. The length of key: 256 bits. (Default) This register just can be written once. After that, hardware need disable the writing function. */
#define AON_SHIFT_SIC_SECURE_DIS                     4
#define AON_BIT_SIC_SECURE_DIS                       ((u32)0x00000001 << 4)                              /*!<R/W Once 1  Secure registers can be accessed or not via SIC. 0: Disable that SIC is secure mode. It means that SIC is Non-secure master. 1: Enable that SIC is secure mode. (Default) It means that SIC is Secure master. This register just can be written once. After that, hardware need disable the writing function. */
#define AON_SHIFT_SEC_PON_DIS                        3
#define AON_BIT_SEC_PON_DIS                          ((u32)0x00000001 << 3)                              /*!<R/W Once 1  This bit is the control bit of secure filter check for PON registers. 1: PON is Non-secure register. (Default) It means that disable secure filter check , so allow Non-secure and Secure masters can access PON registers. 0: PON is Secure register. It means that enable secure filter check, so allow only Secure masters can access PON registers. Non-secure masters access will be filtered out. This register just can be written once. After that, hardware need disable the writing function. */
#define AON_SHIFT_SEC_AON_DIS                        2
#define AON_BIT_SEC_AON_DIS                          ((u32)0x00000001 << 2)                              /*!<R/W Once 1  This bit is the control bit of secure filter check for AON registers. 1: AON is Non-secure register. (Default) It means that disable secure filter check , so allow Non-secure and Secure masters can access AON registers. 0: AON is Secure register. It means that enable secure filter check, so allow only Secure masters can access AON registers. Non-secure masters access will be filtered out. This register just can be written once. After that, hardware need disable the writing function. */
#define AON_SHIFT_SECURE_VNDR_CHECK_DIS              1
#define AON_BIT_SECURE_VNDR_CHECK_DIS                ((u32)0x00000001 << 1)                              /*!<R/W Once 1  This bit is the control bit of secure filter check for Vendor secure registers. 1: Disable secure filter check (Default), it means that allow Non-secure masters can access secure Vendor registers, Secure masters as well. 0: Enable secure filter check, it means that allow only Secure masters can access secure Vendor registers. Non-secure masters access will be filtered out. This register just can be written once. After that, hardware need disable the writing function. */
#define AON_SHIFT_SECURE_SYSON_CHECK_DIS             0
#define AON_BIT_SECURE_SYSON_CHECK_DIS               ((u32)0x00000001 << 0)                              /*!<R/W Once 1  This bit is the control bit of secure filter check for SYSON secure registers. 1: Disable secure filter check (Default), it means that allow Non-secure masters can access secure SYSON registers, Secure masters as well. 0: Enable secure filter check, it means that allow only Secure masters can access secure SYSON registers. Non-secure masters access will be filtered out. This register just can be written once. After that, hardware need disable the writing function. */
/** @} */

/**************************************************************************//**
 * @defgroup AON_REG_AON_ATLOAD_CTRL2
 * @brief                                            (@ 0X0C0)
 * @{
 *****************************************************************************/
#define AON_SHIFT_OTP2                               16
#define AON_MASK_OTP2                                ((u32)0x0000FFFF << 16)                             /*!<R/W 0  For OTP Use */
#define AON_SHIFT_EFUSE_ID1                          8
#define AON_MASK_EFUSE_ID1                           ((u32)0x000000FF << 8)                              /*!<R/W 0  Efuse ID byte1, expect ID: 0x87 */
#define AON_SHIFT_EFUSE_ID0                          0
#define AON_MASK_EFUSE_ID0                           ((u32)0x000000FF << 0)                              /*!<R/W 0  Efuse ID byte0, expect ID: 0x35 */
/** @} */

/**************************************************************************//**
 * @defgroup AON_REG_AON_SYS_INFO0
 * @brief                                            (@ 0X0C4)
 * @{
 *****************************************************************************/
#define AON_SHIFT_SYSCFG_BD_PKG_SEL                  31
#define AON_BIT_SYSCFG_BD_PKG_SEL                    ((u32)0x00000001 << 31)                             /*!<R 0  Trapped PKG_ENG_SEL value 0: normal package; 1: engineering mode */
#define AON_SHIFT_CHIP_EN                            30
#define AON_BIT_CHIP_EN                              ((u32)0x00000001 << 30)                             /*!<R 1  CHIP_EN PIN input value */
#define AON_SHIFT_BD_OPT3_                           27
#define AON_BIT_BD_OPT3_                             ((u32)0x00000001 << 27)                             /*!<R 0  Report from bonding option pin */
#define AON_SHIFT_BD_OPT2_                           26
#define AON_BIT_BD_OPT2_                             ((u32)0x00000001 << 26)                             /*!<R 0   */
#define AON_SHIFT_BD_OPT1_                           25
#define AON_BIT_BD_OPT1_                             ((u32)0x00000001 << 25)                             /*!<R 0   */
#define AON_SHIFT_BD_OPT0                            24
#define AON_BIT_BD_OPT0                              ((u32)0x00000001 << 24)                             /*!<R 0   */
#define AON_SHIFT_RSVD2                              17
#define AON_MASK_RSVD2                               ((u32)0x0000007F << 17)                             /*!<R 0   */
#define AON_SHIFT_CHIP_TYPE                          16
#define AON_BIT_CHIP_TYPE                            ((u32)0x00000001 << 16)                             /*!<R 0  1: Test chip; 0:MP */
#define AON_SHIFT_VENDOR_ID                          8
#define AON_MASK_VENDOR_ID                           ((u32)0x0000000F << 8)                              /*!<R 0101  BIT_VENDOR_ID[3:2] : Process 00: TSMC , 01: SMIC, 10: UMC BIT_VENDOR_ID[1] : rsve BIT_VENDOR_ID[0] : 0 : BT do not exist in IC 1 : BT exist in IC */
#define AON_SHIFT_CHIP_VER                           4
#define AON_MASK_CHIP_VER                            ((u32)0x0000000F << 4)                              /*!<R 0  Chip version-8735B 0000: A-cut 0001: B-cut 0010: C-cut 0011: D-cut  */
#define AON_SHIFT_RF_RL_ID                           0
#define AON_MASK_RF_RL_ID                            ((u32)0x0000000F << 0)                              /*!<R 0  Vendor ID defined in RF */
/** @} */

/**************************************************************************//**
 * @defgroup AON_REG_AON_SYS_INFO1
 * @brief                                            (@ 0X0C8)
 * @{
 *****************************************************************************/
#define AON_SHIFT_RSVD3                              28
#define AON_MASK_RSVD3                               ((u32)0x0000000F << 28)                             /*!<R 0   */
#define AON_SHIFT_SYSCFG_TRP_SRCLDO_SEL              27
#define AON_BIT_SYSCFG_TRP_SRCLDO_SEL                ((u32)0x00000001 << 27)                             /*!<R 0  Trapped Selection for SRC 0: SWR mode; 1: LDO mode */
#define AON_SHIFT_SYSCFG_TRP_TEST_MODE_SEL           26
#define AON_BIT_SYSCFG_TRP_TEST_MODE_SEL             ((u32)0x00000001 << 26)                             /*!<R 0  Trapped Selection for Test mode 0: normal mode; 1: test mode  */
#define AON_SHIFT_RSVD4                              25
#define AON_BIT_RSVD4                                ((u32)0x00000001 << 25)                             /*!<R 0   */
#define AON_SHIFT_SYSCFG_TRP_EFUSE_AUTOLOAD_DIS      24
#define AON_BIT_SYSCFG_TRP_EFUSE_AUTOLOAD_DIS        ((u32)0x00000001 << 24)                             /*!<R 0  1: disable efuse autoload 0: enable efuse autoload */
#define AON_SHIFT_RSVD5                              22
#define AON_MASK_RSVD5                               ((u32)0x00000003 << 22)                             /*!<R 0   */
#define AON_SHIFT_SYS_INFO1_DUMMY_0                  21
#define AON_BIT_SYS_INFO1_DUMMY_0                    ((u32)0x00000001 << 21)                             /*!<R 0   */
#define AON_SHIFT_RSVD6                              20
#define AON_BIT_RSVD6                                ((u32)0x00000001 << 20)                             /*!<R 0   */
#define AON_SHIFT_SYS_INFO1_DUMMY_1                  17
#define AON_MASK_SYS_INFO1_DUMMY_1                   ((u32)0x00000007 << 17)                             /*!<R 0   */
#define AON_SHIFT_V09_VLD                            16
#define AON_BIT_V09_VLD                              ((u32)0x00000001 << 16)                             /*!<R 1  0.9V Power Ready, 1: Power Ready */
#define AON_SHIFT_SYS_INFO1_DUMMY_2                  12
#define AON_MASK_SYS_INFO1_DUMMY_2                   ((u32)0x0000000F << 12)                             /*!<R 0   */
#define AON_SHIFT_RSVD7                              11
#define AON_BIT_RSVD7                                ((u32)0x00000001 << 11)                             /*!<R 0   */
#define AON_SHIFT_SYS_128K_RDY                       10
#define AON_BIT_SYS_128K_RDY                         ((u32)0x00000001 << 10)                             /*!<R 0  1: 128K RDY */
#define AON_SHIFT_SYS_SYSPLL_CLK_RDY                 9
#define AON_BIT_SYS_SYSPLL_CLK_RDY                   ((u32)0x00000001 << 9)                              /*!<R 0  SYS PLL Clock Stable, 1: Clock Stable */
#define AON_SHIFT_SYS_XCLK_VLD                       8
#define AON_BIT_SYS_XCLK_VLD                         ((u32)0x00000001 << 8)                              /*!<R 0  Xtal Clock Stable, 1: Clock Stable */
#define AON_SHIFT_SYSCFG_ROM_INFO                    0
#define AON_MASK_SYSCFG_ROM_INFO                     ((u32)0x000000FF << 0)                              /*!<R/W 0  ROM Information */
/** @} */

/**************************************************************************//**
 * @defgroup AON_REG_AON_OTP_SYSCFG2
 * @brief                                            (@ 0X0CC)
 * @{
 *****************************************************************************/
#define AON_SHIFT_DBG_PORT1_SEL                      28
#define AON_MASK_DBG_PORT1_SEL                       ((u32)0x0000000F << 28)                             /*!<R/W 0  Debug port group 1 data sel 0000 : debug data 3:0 0001 : debug data 7:4 0010 : debug data 11:8 0011 : debug data 15:12 0100 : debug data 19:16 0101 : debug data 23:20 0110 : debug data 27:24 0111 : debug data 31:28 */
#define AON_SHIFT_DBG_PORT0_SEL                      24
#define AON_MASK_DBG_PORT0_SEL                       ((u32)0x0000000F << 24)                             /*!<R/W 0  Debug port group 0 data sel 0000 : debug data 3:0 0001 : debug data 7:4 0010 : debug data 11:8 0011 : debug data 15:12 0100 : debug data 19:16 0101 : debug data 23:20 0110 : debug data 27:24 0111 : debug data 31:28 */
#define AON_SHIFT_DBG_PORT7_EN                       23
#define AON_BIT_DBG_PORT7_EN                         ((u32)0x00000001 << 23)                             /*!<R/W 0  1:Debug port group 7 enable */
#define AON_SHIFT_DBG_PORT6_EN                       22
#define AON_BIT_DBG_PORT6_EN                         ((u32)0x00000001 << 22)                             /*!<R/W 0  1:Debug port group 6 enable */
#define AON_SHIFT_DBG_PORT5_EN                       21
#define AON_BIT_DBG_PORT5_EN                         ((u32)0x00000001 << 21)                             /*!<R/W 0  1:Debug port group 5 enable */
#define AON_SHIFT_DBG_PORT4_EN                       20
#define AON_BIT_DBG_PORT4_EN                         ((u32)0x00000001 << 20)                             /*!<R/W 0  1:Debug port group 4 enable */
#define AON_SHIFT_DBG_PORT3_EN                       19
#define AON_BIT_DBG_PORT3_EN                         ((u32)0x00000001 << 19)                             /*!<R/W 0  1:Debug port group 3 enable */
#define AON_SHIFT_DBG_PORT2_EN                       18
#define AON_BIT_DBG_PORT2_EN                         ((u32)0x00000001 << 18)                             /*!<R/W 0  1:Debug port group 2 enable */
#define AON_SHIFT_DBG_PORT1_EN                       17
#define AON_BIT_DBG_PORT1_EN                         ((u32)0x00000001 << 17)                             /*!<R/W 0  1:Debug port group 1 enable */
#define AON_SHIFT_DBG_PORT0_EN                       16
#define AON_BIT_DBG_PORT0_EN                         ((u32)0x00000001 << 16)                             /*!<R/W 0  1:Debug port group 0 enable */
#define AON_SHIFT_DBG_PORT                           8
#define AON_MASK_DBG_PORT                            ((u32)0x000000FF << 8)                              /*!<R/W 0  Debug port function selection: 8'h00: OTP 8'h01: SIC 8'h02: PMC 8'h03: Comparator 8'h4: HS SDM 8'h5: LS SDM (128K/4) 8'h8: PON UART0 8'h80: SPI_2 (SPI slave) 8'h81: SPI_3 (SPI slave) 8'h82: I2C0 8'h83: I2C1 8'h84: I2C2 8'h85: I2C3 8'h86: UART1 8'h87: UART2 8'h88: UART3 8'h89: SPORT 8'h8A: DDRPHY (High 32bit) 8'h8B: DDRPHY (Low 32bit) 8'h8C: ECDSA 8'h8D: SD Host 8'h8E: ED25519 8'h8F: Digital audio codec 8'h90: MIPI 8'h91: ADC 8'h92: SGPIO 8'h93: I2S0 8'h94: I2S1 8'h95: IPSEC 8'h96: LX arbiter 8'h97: SIC2AHB 8'h98: SDIO Host 8'h99: TRNG 8'h9A: BTTOP 8'h9B: GMAC 8'h9C: USB OTG 8'h9D: FE PHY 8'h9E: ISP 8'h9F: AUX 8'hA0: WLAN BB 8'hA1: WLAN MAC 8'hA2: NN 8'hA3: USB PHY 8'hA4: Nand flash */
#define AON_SHIFT_DBG_PIN_SEL                        4
#define AON_MASK_DBG_PIN_SEL                         ((u32)0x0000000F << 4)                              /*!<R/W 0  Debugger pin sel (TBD) */
#define AON_SHIFT_OTP3                               2
#define AON_MASK_OTP3                                ((u32)0x00000003 << 2)                              /*!<R/W 0  For OTP Use */
#define AON_SHIFT_DBG_SEL                            1
#define AON_BIT_DBG_SEL                              ((u32)0x00000001 << 1)                              /*!<R/W 1  Debugger mode sel (1: JTAG, 0: SWD) */
#define AON_SHIFT_DBG_EN                             0
#define AON_BIT_DBG_EN                               ((u32)0x00000001 << 0)                              /*!<R/W 1  Debugger pin enable(1: enable, 0: disable) */
/** @} */

/**************************************************************************//**
 * @defgroup AON_REG_AON_OTP_SYSCFG3
 * @brief                                            (@ 0X0D0)
 * @{
 *****************************************************************************/
#define AON_SHIFT_FLASH_PIN_SEL                      28
#define AON_MASK_FLASH_PIN_SEL                       ((u32)0x0000000F << 28)                             /*!<R/W 0  Flash pin sel(TBD) */
#define AON_SHIFT_FLASH_MODE                         24
#define AON_MASK_FLASH_MODE                          ((u32)0x0000000F << 24)                             /*!<R/W 0  Flash IO mode sel(TBD) */
#define AON_SHIFT_DBG_PORT7_SEL                      20
#define AON_MASK_DBG_PORT7_SEL                       ((u32)0x0000000F << 20)                             /*!<R/W 0  Debug port group 7 data sel 0000 : debug data 3:0 0001 : debug data 7:4 0010 : debug data 11:8 0011 : debug data 15:12 0100 : debug data 19:16 0101 : debug data 23:20 0110 : debug data 27:24 0111 : debug data 31:28 */
#define AON_SHIFT_DBG_PORT6_SEL                      16
#define AON_MASK_DBG_PORT6_SEL                       ((u32)0x0000000F << 16)                             /*!<R/W 0  Debug port group 6 data sel 0000 : debug data 3:0 0001 : debug data 7:4 0010 : debug data 11:8 0011 : debug data 15:12 0100 : debug data 19:16 0101 : debug data 23:20 0110 : debug data 27:24 0111 : debug data 31:28 */
#define AON_SHIFT_DBG_PORT5_SEL                      12
#define AON_MASK_DBG_PORT5_SEL                       ((u32)0x0000000F << 12)                             /*!<R/W 0  Debug port group 5 data sel 0000 : debug data 3:0 0001 : debug data 7:4 0010 : debug data 11:8 0011 : debug data 15:12 0100 : debug data 19:16 0101 : debug data 23:20 0110 : debug data 27:24 0111 : debug data 31:28 */
#define AON_SHIFT_DBG_PORT4_SEL                      8
#define AON_MASK_DBG_PORT4_SEL                       ((u32)0x0000000F << 8)                              /*!<R/W 0  Debug port group 4 data sel 0000 : debug data 3:0 0001 : debug data 7:4 0010 : debug data 11:8 0011 : debug data 15:12 0100 : debug data 19:16 0101 : debug data 23:20 0110 : debug data 27:24 0111 : debug data 31:28 */
#define AON_SHIFT_DBG_PORT3_SEL                      4
#define AON_MASK_DBG_PORT3_SEL                       ((u32)0x0000000F << 4)                              /*!<R/W 0  Debug port group 3 data sel 0000 : debug data 3:0 0001 : debug data 7:4 0010 : debug data 11:8 0011 : debug data 15:12 0100 : debug data 19:16 0101 : debug data 23:20 0110 : debug data 27:24 0111 : debug data 31:28 */
#define AON_SHIFT_DBG_PORT2_SEL                      0
#define AON_MASK_DBG_PORT2_SEL                       ((u32)0x0000000F << 0)                              /*!<R/W 0  Debug port group 2 data sel 0000 : debug data 3:0 0001 : debug data 7:4 0010 : debug data 11:8 0011 : debug data 15:12 0100 : debug data 19:16 0101 : debug data 23:20 0110 : debug data 27:24 0111 : debug data 31:28 */
/** @} */

/**************************************************************************//**
 * @defgroup AON_REG_AON_OTP_SYSCFG4
 * @brief                                            (@ 0X0D4)
 * @{
 *****************************************************************************/
#define AON_SHIFT_LOG_DBG_EN                         31
#define AON_BIT_LOG_DBG_EN                           ((u32)0x00000001 << 31)                             /*!<R/W 0  Log UART message on/off (0: On, 1: off), Use by SW */
#define AON_SHIFT_OTP6                               28
#define AON_MASK_OTP6                                ((u32)0x00000007 << 28)                             /*!<R/W 0  For OTP Use */
#define AON_SHIFT_LOG_TX_PIN_SEL                     26
#define AON_MASK_LOG_TX_PIN_SEL                      ((u32)0x00000003 << 26)                             /*!<R/W 0  Log UART TX pin sel, Use by SW */
#define AON_SHIFT_LOG_RX_PIN_SEL                     24
#define AON_MASK_LOG_RX_PIN_SEL                      ((u32)0x00000003 << 24)                             /*!<R/W 0  Log UART RX pin sel, Use by SW */
#define AON_SHIFT_ROM_UART_BAUD                      20
#define AON_MASK_ROM_UART_BAUD                       ((u32)0x0000000F << 20)                             /*!<R/W 0  ROM UART Baud Rate Sel(TBD), Use by SW */
#define AON_SHIFT_OTP5                               16
#define AON_MASK_OTP5                                ((u32)0x0000000F << 16)                             /*!<R/W 0  For OTP Use */
#define AON_SHIFT_ROM_DBG_EN                         15
#define AON_BIT_ROM_DBG_EN                           ((u32)0x00000001 << 15)                             /*!<R/W 0  ROM UART message on/off (0: On, 1: off), Use by SW */
#define AON_SHIFT_ROM_UART_SEL                       12
#define AON_MASK_ROM_UART_SEL                        ((u32)0x00000007 << 12)                             /*!<R/W 0  ROM UART sel (TBD), Use by SW */
#define AON_SHIFT_ROM_TX_SEL                         10
#define AON_MASK_ROM_TX_SEL                          ((u32)0x00000003 << 10)                             /*!<R/W 0  ROM UART TX pin sel, Use by SW */
#define AON_SHIFT_ROM_RX_SEL                         8
#define AON_MASK_ROM_RX_SEL                          ((u32)0x00000003 << 8)                              /*!<R/W 0  ROM UART RX pin sel, Use by SW */
#define AON_SHIFT_BOOT_SEL                           4
#define AON_MASK_BOOT_SEL                            ((u32)0x0000000F << 4)                              /*!<R/W 0  Boot selection(TBD), Use by SW */
#define AON_SHIFT_OTP4                               0
#define AON_MASK_OTP4                                ((u32)0x0000000F << 0)                              /*!<R/W 0  For OTP Use */
/** @} */

