Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/lib/include/rtl8735b_aon_type.h
/**************************************************************************//**
 * @defgroup AON_REG_AON_OTP_SYSCFG5
 * @brief                                            (@ 0X0D8)
 * @{
 *****************************************************************************/
#if IS_CUT_TEST(CONFIG_CHIP_VER)
#define AON_SHIFT_OTP9                               30
#define AON_MASK_OTP9                                ((u32)0x00000003 << 30)                             /*!<R/W 0  For OTP Use */
#else
#define AON_SHIFT_OTP9                               31
#define AON_BIT_OTP9                                 ((u32)0x00000001 << 31)                             /*!<R/W 0  For OTP Use */
#define AON_SHIFT_AACK_EN                            30
#define AON_BIT_AACK_EN                              ((u32)0x00000001 << 30)                             /*!<R/W 0  0:Enable AACK Circuit, 1: Disable AACK Circuit */
#endif
#define AON_SHIFT_PFM_OCP                            27
#define AON_MASK_PFM_OCP                             ((u32)0x00000007 << 27)                             /*!<R/W 011  Mapping to AON+0x18[25:23] once FPWM_L1=0 */
#define AON_SHIFT_PFM_ZCD_H                          25
#define AON_MASK_PFM_ZCD_H                           ((u32)0x00000003 << 25)                             /*!<R/W 01  Mapping to AON+0x18[28:27] once FPWM_L1=0 */
#define AON_SHIFT_PFM_MOS_HALF                       24
#define AON_BIT_PFM_MOS_HALF                         ((u32)0x00000001 << 24)                             /*!<R/W 1  Mapping to AON+0x1C[11] once FPWM_L1=0 */
#define AON_SHIFT_OTP8                               22
#define AON_MASK_OTP8                                ((u32)0x00000003 << 22)                             /*!<R/W 0  For OTP Use */
#define AON_SHIFT_PWM_OCP                            19
#define AON_MASK_PWM_OCP                             ((u32)0x00000007 << 19)                             /*!<R/W 011  Mapping to AON+0x18[25:23] once FPWM_L1=1 */
#define AON_SHIFT_PWM_ZCD_H                          17
#define AON_MASK_PWM_ZCD_H                           ((u32)0x00000003 << 17)                             /*!<R/W 10  Mapping to AON+0x18[28:27] once FPWM_L1=1 */
#define AON_SHIFT_PWM_MOS_HALF                       16
#define AON_BIT_PWM_MOS_HALF                         ((u32)0x00000001 << 16)                             /*!<R/W 0  Mapping to AON+0x1C[11] once FPWM_L1=1 */
#if IS_CUT_TEST(CONFIG_CHIP_VER)
#define AON_SHIFT_OTP7                               11
#define AON_MASK_OTP7                                ((u32)0x0000001F << 11)                             /*!<R/W 0  For OTP Use */
#else
#define AON_SHIFT_OTP7                               14
#define AON_MASK_OTP7                                ((u32)0x00000003 << 14)                             /*!<R/W 0  For OTP Use */
#define AON_SHIFT_XTAL_LP_CTRL                       13
#define AON_BIT_XTAL_LP_CTRL                         ((u32)0x00000001 << 13)                             /*!<R/W 0  0:Manual Mode */
#define AON_SHIFT_ISP_CTRL                           12
#define AON_BIT_ISP_CTRL                             ((u32)0x00000001 << 12)                             /*!<R/W Once 1  1:Enable ISP Function  */
#define AON_SHIFT_ENC_CTRL                           11
#define AON_BIT_ENC_CTRL                             ((u32)0x00000001 << 11)                             /*!<R/W Once 1  1:Enable whole video encoder function  */
#endif
#define AON_SHIFT_H265_CTRL                          10
#define AON_BIT_H265_CTRL                            ((u32)0x00000001 << 10)                             /*!<R/W Once 1  1:Enable H265 Function (For SW Control) */
#define AON_SHIFT_NN_CTRL                            9
#define AON_BIT_NN_CTRL                              ((u32)0x00000001 << 9)                              /*!<R/W Once 1  1:Enable NN Function */
#define AON_SHIFT_RM3_DBG_MD_SEL                     8
#define AON_BIT_RM3_DBG_MD_SEL                       ((u32)0x00000001 << 8)                              /*!<R/W 0  Real-M300 SWJ-DP Mode Selection (SW Only) 0:SWD-DP Mode 1:JTAG-DP Mode */
#define AON_SHIFT_RM3_DBG_PIN_EN                     7
#define AON_BIT_RM3_DBG_PIN_EN                       ((u32)0x00000001 << 7)                              /*!<R/W 0  Real-M300 SWJ-DP Pinmux Function Enable (SW Only) 0:SWD/JTAG Pin Disable 1:SWD/JTAG Pin Enable */
#define AON_SHIFT_DBG_CHAIN_EN                       6
#define AON_BIT_DBG_CHAIN_EN                         ((u32)0x00000001 << 6)                              /*!<R/W 0  Real-M500 and Real-M300 JTAG Chain Mode Enable (SW Only) 0:JTAG Chain Mode Disable 1:JTAG Chain Mode Enable */
#define AON_SHIFT_RM5_DBG_MD_SEL                     5
#define AON_BIT_RM5_DBG_MD_SEL                       ((u32)0x00000001 << 5)                              /*!<R/W 0  Real-M500 SWJ-DP Mode Selection (SW Only) 0:SWD-DP Mode 1:JTAG-DP Mode */
#define AON_SHIFT_RM5_DBG_PIN_EN                     4
#define AON_BIT_RM5_DBG_PIN_EN                       ((u32)0x00000001 << 4)                              /*!<R/W 0  Real-M500 SWJ-DP Pinmux Function Enable (SW Only) 0:SWD/JTAG Pin Disable 1:SWD/JTAG Pin Enable */
#define AON_SHIFT_XTAL_SEL                           0
#define AON_MASK_XTAL_SEL                            ((u32)0x0000000F << 0)                              /*!<R/W 0  xtal selection, Default=40MHz 0000= 40MHz, 0001= 25MHz, 0010= 13MHz, 0011= 19.2MHz 0100= 20MHz, 0101= 26MHz, 0110= 38.4MHz, 0111= 17.664MHz 1000= 16MHz, 1001= 14.138MHz, 1010= 12MHz, 1011= 52MHz 1100= 48MHz, 1101= 27MHz, 1110= 24MHz, 1111= none  */
/** @} */

/**************************************************************************//**
 * @defgroup AON_REG_AON_OTP_SYSCFG6
 * @brief                                            (@ 0X0DC)
 * @{
 *****************************************************************************/
#define AON_SHIFT_SYSCFG6                            0
#define AON_MASK_SYSCFG6                             ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0   */
/** @} */

/**************************************************************************//**
 * @defgroup AON_REG_AON_OTP_SYSCFG7
 * @brief                                            (@ 0X0E0)
 * @{
 *****************************************************************************/
#define AON_SHIFT_SYSCFG7                            0
#define AON_MASK_SYSCFG7                             ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0   */
/** @} */

/**************************************************************************//**
 * @defgroup AON_REG_AON_DBG_REG
 * @brief                                            (@ 0X0E4)
 * @{
 *****************************************************************************/
#define AON_SHIFT_SYS_DBG_VALUE                      0
#define AON_MASK_SYS_DBG_VALUE                       ((u32)0xFFFFFFFF << 0)                              /*!<R 0  SYS debug register value */
/** @} */

/**************************************************************************//**
 * @defgroup AON_REG_AON_SYS_CTRL
 * @brief                                            (@ 0X0E8)
 * @{
 *****************************************************************************/
#define AON_SHIFT_CPU_CLK_SEL                        17
#define AON_BIT_CPU_CLK_SEL                          ((u32)0x00000001 << 17)                             /*!<R/W 0  00: 500MHz/300MHz 01: 400MHz */
#define AON_SHIFT_DEBUGER_EN                         8
#define AON_BIT_DEBUGER_EN                           ((u32)0x00000001 << 8)                              /*!<R/W 0  1: swd mux enable */
#define AON_SHIFT_OTP_RW_REG_SEL                     7
#define AON_BIT_OTP_RW_REG_SEL                       ((u32)0x00000001 << 7)                              /*!<R/W 0  OTP Indirect Read/Write Register Selection 0: From AON indirect access register 1: From SYSON/SYSON_S indirect access register */
#define AON_SHIFT_OCP_IMR                            6
#define AON_BIT_OCP_IMR                              ((u32)0x00000001 << 6)                              /*!<R/W 0  1: Enable OCP interrupt */
#define AON_SHIFT_OCP_ISR                            5
#define AON_BIT_OCP_ISR                              ((u32)0x00000001 << 5)                              /*!<R/W1C 0  1: indicate OCP status */
#define AON_SHIFT_AON_TIMER_IMR                      4
#define AON_BIT_AON_TIMER_IMR                        ((u32)0x00000001 << 4)                              /*!<R/W 0  1: Enable AON Timer interrupt */
#define AON_SHIFT_CPU_RET_MODE                       3
#define AON_BIT_CPU_RET_MODE                         ((u32)0x00000001 << 3)                              /*!<R/W 0  1:Enable RET Mode, 0: Disable RET Mode */
#define AON_SHIFT_BOD_INT_IMR                        2
#define AON_BIT_BOD_INT_IMR                          ((u32)0x00000001 << 2)                              /*!<R/W 0  1: indicate BOD Mask; Vin < BOD_VINTL (Ex: Vin<2.791 and then BOD_ISR_STS was high) */
#define AON_SHIFT_GPIOA4_OUTPUT_STATUS               1
#define AON_BIT_GPIOA4_OUTPUT_STATUS                 ((u32)0x00000001 << 1)                              /*!<R/W 0  1: Output High, 0: Output Low */
#define AON_SHIFT_GPIOA4_OUTPUT_EN                   0
#define AON_BIT_GPIOA4_OUTPUT_EN                     ((u32)0x00000001 << 0)                              /*!<R/W 0  1: GPIO Output Enable */
/** @} */

/**************************************************************************//**
 * @defgroup AON_REG_AON_SIC_DBG_CTRL
 * @brief                                            (@ 0X0EC)
 * @{
 *****************************************************************************/
#define AON_SHIFT_SIC_DBG_GP_SEL                     1
#define AON_MASK_SIC_DBG_GP_SEL                      ((u32)0x000000FF << 1)                              /*!<R/W 0x00  Group Sel */
#define AON_SHIFT_SIC_DBG_EN                         0
#define AON_BIT_SIC_DBG_EN                           ((u32)0x00000001 << 0)                              /*!<R/W 0x00  1:Enable */
/** @} */

/**************************************************************************//**
 * @defgroup AON_REG_AON_OTP_CNT_Z_CTRL
 * @brief                                            (@ 0X0F8)
 * @{
 *****************************************************************************/
#define AON_SHIFT_RSVD8                              19
#define AON_MASK_RSVD8                               ((u32)0x00001FFF << 19)                             /*!<R/W 0x000   */
#define AON_SHIFT_B_OTP_CZ_SS_RSVD_STS               18
#define AON_BIT_B_OTP_CZ_SS_RSVD_STS                 ((u32)0x00000001 << 18)                             /*!<R/W1C 0  SS_RSVD Counting Zero Check Status 0: Counting zero check status of SS_RSVD is passed 1: Counting zero check status of SS_RSVD is failed */
#define AON_SHIFT_B_OTP_CZ_RSIP_K2_STS               17
#define AON_BIT_B_OTP_CZ_RSIP_K2_STS                 ((u32)0x00000001 << 17)                             /*!<R/W1C 0  RSIP_K2 Counting Zero Check Status 0: Counting zero check status of RSIP_K2 is passed 1: Counting zero check status of RSIP_K2 is failed */
#define AON_SHIFT_B_OTP_CZ_RSIP_K1_STS               16
#define AON_BIT_B_OTP_CZ_RSIP_K1_STS                 ((u32)0x00000001 << 16)                             /*!<R/W1C 0  RSIP_K1 Counting Zero Check Status 0: Counting zero check status of RSIP_K1 is passed 1: Counting zero check status of RSIP_K1 is failed */
#define AON_SHIFT_B_OTP_CZ_JTAG_NS2_STS              15
#define AON_BIT_B_OTP_CZ_JTAG_NS2_STS                ((u32)0x00000001 << 15)                             /*!<R/W1C 0  JTAG_NS2 Counting Zero Check Status 0: Counting zero check status of JTAG_NS2 is passed 1: Counting zero check status of JTAG_NS2 is failed */
#define AON_SHIFT_B_OTP_CZ_JTAG_NS1_STS              14
#define AON_BIT_B_OTP_CZ_JTAG_NS1_STS                ((u32)0x00000001 << 14)                             /*!<R/W1C 0  JTAG_NS1 Counting Zero Check Status 0: Counting zero check status of JTAG_NS1 is passed 1: Counting zero check status of JTAG_NS1 is failed */
#define AON_SHIFT_B_OTP_CZ_JTAG_S2_STS               13
#define AON_BIT_B_OTP_CZ_JTAG_S2_STS                 ((u32)0x00000001 << 13)                             /*!<R/W1C 0  JTAG_S2 Counting Zero Check Status 0: Counting zero check status of JTAG_S2 is passed 1: Counting zero check status of JTAG_S2 is failed */
#define AON_SHIFT_B_OTP_CZ_JTAG_S1_STS               12
#define AON_BIT_B_OTP_CZ_JTAG_S1_STS                 ((u32)0x00000001 << 12)                             /*!<R/W1C 0  JTAG_S1 Counting Zero Check Status 0: Counting zero check status of JTAG_S1 is passed 1: Counting zero check status of JTAG_S1 is failed */
#define AON_SHIFT_B_OTP_CZ_HUK_RSVD_STS              11
#define AON_BIT_B_OTP_CZ_HUK_RSVD_STS                ((u32)0x00000001 << 11)                             /*!<R/W1C 0  HUK_RSVD Counting Zero Check Status 0: Counting zero check status of HUK_RSVD is passed 1: Counting zero check status of HUK_RSVD is failed */
#define AON_SHIFT_B_OTP_CZ_HUK_STS                   10
#define AON_BIT_B_OTP_CZ_HUK_STS                     ((u32)0x00000001 << 10)                             /*!<R/W1C 0  HUK Counting Zero Check Status 0: Counting zero check status of HUK is passed 1: Counting zero check status of HUK is failed */
#define AON_SHIFT_RSVD9                              9
#define AON_BIT_RSVD9                                ((u32)0x00000001 << 9)                              /*!<R/W 0   */
#define AON_SHIFT_B_OTP_CZ_RSVD2_STS                 8
#define AON_BIT_B_OTP_CZ_RSVD2_STS                   ((u32)0x00000001 << 8)                              /*!<R/W1C 0  RSVD2 Counting Zero Check Status 0: Counting zero check status of RSVD2 is passed 1: Counting zero check status of RSVD2 is failed */
#define AON_SHIFT_B_OTP_CZ_RSVD1_STS                 7
#define AON_BIT_B_OTP_CZ_RSVD1_STS                   ((u32)0x00000001 << 7)                              /*!<R/W1C 0  RSVD1 Counting Zero Check Status 0: Counting zero check status of RSVD1 is passed 1: Counting zero check status of RSVD1 is failed */
#define AON_SHIFT_B_OTP_CZ_ECDSA2_STS                6
#define AON_BIT_B_OTP_CZ_ECDSA2_STS                  ((u32)0x00000001 << 6)                              /*!<R/W1C 0  ECDSA2 Counting Zero Check Status 0: Counting zero check status of ECDSA2 is passed 1: Counting zero check status of ECDSA2 is failed */
#define AON_SHIFT_B_OTP_CZ_ECDSA1_STS                5
#define AON_BIT_B_OTP_CZ_ECDSA1_STS                  ((u32)0x00000001 << 5)                              /*!<R/W1C 0  ECDSA1 Counting Zero Check Status 0: Counting zero check status of ECDSA1 is passed 1: Counting zero check status of ECDSA1 is failed */
#define AON_SHIFT_B_OTP_CZ_IPSEC2_STS                4
#define AON_BIT_B_OTP_CZ_IPSEC2_STS                  ((u32)0x00000001 << 4)                              /*!<R/W1C 0  IPSEC2 Counting Zero Check Status 0: Counting zero check status of IPSEC2 is passed 1: Counting zero check status of IPSEC2 is failed */
#define AON_SHIFT_B_OTP_CZ_IPSEC1_STS                3
#define AON_BIT_B_OTP_CZ_IPSEC1_STS                  ((u32)0x00000001 << 3)                              /*!<R/W1C 0  IPSEC1 Counting Zero Check Status 0: Counting zero check status of IPSEC1 is passed 1: Counting zero check status of IPSEC1 is failed */
#define AON_SHIFT_B_OTP_CZ_ROTPK2_STS                2
#define AON_BIT_B_OTP_CZ_ROTPK2_STS                  ((u32)0x00000001 << 2)                              /*!<R/W1C 0  ROTPK2 Counting Zero Check Status 0: Counting zero check status of ROTPK2 is passed 1: Counting zero check status of ROTPK2 is failed */
#define AON_SHIFT_B_OTP_CZ_ROTPK1_STS                1
#define AON_BIT_B_OTP_CZ_ROTPK1_STS                  ((u32)0x00000001 << 1)                              /*!<R/W1C 0  ROTPK1 Counting Zero Check Status 0: Counting zero check status of ROTPK1 is passed 1: Counting zero check status of ROTPK1 is failed */
#define AON_SHIFT_B_OTP_CNTZ_CTRL                    0
#define AON_BIT_B_OTP_CNTZ_CTRL                      ((u32)0x00000001 << 0)                              /*!<R/W 1  OTP Keys Counting Zero Bit Check Control This bit is used to control conting zero check mechanism is enabled or not. 0: Disable keys counting zero bit check mechanism 1: Enable keys counting zero bit check mechanism */
/** @} */

/**************************************************************************//**
 * @defgroup AON_REG_AON_PMC_CTRL
 * @brief                                            (@ 0X0FC)
 * @{
 *****************************************************************************/
#define AON_SHIFT_AON_GPIO_WAKE_SEL                  5
#define AON_MASK_AON_GPIO_WAKE_SEL                   ((u32)0x0000000F << 5)                              /*!<R/W 0  0000: GPIOA0~GPIOA3 can wake up system individually 0001: RSVD 0010: RSVD 0011: GPIOA0&GPIOA1=1 and then wake up system. GPIOA2 and GPIOA3 can wake up system individually 0100: RSVD 0101: GPIOA0&GPIOA2=1 and then wake up system. GPIOA1 and GPIOA3 can wake up system individually 0110: GPIOA1&GPIOA2=1 and then wake up system. GPIOA0 and GPIOA3 can wake up system individually 0111: GPIOA0&GPIOA1&GPIOA2=1 and then wake up system. GPIOA0 can wake up system individually 1000: RSVD 1001: GPIOA0&GPIOA3=1 and then wake up system. GPIOA1 and GPIOA2 can wake up system individually 1010: GPIOA1&GPIOA3=1 and then wake up system. GPIOA0 and GPIOA2 can wake up system individually 1011: GPIOA0&GPIOA1&GPIOA3=1 and then wake up system. GPIOA2 can wake up system individually 1100: GPIOA2&GPIOA3=1 and then wake up system. GPIOA0 and GPIOA1 can wake up system individually 1101: GPIOA0&GPIOA2&GPIOA3=1 and then wake up system. GPIOA1 can wake up system individually 1110: GPIOA1&GPIOA2&GPIOA3=1 and then wake up system. GPIOA0 can wake up system individually 1111: GPIOA0&GPIOA1&GPIOA2&GPIOA3=1 and then wake up system  */
#define AON_SHIFT_SYSON_PLL_SWITCH                   3
#define AON_MASK_SYSON_PLL_SWITCH                    ((u32)0x00000003 << 3)                              /*!<R/W 0  00: 500MHz 01: 400MHz 10: 300MHz */
#define AON_SHIFT_SYSON_PM_CMD_SLP                   2
#define AON_BIT_SYSON_PM_CMD_SLP                     ((u32)0x00000001 << 2)                              /*!<R/W 0  1: command SYSON SM to enter sleep state, when PMC finishes the process, this bit will be auto clear to 0 */
#define AON_SHIFT_DSLP_LV_EN                         1
#define AON_BIT_DSLP_LV_EN                           ((u32)0x00000001 << 1)                              /*!<R/W 0  0: LDO_AON output stay 0.9V under deep sleep state 1: LDO_AON output reduce to 0.8V under deep sleep state */
#define AON_SHIFT_SYSON_PM_CMD_DSLP                  0
#define AON_BIT_SYSON_PM_CMD_DSLP                    ((u32)0x00000001 << 0)                              /*!<R/W 0  1: command SYSON SM to enter deep sleep state,when PMC finishes the process, this bit will be auto clear to 0 */
/** @} */

/**************************************************************************//**
 * @defgroup AON_REG_AON_PMC_OPT
 * @brief                                            (@ 0X100)
 * @{
 *****************************************************************************/
#define AON_SHIFT_DSLP_ANA_4M_EN                     10
#define AON_BIT_DSLP_ANA_4M_EN                       ((u32)0x00000001 << 10)                             /*!<R/W 1  When enter dslp, 1: enable clk; 0: disable If it's selected to disable in DSLP, HW should enable clock the clock automatically when wake event takes place. */
#define AON_SHIFT_DSLP_AON_REG_CLK_EN                9
#define AON_BIT_DSLP_AON_REG_CLK_EN                  ((u32)0x00000001 << 9)                              /*!<R/W 1  When enter dslp, 1: enable clk; 0: gated If it's selected to disable in DSLP, HW should enable clock the clock automatically when wake event takes place. */
#define AON_SHIFT_AON_FSM_DSLP_CLK_SEL               0
#define AON_BIT_AON_FSM_DSLP_CLK_SEL                 ((u32)0x00000001 << 0)                              /*!<R/W 0  FSM clock selection in deep sleep mode 0: ANA_CLK_100K 1: OSC 4MHz */
/** @} */

/**************************************************************************//**
 * @defgroup AON_REG_AON_BOOT_REASON
 * @brief                                            (@ 0X104)
 * @{
 *****************************************************************************/
#define AON_SHIFT_BOD_ISR_STS                        5
#define AON_BIT_BOD_ISR_STS                          ((u32)0x00000001 << 5)                              /*!<R/W1C 0  1: Indicate BOD interrupt and clear by SW */
#define AON_SHIFT_BOD_STS                            4
#define AON_BIT_BOD_STS                              ((u32)0x00000001 << 4)                              /*!<R/W1C 1  1: Indicate BOD reboot and clear by SW */
#define AON_SHIFT_AON_STANDBY_STS                    3
#define AON_BIT_AON_STANDBY_STS                      ((u32)0x00000001 << 3)                              /*!<R/W 0  Control by SW */
#define AON_SHIFT_AON_DSLP_STS                       2
#define AON_BIT_AON_DSLP_STS                         ((u32)0x00000001 << 2)                              /*!<R/W 0  Control by SW */
#define AON_SHIFT_AON_WATCHDOG_STS                   1
#define AON_BIT_AON_WATCHDOG_STS                     ((u32)0x00000001 << 1)                              /*!<R/W1C 0  1: Indicate AON Watchdog reboot and clear by SW */
#define AON_SHIFT_VNDR_WATCHDOG_STS                  0
#define AON_BIT_VNDR_WATCHDOG_STS                    ((u32)0x00000001 << 0)                              /*!<R/W1C 0  1: Indicate Vendor Watchdog reboot and clear by SW */
/** @} */

/**************************************************************************//**
 * @defgroup AON_REG_AON_WL_CTRL
 * @brief                                            (@ 0X108)
 * @{
 *****************************************************************************/
#define AON_SHIFT_SYS_WLAFE_POD125                   25
#define AON_BIT_SYS_WLAFE_POD125                     ((u32)0x00000001 << 25)                             /*!<R/W 0  0: power down 125 WLAFE  */
#define AON_SHIFT_SYS_WLAFE_POD33                    24
#define AON_BIT_SYS_WLAFE_POD33                      ((u32)0x00000001 << 24)                             /*!<R/W 0  0: power down 33 WLAFE  */
#define AON_SHIFT_SYS_WLAON_CLK_SEL                  6
#define AON_BIT_SYS_WLAON_CLK_SEL                    ((u32)0x00000001 << 6)                              /*!<R/W 0  1: 100kHz, 0:4MHz */
#define AON_SHIFT_SYS_WLON_CLK_EN                    5
#define AON_BIT_SYS_WLON_CLK_EN                      ((u32)0x00000001 << 5)                              /*!<R/W 0  1: enable WL clock */
#define AON_SHIFT_SYS_WLAXI_CLK_EN                   4
#define AON_BIT_SYS_WLAXI_CLK_EN                     ((u32)0x00000001 << 4)                              /*!<R/W 0  1: enable WL clock */
#define AON_SHIFT_WL_REQ2ACT                         3
#define AON_BIT_WL_REQ2ACT                           ((u32)0x00000001 << 3)                              /*!<R 0  1: WLAN request to active  */
#define AON_SHIFT_WL_RDY2ACT                         2
#define AON_BIT_WL_RDY2ACT                           ((u32)0x00000001 << 2)                              /*!<R/W 0  1: WLAN ready to active */
#define AON_SHIFT_SYS_WLON_EN                        1
#define AON_BIT_SYS_WLON_EN                          ((u32)0x00000001 << 1)                              /*!<R/W 0  1: enable WLON and WL macro block */
#define AON_SHIFT_SYS_WL_AXI_EN                      0
#define AON_BIT_SYS_WL_AXI_EN                        ((u32)0x00000001 << 0)                              /*!<R/W 0  1: enable WL AXI function */
/** @} */

