Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/lib/include/rtl8735b_aon_type.h
/**************************************************************************//**
 * @defgroup AON_REG_AON_SLP_WAKE_EVENT_MSK0
 * @brief                                            (@ 0X10C)
 * @{
 *****************************************************************************/
#define AON_SHIFT_RSVD10                             16
#define AON_MASK_RSVD10                              ((u32)0x0000FFFF << 16)                             /*!<R/W 0  RSVD */
#define AON_SHIFT_SYSON_WEVT_SGPIO_MSK               15
#define AON_BIT_SYSON_WEVT_SGPIO_MSK                 ((u32)0x00000001 << 15)                             /*!<R/W 0  1: enable SGPIO Wakeup event; 0: disable the event to wakeup system */
#define AON_SHIFT_SYSON_WEVT_ADC_MSK                 14
#define AON_BIT_SYSON_WEVT_ADC_MSK                   ((u32)0x00000001 << 14)                             /*!<R/W 0  1: enable ADC Wakeup event; 0: disable the event to wakeup system */
#define AON_SHIFT_SYSON_WEVT_USB_MSK                 13
#define AON_BIT_SYSON_WEVT_USB_MSK                   ((u32)0x00000001 << 13)                             /*!<R/W 0  1: enable USB Wakeup event; 0: disable the event to wakeup system */
#define AON_SHIFT_AON_WEVT_AON_GPIO3_MSK             12
#define AON_BIT_AON_WEVT_AON_GPIO3_MSK               ((u32)0x00000001 << 12)                             /*!<R/W 0  1: enable AON GPIO3 Wakeup event; 0: disable the event to wakeup system */
#define AON_SHIFT_AON_WEVT_AON_GPIO2_MSK             11
#define AON_BIT_AON_WEVT_AON_GPIO2_MSK               ((u32)0x00000001 << 11)                             /*!<R/W 0  1: enable AON GPIO2 Wakeup event; 0: disable the event to wakeup system */
#define AON_SHIFT_AON_WEVT_AON_GPIO1_MSK             10
#define AON_BIT_AON_WEVT_AON_GPIO1_MSK               ((u32)0x00000001 << 10)                             /*!<R/W 0  1: enable AON GPIO1 Wakeup event; 0: disable the event to wakeup system */
#define AON_SHIFT_AON_WEVT_AON_GPIO0_MSK             9
#define AON_BIT_AON_WEVT_AON_GPIO0_MSK               ((u32)0x00000001 << 9)                              /*!<R/W 0  1: enable AON GPIO0 Wakeup event; 0: disable the event to wakeup system */
#define AON_SHIFT_AON_WEVT_AON_RTC_MSK               8
#define AON_BIT_AON_WEVT_AON_RTC_MSK                 ((u32)0x00000001 << 8)                              /*!<R/W 0  1: enable AON RTC Wakeup event; 0: disable the event to wakeup system */
#define AON_SHIFT_AON_WEVT_AON_COMP_MSK              7
#define AON_BIT_AON_WEVT_AON_COMP_MSK                ((u32)0x00000001 << 7)                              /*!<R/W 0  1: enable AON Comparator Wakeup event; 0: disable the event to wakeup system */
#define AON_SHIFT_AON_WEVT_AON_TIMER_MSK             6
#define AON_BIT_AON_WEVT_AON_TIMER_MSK               ((u32)0x00000001 << 6)                              /*!<R/W 0  1: enable AON Timer Wakeup event; 0: disable the event to wakeup system */
#define AON_SHIFT_PON_WEVT_UART_MSK                  5
#define AON_BIT_PON_WEVT_UART_MSK                    ((u32)0x00000001 << 5)                              /*!<R/W 0  1: enable UART0 Wakeup event; 0: disable the event to wakeup system */
#define AON_SHIFT_RSVD11                             4
#define AON_BIT_RSVD11                               ((u32)0x00000001 << 4)                              /*!<R/W 0  RSVD */
#define AON_SHIFT_PON_WEVT_WLAN_MSK                  3
#define AON_BIT_PON_WEVT_WLAN_MSK                    ((u32)0x00000001 << 3)                              /*!<R/W 0  1: enable WLAN Wakeup event; 0: disable the event to wakeup system */
#define AON_SHIFT_PON_WEVT_PWM_MSK                   2
#define AON_BIT_PON_WEVT_PWM_MSK                     ((u32)0x00000001 << 2)                              /*!<R/W 0  1: enable PWM Wakeup event; 0: disable the event to wakeup system */
#define AON_SHIFT_PON_WEVT_GPIO_MSK                  1
#define AON_BIT_PON_WEVT_GPIO_MSK                    ((u32)0x00000001 << 1)                              /*!<R/W 0  1: enable PON GPIO Wakeup event; 0: disable the event to wakeup system */
#define AON_SHIFT_PON_WEVT_GTIM0_MSK                 0
#define AON_BIT_PON_WEVT_GTIM0_MSK                   ((u32)0x00000001 << 0)                              /*!<R/W 0  1: enable GTIMER0 Wakeup event; 0: disable the event to wakeup system */
/** @} */

/**************************************************************************//**
 * @defgroup AON_REG_AON_SLP_WAKE_EVENT_STATUS0
 * @brief                                            (@ 0X110)
 * @{
 *****************************************************************************/
#define AON_SHIFT_RSVD12                             16
#define AON_MASK_RSVD12                              ((u32)0x0000FFFF << 16)                             /*!<R/W 0  RSVD  */
#define AON_SHIFT_SYSON_WEVT_SGPIO_STS               15
#define AON_BIT_SYSON_WEVT_SGPIO_STS                 ((u32)0x00000001 << 15)                             /*!<R 0  1: Indicate SGPIO Wakeup event */
#define AON_SHIFT_SYSON_WEVT_ADC_STS                 14
#define AON_BIT_SYSON_WEVT_ADC_STS                   ((u32)0x00000001 << 14)                             /*!<R 0  1: Indicate ADC Wakeup event */
#define AON_SHIFT_SYSON_WEVT_USB_STS                 13
#define AON_BIT_SYSON_WEVT_USB_STS                   ((u32)0x00000001 << 13)                             /*!<R 0  1: Indicate USB Wakeup event */
#define AON_SHIFT_AON_WEVT_AON_GPIO3_STS             12
#define AON_BIT_AON_WEVT_AON_GPIO3_STS               ((u32)0x00000001 << 12)                             /*!<R/W1C 0  1: indicate AON GPIO3 Wakeup event;  */
#define AON_SHIFT_AON_WEVT_AON_GPIO2_STS             11
#define AON_BIT_AON_WEVT_AON_GPIO2_STS               ((u32)0x00000001 << 11)                             /*!<R/W1C 0  1: indicate AON GPIO2 Wakeup event;  */
#define AON_SHIFT_AON_WEVT_AON_GPIO1_STS             10
#define AON_BIT_AON_WEVT_AON_GPIO1_STS               ((u32)0x00000001 << 10)                             /*!<R/W1C 0  1: indicate AON GPIO1 Wakeup event;  */
#define AON_SHIFT_AON_WEVT_AON_GPIO0_STS             9
#define AON_BIT_AON_WEVT_AON_GPIO0_STS               ((u32)0x00000001 << 9)                              /*!<R/W1C 0  1: indicate AON GPIO0 Wakeup event; */
#define AON_SHIFT_AON_WEVT_AON_RTC_STS               8
#define AON_BIT_AON_WEVT_AON_RTC_STS                 ((u32)0x00000001 << 8)                              /*!<R 0  1: indicate AON RTC Wakeup event */
#define AON_SHIFT_AON_WEVT_AON_COMP_STS              7
#define AON_BIT_AON_WEVT_AON_COMP_STS                ((u32)0x00000001 << 7)                              /*!<R 0  1: indicate AON Comparator Wakeup event; */
#define AON_SHIFT_AON_WEVT_AON_TIMER_STS             6
#define AON_BIT_AON_WEVT_AON_TIMER_STS               ((u32)0x00000001 << 6)                              /*!<R/W1C 0  1: indicate AON Timer Wakeup event;  */
#define AON_SHIFT_PON_WEVT_UART_STS                  5
#define AON_BIT_PON_WEVT_UART_STS                    ((u32)0x00000001 << 5)                              /*!<R 0  1: indicate UART0 Wakeup event; */
#define AON_SHIFT_RSVD13                             4
#define AON_BIT_RSVD13                               ((u32)0x00000001 << 4)                              /*!<R 0  RSVD  */
#define AON_SHIFT_PON_WEVT_WLAN_STS                  3
#define AON_BIT_PON_WEVT_WLAN_STS                    ((u32)0x00000001 << 3)                              /*!<R 0  1: indicate WLAN Wakeup event;  */
#define AON_SHIFT_PON_WEVT_PWM_STS                   2
#define AON_BIT_PON_WEVT_PWM_STS                     ((u32)0x00000001 << 2)                              /*!<R 0  1: indicate PWM Wakeup event; */
#define AON_SHIFT_PON_WEVT_GPIO_STS                  1
#define AON_BIT_PON_WEVT_GPIO_STS                    ((u32)0x00000001 << 1)                              /*!<R 0  1: indicate PON GPIO Wakeup event;  */
#define AON_SHIFT_PON_WEVT_GTIM0_STS                 0
#define AON_BIT_PON_WEVT_GTIM0_STS                   ((u32)0x00000001 << 0)                              /*!<R 0  1: indicate GTIMER0 Wakeup event;  */
/** @} */

/**************************************************************************//**
 * @defgroup AON_REG_AON_SNF_WAKE_EVENT_MSK0
 * @brief                                            (@ 0X114)
 * @{
 *****************************************************************************/
#define AON_SHIFT_RSVD14                             2
#define AON_MASK_RSVD14                              ((u32)0x3FFFFFFF << 2)                              /*!<R/W 0   */
#define AON_SHIFT_WLAN_IMR_MSK                       1
#define AON_BIT_WLAN_IMR_MSK                         ((u32)0x00000001 << 1)                              /*!<R/W 0  1: enable wlan interrupt; 0: Disable */
#define AON_SHIFT_PON_SNFEVT_WLON_PON_MSK            0
#define AON_BIT_PON_SNFEVT_WLON_PON_MSK              ((u32)0x00000001 << 0)                              /*!<R/W 0  1: enable wlan power on wakeup event interrupt; 0: Disable */
/** @} */

/**************************************************************************//**
 * @defgroup AON_REG_AON_SNF_WAKE_EVENT_STATUS
 * @brief                                            (@ 0X118)
 * @{
 *****************************************************************************/
#define AON_SHIFT_RSVD15                             2
#define AON_MASK_RSVD15                              ((u32)0x3FFFFFFF << 2)                              /*!<R/W 0   */
#define AON_SHIFT_WLAN_ISR                           1
#define AON_BIT_WLAN_ISR                             ((u32)0x00000001 << 1)                              /*!<R/W1C 0  1: indicate wlan power on status */
#define AON_SHIFT_PON_SNFEVT_WLON_PON_STS            0
#define AON_BIT_PON_SNFEVT_WLON_PON_STS              ((u32)0x00000001 << 0)                              /*!<R 0  1: indicate wlan power on wakeup status */
/** @} */

/**************************************************************************//**
 * @defgroup AON_REG_AON_PWRMGT_OPTION
 * @brief                                            (@ 0X11C)
 * @{
 *****************************************************************************/
#define AON_SHIFT_PON_PMOPT_SNZ_XTAL_NR_EN           19
#define AON_BIT_PON_PMOPT_SNZ_XTAL_NR_EN             ((u32)0x00000001 << 19)                             /*!<R/W 0  1: enable XTAL Normal mode when enter into snooze mode; 1: NR mode, 0: HP mode */
#define AON_SHIFT_PON_PMOPT_SLP_MEM1_PM_EN           17
#define AON_MASK_PON_PMOPT_SLP_MEM1_PM_EN            ((u32)0x00000003 << 17)                             /*!<R/W 0  0: Enable SRAM1 normal mode when enter into power mode 1: Enable SRAM1 RET mode when enter into power mode 2: Enable SRAM1 SD mode when enter into power mode */
#define AON_SHIFT_PON_PMOPT_SLP_MEM0_PM_EN           15
#define AON_MASK_PON_PMOPT_SLP_MEM0_PM_EN            ((u32)0x00000003 << 15)                             /*!<R/W 0  0: Enable SRAM0 normal mode when enter into power mode 1: Enable SRAM0 RET mode when enter into power mode 2: Enable SRAM0 SD mode when enter into power mode */
#define AON_SHIFT_PON_PMOPT_SLP_PERPLL_EN            14
#define AON_BIT_PON_PMOPT_SLP_PERPLL_EN              ((u32)0x00000001 << 14)                             /*!<R/W 0  1: enable Peri PLL when enter into sleep mode; 0: disable PeriPLL */
#define AON_SHIFT_PON_PMOPT_SLP_SYSPLL_EN            13
#define AON_BIT_PON_PMOPT_SLP_SYSPLL_EN              ((u32)0x00000001 << 13)                             /*!<R/W 0  1: enable syspem PLL when enter into sleep mode; 0: disable SYSPLL */
#define AON_SHIFT_PON_PMOPT_SLP_XTAL_EN              12
#define AON_BIT_PON_PMOPT_SLP_XTAL_EN                ((u32)0x00000001 << 12)                             /*!<R/W 0  1: enable XTAL when enter into sleep mode; 0: disable XTAL */
#define AON_SHIFT_PON_PMOPT_SLP_XTAL_LP_EN           11
#define AON_BIT_PON_PMOPT_SLP_XTAL_LP_EN             ((u32)0x00000001 << 11)                             /*!<R/W 0  1: enable XTAL Low Power Mode when enter into sleep mode; 0: disable XTAL */
#define AON_SHIFT_PON_PMOPT_SLP_EN_SOC               10
#define AON_BIT_PON_PMOPT_SLP_EN_SOC                 ((u32)0x00000001 << 10)                             /*!<R/W 0  1: power enable SOC platform when enter into sleep mode; 0: power off SoC domain */
#define AON_SHIFT_PON_PMOPT_SLP_EXT_SWR_EN           9
#define AON_BIT_PON_PMOPT_SLP_EXT_SWR_EN             ((u32)0x00000001 << 9)                              /*!<R/W 0  1: Enable External SWR DCORE 0: Disable External SWR DCORE */
#define AON_SHIFT_PON_PMOPT_SLP_EN_PWM_SRC           7
#define AON_BIT_PON_PMOPT_SLP_EN_PWM_SRC             ((u32)0x00000001 << 7)                              /*!<R/W 0  1: power enable SWR/LDO output heavy loading current mode when enter into sleep mode; 0: disable SWR/LDO output heavy loading mode */
#define AON_SHIFT_PON_PMOPT_SLP_EN_SWR_SRC           6
#define AON_BIT_PON_PMOPT_SLP_EN_SWR_SRC             ((u32)0x00000001 << 6)                              /*!<R/W 0  1: power enable SWR/LDO 1.8V when enter into sleep mode; 0: disable SWR/LDO */
#define AON_SHIFT_PON_PMOPT_SLP_EN_WLON_MODE         4
#define AON_MASK_PON_PMOPT_SLP_EN_WLON_MODE          ((u32)0x00000003 << 4)                              /*!<R/W 0  00: disable LDO_WLON 01: power enable LDO_WLON when enter into sleep mode; 10: enable LDO_WLON Bypass Mode when enter into sleep mode;  */
#define AON_SHIFT_PON_PMOPT_SLP_EN                   1
#define AON_BIT_PON_PMOPT_SLP_EN                     ((u32)0x00000001 << 1)                              /*!<R/W 0  1: Enable PON Domain when enter into sleep mode; 0: Disable PON Domain */
#define AON_SHIFT_PON_PMOPT_SLP_EN_4M                0
#define AON_BIT_PON_PMOPT_SLP_EN_4M                  ((u32)0x00000001 << 0)                              /*!<R/W 0  1: Enable OSC 4MHz when enter into sleep mode; 0: Disable OSC 4MHz */
/** @} */

/**************************************************************************//**
 * @defgroup AON_REG_OTP_CTRL_0
 * @brief                                            (@ 0X120)
 * @{
 *****************************************************************************/
#if IS_CUT_TEST(CONFIG_CHIP_VER)
#define AON_SHIFT_OTP_ENT                            31
#define AON_BIT_OTP_ENT                              ((u32)0x00000001 << 31)                             /*!<R/W 1  OTP IP enable time (OTP SPEC Tcs >10us) For input clock 12MHz 0:24us 1:36us default value : 1 */
#define AON_SHIFT_RSVD16                             28
#define AON_MASK_RSVD16                              ((u32)0x00000007 << 28)                             /*!<R/W 0  RSVD */
#define AON_SHIFT_OTP_RDT                            27
#define AON_BIT_OTP_RDT                              ((u32)0x00000001 << 27)                             /*!<R/W 1  OTP Clock cycle time (OTP SPEC Tcyc >80ns) For input clock 12MHz 0:166.66ns 1:249.9ns default value : 1 */
#define AON_SHIFT_RSVD17                             24
#define AON_MASK_RSVD17                              ((u32)0x00000007 << 24)                             /*!<R/W 0  RSVD */
#define AON_SHIFT_OTP_PGTS                           20
#define AON_MASK_OTP_PGTS                            ((u32)0x0000000F << 20)                             /*!<R/W 0011  OTP Program Setup time and Recovery time. In the unit of cycle time. OTP SPEC 5us< Tpps=Tppr <100us For input clock 12MHz 0 : 5us, 1 : 11us, 2 : 17us, 3 : 23us, 4 : 30us, 5 : 36us , 6 : 42us , 7 : 49us 8 : 55us, 9 : 61us , A : 68us , B : 74us C : 80us, D : 87us , E : 93us , F : 100us default value : 3 */
#define AON_SHIFT_OTP_BURST                          19
#define AON_BIT_OTP_BURST                            ((u32)0x00000001 << 19)                             /*!<R/W 0  Efuse Read / Write Burst Mode Enable 0 : Disable 1 : Enable */
#define AON_SHIFT_OTP_TEST_SEL                       16
#define AON_MASK_OTP_TEST_SEL                        ((u32)0x00000007 << 16)                             /*!<R/W 0  OTP Test Mode Selection: 000: User Mode 001: Initial Margin Read Mode 010: Program Margin Read Mode 100: Auto Repair Margin Read Mode (Only in Pro2) 101: Repair Margin Read Mode 110: Repair Check Mode 111: Repair Program Mode Bit18=0:User mode and Test mode Bit18=1: Use Repair mode */
#define AON_SHIFT_OTP_TROW_EN                        15
#define AON_BIT_OTP_TROW_EN                          ((u32)0x00000001 << 15)                             /*!<R/W 0  OTP Test Row Select: 0: Test Row Function Disable 1: Test Row Function Enable */
#define AON_SHIFT_OTP_ERR_FLAG                       14
#define AON_BIT_OTP_ERR_FLAG                         ((u32)0x00000001 << 14)                             /*!<R 0  OTP Error Flag: When OTP read/write and test mode mapping process Error, this flag will be set to 1  */
#define AON_SHIFT_RSVD18                             12
#define AON_MASK_RSVD18                              ((u32)0x00000003 << 12)                             /*!<R/W 0  RSVD */
#define AON_SHIFT_OTP_DSB_EN                         11
#define AON_BIT_OTP_DSB_EN                           ((u32)0x00000001 << 11)                             /*!<R/W 0  0: OTP Deep Standby Mode Disable 1 : OTP Deep Standby Mode Enable  */
#define AON_SHIFT_RSVD19                             0
#define AON_MASK_RSVD19                              ((u32)0x000007FF << 0)                              /*!<R/W 0  RSVD */
#else
#define AON_SHIFT_OTP_ENT                            31
#define AON_BIT_OTP_ENT                              ((u32)0x00000001 << 31)                             /*!<R/W 1  OTP IP enable time (OTP SPEC Tcs >10us) For input clock 12MHz 0:24us 1:36us default value : 1 */
#define AON_SHIFT_RSVD16                             28
#define AON_MASK_RSVD16                              ((u32)0x00000007 << 28)                             /*!<R/W 0  RSVD */
#define AON_SHIFT_OTP_RDT                            27
#define AON_BIT_OTP_RDT                              ((u32)0x00000001 << 27)                             /*!<R/W 1  OTP Clock cycle time (OTP SPEC Tcyc >80ns) For input clock 12MHz 0:166.66ns 1:249.9ns default value : 1 */
#define AON_SHIFT_RSVD17                             26
#define AON_BIT_RSVD17                               ((u32)0x00000001 << 26)                             /*!<R/W 0  RSVD */
#define AON_SHIFT_OTP_TPPS                           24
#define AON_MASK_OTP_TPPS                            ((u32)0x00000003 << 24)                             /*!<R/W 10  OTP Program Setup time and Recovery time. In the unit of cycle time. OTP SPEC 5us< Tpps <20us For input clock 12MHz 0 : 5us, 1 : 10us, 2 : 12.5us, 3 : 20us,  */
#define AON_SHIFT_OTP_PGTS                           20
#define AON_MASK_OTP_PGTS                            ((u32)0x0000000F << 20)                             /*!<R/W 0011  OTP Program Setup time and Recovery time. In the unit of cycle time. OTP SPEC 5us< Tpps=Tppr <100us For input clock 12MHz 0 : 5us, 1 : 11us, 2 : 17us, 3 : 23us, 4 : 30us, 5 : 36us , 6 : 42us , 7 : 49us 8 : 55us, 9 : 61us , A : 68us , B : 74us C : 80us, D : 87us , E : 93us , F : 100us default value : 3 */
#define AON_SHIFT_OTP_BURST                          19
#define AON_BIT_OTP_BURST                            ((u32)0x00000001 << 19)                             /*!<R/W 0  Efuse Read / Write Burst Mode Enable 0 : Disable 1 : Enable */
#define AON_SHIFT_OTP_TEST_SEL                       16
#define AON_MASK_OTP_TEST_SEL                        ((u32)0x00000007 << 16)                             /*!<R/W 0  OTP Test Mode Selection: 000: User Mode 001: Initial Margin Read Mode 010: Program Margin Read Mode 100: Auto Repair Margin Read Mode (Only in Pro2) 101: Repair Margin Read Mode 110: Repair Check Mode 111: Repair Program Mode Bit18=0:User mode and Test mode Bit18=1: Use Repair mode */
#define AON_SHIFT_OTP_TROW_EN                        15
#define AON_BIT_OTP_TROW_EN                          ((u32)0x00000001 << 15)                             /*!<R/W 0  OTP Test Row Select: 0: Test Row Function Disable 1: Test Row Function Enable */
#define AON_SHIFT_OTP_ERR_FLAG                       14
#define AON_BIT_OTP_ERR_FLAG                         ((u32)0x00000001 << 14)                             /*!<R 0  OTP Error Flag: When OTP read/write and test mode mapping process Error, this flag will be set to 1  */
#define AON_SHIFT_OTP_TCOL_EN                        13
#define AON_BIT_OTP_TCOL_EN                          ((u32)0x00000001 << 13)                             /*!<R/W 0  OTP Test Column Select: 0: Test Column Function Disable 1: Test Column Function Enable */
#define AON_SHIFT_OTP_HTEMP_EN                       12
#define AON_BIT_OTP_HTEMP_EN                         ((u32)0x00000001 << 12)                             /*!<R/W 0  OTP High Temperature Test Mode Enable 0: High Temperature Test ModeDisable 1: High Temperature Test Mode Enable */
#define AON_SHIFT_OTP_DSB_EN                         11
#define AON_BIT_OTP_DSB_EN                           ((u32)0x00000001 << 11)                             /*!<R/W 0  0: OTP Deep Standby Mode Disable 1 : OTP Deep Standby Mode Enable  */
#define AON_SHIFT_RSVD18                             0
#define AON_MASK_RSVD18                              ((u32)0x000007FF << 0)                              /*!<R/W 0  RSVD */
#endif
/** @} */

