Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/lib/include/rtl8735b_aon_type.h
/**************************************************************************//**
 * @defgroup AON_REG_OTP_CTRL_1
 * @brief                                            (@ 0X124)
 * @{
 *****************************************************************************/
#if IS_CUT_TEST(CONFIG_CHIP_VER)
#define AON_SHIFT_RSVD20                             28
#define AON_MASK_RSVD20                              ((u32)0x0000000F << 28)                             /*!<R/W 0  RSVD */
#define AON_SHIFT_RSVD21                             20
#define AON_MASK_RSVD21                              ((u32)0x000000FF << 20)                             /*!<R/W 0  RSVD */
#define AON_SHIFT_RSVD22                             19
#define AON_BIT_RSVD22                               ((u32)0x00000001 << 19)                             /*!<R/W 0  RSVD */
#define AON_SHIFT_RSVD23                             16
#define AON_MASK_RSVD23                              ((u32)0x00000007 << 16)                             /*!<R/W 0  RSVD */
#define AON_SHIFT_RSVD24                             15
#define AON_BIT_RSVD24                               ((u32)0x00000001 << 15)                             /*!<R/W 0  RSVD */
#define AON_SHIFT_OTP_RB_CTRL                        14
#define AON_BIT_OTP_RB_CTRL                          ((u32)0x00000001 << 14)                             /*!<R/W 0  OTP Reboot (related to PTRIM) Control After Repair Program Operation 0: Disable reboot poreation after Repair Program 1: Enable reboot poreation after Repair Program */
#define AON_SHIFT_OTP_DLY2SHDN                       12
#define AON_MASK_OTP_DLY2SHDN                        ((u32)0x00000003 << 12)                             /*!<R/W 0  OTP delay time to idle or shutdown state after a requested command done. Consider about level shift between For input clock 12MHz 2'b00: 10us 2'b01: 20us 2'b10: 30us 2'b11: 50us */
#define AON_SHIFT_RSVD25                             6
#define AON_MASK_RSVD25                              ((u32)0x0000003F << 6)                              /*!<R/W 0  RSVD */
#define AON_SHIFT_OTP_PGTW                           4
#define AON_MASK_OTP_PGTW                            ((u32)0x00000003 << 4)                              /*!<R/W 1  OTP Program Pulse width Time: (OTP SPEC 10us<Tpw<15us) For Input clock 40Mhz 0 : 10us , 1 : 12.5us, 2 : 15us, 3: 15us, default value : 1 */
#define AON_SHIFT_OTP_VD                             2
#define AON_MASK_OTP_VD                              ((u32)0x00000003 << 2)                              /*!<R/W 0  RSVD */
#define AON_SHIFT_OTP_PGITV                          0
#define AON_MASK_OTP_PGITV                           ((u32)0x00000003 << 0)                              /*!<R/W 1  OTP Program Pulse Interval Time : (OTP SPEC 1us<Tpwi<5us) For Input clock 40Mhz 0 : 1us, 1 : 3us, 2 : 5us, 3 : 5us, default value : 1 */
#else
#define AON_SHIFT_RSVD19                             28
#define AON_MASK_RSVD19                              ((u32)0x0000000F << 28)                             /*!<R/W 0  RSVD */
#define AON_SHIFT_RSVD20                             20
#define AON_MASK_RSVD20                              ((u32)0x000000FF << 20)                             /*!<R/W 0  RSVD */
#define AON_SHIFT_RSVD21                             19
#define AON_BIT_RSVD21                               ((u32)0x00000001 << 19)                             /*!<R/W 0  RSVD */
#define AON_SHIFT_RSVD22                             16
#define AON_MASK_RSVD22                              ((u32)0x00000007 << 16)                             /*!<R/W 0  RSVD */
#define AON_SHIFT_RSVD23                             15
#define AON_BIT_RSVD23                               ((u32)0x00000001 << 15)                             /*!<R/W 0  RSVD */
#define AON_SHIFT_OTP_RB_CTRL                        14
#define AON_BIT_OTP_RB_CTRL                          ((u32)0x00000001 << 14)                             /*!<R/W 0  OTP Reboot (related to PTRIM) Control After Repair Program Operation 0: Disable reboot poreation after Repair Program 1: Enable reboot poreation after Repair Program */
#define AON_SHIFT_OTP_DLY2SHDN                       12
#define AON_MASK_OTP_DLY2SHDN                        ((u32)0x00000003 << 12)                             /*!<R/W 0  OTP delay time to idle or shutdown state after a requested command done. Consider about level shift between For input clock 12MHz 2'b00: 10us 2'b01: 20us 2'b10: 30us 2'b11: 50us */
#define AON_SHIFT_RSVD24                             6
#define AON_MASK_RSVD24                              ((u32)0x0000003F << 6)                              /*!<R/W 0  RSVD */
#define AON_SHIFT_OTP_PGTW                           4
#define AON_MASK_OTP_PGTW                            ((u32)0x00000003 << 4)                              /*!<R/W 1  OTP Program Pulse width Time: (OTP SPEC 10us<Tpw<15us) For Input clock 40Mhz 0 : 10us , 1 : 12.5us, 2 : 15us, 3: 15us, default value : 1 */
#define AON_SHIFT_OTP_VD                             2
#define AON_MASK_OTP_VD                              ((u32)0x00000003 << 2)                              /*!<R/W 0  RSVD */
#define AON_SHIFT_OTP_PGITV                          0
#define AON_MASK_OTP_PGITV                           ((u32)0x00000003 << 0)                              /*!<R/W 1  OTP Program Pulse Interval Time : (OTP SPEC 1us<Tpwi<5us) For Input clock 40Mhz 0 : 1us, 1 : 3us, 2 : 5us, 3 : 5us, default value : 1 */
#endif
/** @} */

/**************************************************************************//**
 * @defgroup AON_REG_OTP_AL_CTRL_STS
 * @brief                                            (@ 0X128)
 * @{
 *****************************************************************************/
#if IS_CUT_TEST(CONFIG_CHIP_VER)
#define AON_SHIFT_RSVD26                             14
#define AON_MASK_RSVD26                              ((u32)0x0003FFFF << 14)                             /*!<R/W 0  Reserved */
#define AON_SHIFT_OTP_AL_SYSON_STS                   12
#define AON_MASK_OTP_AL_SYSON_STS                    ((u32)0x00000003 << 12)                             /*!<R/W 00  OTP SYSON Autoload Result Status 00: RSVD 01: Autoload successful 10: RSVD 11: Autoload Failed because of OTP ID check failed */
#define AON_SHIFT_OTP_AL_PON_STS                     10
#define AON_MASK_OTP_AL_PON_STS                      ((u32)0x00000003 << 10)                             /*!<R/W1C 00  OTP PON Autoload Result Status 00: RSVD 01: Autoload successful 10: RSVD 11: Autoload Failed because of OTP ID check failed */
#define AON_SHIFT_OTP_AL_AON_STS                     8
#define AON_MASK_OTP_AL_AON_STS                      ((u32)0x00000003 << 8)                              /*!<R/W1C 00  OTP AON Autoload Result Status 00: RSVD 01: Autoload successful 10: RSVD 11: Autoload Failed because of OTP ID check failed */
#define AON_SHIFT_RSVD27                             7
#define AON_BIT_RSVD27                               ((u32)0x00000001 << 7)                              /*!<R/W 0  Reserved */
#define AON_SHIFT_OTP_ALDN_SYSON_STS                 6
#define AON_BIT_OTP_ALDN_SYSON_STS                   ((u32)0x00000001 << 6)                              /*!<R/W 0  OTP SYSON Autoload Done Status PMC/CPU should clear this bit before enabling autoload process. This bit only represents done status but not autoload resutl 0: SYSON autoload is not done 1: SYSON autoload is done */
#define AON_SHIFT_OTP_ALDN_PON_STS                   5
#define AON_BIT_OTP_ALDN_PON_STS                     ((u32)0x00000001 << 5)                              /*!<R/W1C 0  OTP PON Autoload Done Status PMC/CPU should clear this bit before enabling autoload process. This bit only represents done status but not autoload resutl 0: PON autoload is not done 1: PON autoload is done */
#define AON_SHIFT_OTP_ALDN_AON_STS                   4
#define AON_BIT_OTP_ALDN_AON_STS                     ((u32)0x00000001 << 4)                              /*!<R/W1C 0  OTP AON Autoload Done Status PMC/CPU should clear this bit before enabling autoload process. This bit only represents done status but not autoload resutl 0: AON autoload is not done 1: AON autoload is done */
#define AON_SHIFT_RSVD28                             3
#define AON_BIT_RSVD28                               ((u32)0x00000001 << 3)                              /*!<R/W 0  Reserved */
#define AON_SHIFT_OTP_AL_SYSON_EN                    2
#define AON_BIT_OTP_AL_SYSON_EN                      ((u32)0x00000001 << 2)                              /*!<R/W 0  OTP SYSON Autoload Control If PMC/CPU wants to do this autoload, autoload done status and this bit should be cleared first. After cleared, PMC/CPU could set this bit first and then set mode to Aiutolaod in OTP_AS_CTRL 0: Enable SYSON autoload 1: Enable SYSON autoload */
#define AON_SHIFT_OTP_AL_PON_EN                      1
#define AON_BIT_OTP_AL_PON_EN                        ((u32)0x00000001 << 1)                              /*!<R/W 0  OTP PON Autoload Control If PMC/CPU wants to do this autoload, autoload done status and this bit should be cleared first. After cleared, PMC/CPU could set this bit first and then set mode to Aiutolaod in OTP_AS_CTRL 0: Enable PON autoload 1: Enable PON autoload */
#define AON_SHIFT_OTP_AL_AON_EN                      0
#define AON_BIT_OTP_AL_AON_EN                        ((u32)0x00000001 << 0)                              /*!<R/W 0  OTP AON Autoload Control If PMC/CPU wants to do this autoload, autoload done status and this bit should be cleared first. After cleared, PMC/CPU could set this bit first and then set mode to Aiutolaod in OTP_AS_CTRL 0: Enable AON autoload 1: Enable AON autoload */
#else
#define AON_SHIFT_RSVD25                             14
#define AON_MASK_RSVD25                              ((u32)0x0003FFFF << 14)                             /*!<R/W 0  Reserved */
#define AON_SHIFT_OTP_AL_SYSON_STS                   12
#define AON_MASK_OTP_AL_SYSON_STS                    ((u32)0x00000003 << 12)                             /*!<R/W 00  OTP SYSON Autoload Result Status 00: RSVD 01: Autoload successful 10: RSVD 11: Autoload Failed because of OTP ID check failed */
#define AON_SHIFT_OTP_AL_PON_STS                     10
#define AON_MASK_OTP_AL_PON_STS                      ((u32)0x00000003 << 10)                             /*!<R/W1C 01  OTP PON Autoload Result Status 00: RSVD 01: Autoload successful 10: RSVD 11: Autoload Failed because of OTP ID check failed */
#define AON_SHIFT_OTP_AL_AON_STS                     8
#define AON_MASK_OTP_AL_AON_STS                      ((u32)0x00000003 << 8)                              /*!<R/W1C 01  OTP AON Autoload Result Status 00: RSVD 01: Autoload successful 10: RSVD 11: Autoload Failed because of OTP ID check failed */
#define AON_SHIFT_RSVD26                             7
#define AON_BIT_RSVD26                               ((u32)0x00000001 << 7)                              /*!<R/W 0  Reserved */
#define AON_SHIFT_OTP_ALDN_SYSON_STS                 6
#define AON_BIT_OTP_ALDN_SYSON_STS                   ((u32)0x00000001 << 6)                              /*!<R/W 0  OTP SYSON Autoload Done Status PMC/CPU should clear this bit before enabling autoload process. This bit only represents done status but not autoload resutl 0: SYSON autoload is not done 1: SYSON autoload is done */
#define AON_SHIFT_OTP_ALDN_PON_STS                   5
#define AON_BIT_OTP_ALDN_PON_STS                     ((u32)0x00000001 << 5)                              /*!<R/W1C 0  OTP PON Autoload Done Status PMC/CPU should clear this bit before enabling autoload process. This bit only represents done status but not autoload resutl 0: PON autoload is not done 1: PON autoload is done */
#define AON_SHIFT_OTP_ALDN_AON_STS                   4
#define AON_BIT_OTP_ALDN_AON_STS                     ((u32)0x00000001 << 4)                              /*!<R/W1C 0  OTP AON Autoload Done Status PMC/CPU should clear this bit before enabling autoload process. This bit only represents done status but not autoload resutl 0: AON autoload is not done 1: AON autoload is done */
#define AON_SHIFT_RSVD27                             3
#define AON_BIT_RSVD27                               ((u32)0x00000001 << 3)                              /*!<R/W 0  Reserved */
#define AON_SHIFT_OTP_AL_SYSON_EN                    2
#define AON_BIT_OTP_AL_SYSON_EN                      ((u32)0x00000001 << 2)                              /*!<R/W 0  OTP SYSON Autoload Control If PMC/CPU wants to do this autoload, autoload done status and this bit should be cleared first. After cleared, PMC/CPU could set this bit first and then set mode to Aiutolaod in OTP_AS_CTRL 0: Enable SYSON autoload 1: Enable SYSON autoload */
#define AON_SHIFT_OTP_AL_PON_EN                      1
#define AON_BIT_OTP_AL_PON_EN                        ((u32)0x00000001 << 1)                              /*!<R/W 0  OTP PON Autoload Control If PMC/CPU wants to do this autoload, autoload done status and this bit should be cleared first. After cleared, PMC/CPU could set this bit first and then set mode to Aiutolaod in OTP_AS_CTRL 0: Enable PON autoload 1: Enable PON autoload */
#define AON_SHIFT_OTP_AL_AON_EN                      0
#define AON_BIT_OTP_AL_AON_EN                        ((u32)0x00000001 << 0)                              /*!<R/W 0  OTP AON Autoload Control If PMC/CPU wants to do this autoload, autoload done status and this bit should be cleared first. After cleared, PMC/CPU could set this bit first and then set mode to Aiutolaod in OTP_AS_CTRL 0: Enable AON autoload 1: Enable AON autoload */
#endif
/** @} */

/**************************************************************************//**
 * @defgroup AON_REG_OTP_PMC_DBG_CTRL
 * @brief                                            (@ 0X12C)
 * @{
 *****************************************************************************/
#if IS_CUT_TEST(CONFIG_CHIP_VER)
#define AON_SHIFT_RSVD29                             12
#define AON_MASK_RSVD29                              ((u32)0x000FFFFF << 12)                             /*!<R/W 0  Reserve */
#else
#define AON_SHIFT_RSVD28                             12
#define AON_MASK_RSVD28                              ((u32)0x000FFFFF << 12)                             /*!<R/W 0  Reserve */
#endif
#define AON_SHIFT_OTP_DBG_GRP_SEL                    10
#define AON_MASK_OTP_DBG_GRP_SEL                     ((u32)0x00000003 << 10)                             /*!<R/W 0   OTP debug group select */
#define AON_SHIFT_OTP_DBG_EN                         9
#define AON_BIT_OTP_DBG_EN                           ((u32)0x00000001 << 9)                              /*!<R/W 0  OTP debug enable */
#define AON_SHIFT_OPT_PWR_CTRL_GNT                   8
#define AON_BIT_OPT_PWR_CTRL_GNT                     ((u32)0x00000001 << 8)                              /*!<R/W 0  The grant control for OTP power control register (OTP_PWR_CTRL) 1: Enable access to OTP power control register 0: Disable access to OTP power control register */
#define AON_SHIFT_OTP_BURN_GNT                       0
#define AON_MASK_OTP_BURN_GNT                        ((u32)0x000000FF << 0)                              /*!<R/W 0  The Grant Code for OTP Program Operation Need write 0x69 value before any program operation to OTP controller  */
/** @} */

/**************************************************************************//**
 * @defgroup AON_REG_OTP_PWR_CTRL
 * @brief                                            (@ 0X130)
 * @{
 *****************************************************************************/
#if IS_CUT_TEST(CONFIG_CHIP_VER)
#define AON_SHIFT_RSVD30                             22
#define AON_MASK_RSVD30                              ((u32)0x000003FF << 22)                             /*!<R/W 0  Reserve */
#else
#define AON_SHIFT_RSVD29                             22
#define AON_MASK_RSVD29                              ((u32)0x000003FF << 22)                             /*!<R/W 0  Reserve */
#endif
#define AON_SHIFT_OTP_ISO2SYSON_STS                  21
#define AON_BIT_OTP_ISO2SYSON_STS                    ((u32)0x00000001 << 21)                             /*!<R 1  For status of isolation to SYSON 0: Isolation to SYSON is disabled. 1: Isolation to SYSON is enabled. */
#define AON_SHIFT_OTP_ISO2PON_STS                    20
#define AON_BIT_OTP_ISO2PON_STS                      ((u32)0x00000001 << 20)                             /*!<R 1  For status of isolation to PON 0: Isolation to PON is disabled. 1: Isolation to PON is enabled. */
#define AON_SHIFT_OTP_ISO2AON_STS                    19
#define AON_BIT_OTP_ISO2AON_STS                      ((u32)0x00000001 << 19)                             /*!<R 1  For status of isolation to AON 0: Isolation to AON is disabled. 1: Isolation to AON is enabled. */
#define AON_SHIFT_OTP_PC_BG_STS                      18
#define AON_BIT_OTP_PC_BG_STS                        ((u32)0x00000001 << 18)                             /*!<R 0  Big Power Cut Status 0: Big power cut in disabled state 1: Big power cut in enabled state. */
#define AON_SHIFT_OTP_PC_SL_STS                      17
#define AON_BIT_OTP_PC_SL_STS                        ((u32)0x00000001 << 17)                             /*!<R 0  Small Power Cut Status 0: Small power cut in disabled state 1: Small power cut in enabled state. */
#if IS_CUT_TEST(CONFIG_CHIP_VER)
#define AON_SHIFT_RSVD31                             8
#define AON_MASK_RSVD31                              ((u32)0x000001FF << 8)                              /*!<R/W 0  Reserve */
#else
#define AON_SHIFT_RSVD30                             8
#define AON_MASK_RSVD30                              ((u32)0x000001FF << 8)                              /*!<R/W 0  Reserve */
#endif
#define AON_SHIFT_OTP_PGCLK_GT_EN                    7
#define AON_BIT_OTP_PGCLK_GT_EN                      ((u32)0x00000001 << 7)                              /*!<R/W 1  For OTP program clock source gate control. (40MHz) 0: Program clock source is NOT gated. 1: Program clock source is gated. */
#define AON_SHIFT_OTP_RDCLK_GT_EN                    6
#define AON_BIT_OTP_RDCLK_GT_EN                      ((u32)0x00000001 << 6)                              /*!<R/W 0  For OTP read clock source gate control. (12MHz) 0: Read clock source is NOT gated. 1: Read clock source is gated. */
#define AON_SHIFT_OTP_ISO2SYSON_EN                   5
#define AON_BIT_OTP_ISO2SYSON_EN                     ((u32)0x00000001 << 5)                              /*!<R/W 1  For OTP isolation to SYSON control. 0: Isolation to SYSON is disabled. 1: Isolation to SYSON is enabled. */
#define AON_SHIFT_OTP_ISO2PON_EN                     4
#define AON_BIT_OTP_ISO2PON_EN                       ((u32)0x00000001 << 4)                              /*!<R/W 1  For OTP isolation to PON control. 0: Isolation to PON is disabled. 1: Isolation to PON is enabled. */
#define AON_SHIFT_OTP_ISO2AON_EN                     3
#define AON_BIT_OTP_ISO2AON_EN                       ((u32)0x00000001 << 3)                              /*!<R/W 1  For OTP isolation to AON control. 0: Isolation to AON is disabled. 1: Isolation to AON is enabled.  */
#define AON_SHIFT_OTP_PC_BG_EN                       2
#define AON_BIT_OTP_PC_BG_EN                         ((u32)0x00000001 << 2)                              /*!<R/W 0  For Big Power cut control of VDD (0.9V) and VDD2 (3.3V) 0: Big power cut disabled. Therefore power is invalid 1: Big power cut enabled. Therefore power is valid  */
#define AON_SHIFT_OTP_PC_SL_EN                       1
#define AON_BIT_OTP_PC_SL_EN                         ((u32)0x00000001 << 1)                              /*!<R/W 0  For small Power cut control of VDD (0.9V) and VDD2 (3.3V) 0: Small power cut disabled. Therefore power is invalid 1: Small power cut enabled. Therefore power is valid */
#define AON_SHIFT_OTP_CTRLER_FEN                     0
#define AON_BIT_OTP_CTRLER_FEN                       ((u32)0x00000001 << 0)                              /*!<R/W 0  OTP Controller (Loader) Enable. 0: Disable OTP controller 1: Enable OTP controller */
/** @} */

/**************************************************************************//**
 * @defgroup AON_REG_OTP_AS_CTRL_A
 * @brief                                            (@ 0X134)
 * @{
 *****************************************************************************/
#define AON_SHIFT_OTP_MODE_SEL                       30
#define AON_MASK_OTP_MODE_SEL                        ((u32)0x00000003 << 30)                             /*!<R/W 0  OTP controller Mode (command) selection Program to this field could trigger OTP controller to do related command operation. 2'b00 :Read 2'b10 :Write 2'b01 :Autoload Enable 2'b11 :Compare Secure Data Enable */
#define AON_SHIFT_OTP_RDY                            29
#define AON_BIT_OTP_RDY                              ((u32)0x00000001 << 29)                             /*!<R/W1C 0  OTP Operation Ready bit 0: OTP controller has NOT done a requested command. 1: OTP controller has done a requested command. Note : HW set , SW clear Note before any operations, HW/SW should clear ready bit first Note: For autoload operation, this bit is not used for autoload done status. Autoload done status of each zone is shown in 0x40009128[6:4] */
#define AON_SHIFT_OTP_COMP_RESULT                    28
#define AON_BIT_OTP_COMP_RESULT                      ((u32)0x00000001 << 28)                             /*!<R/W1C 0  compare result 0 : PASS 1 : FAIL Note : HW set , SW clear */
#define AON_SHIFT_OTP_OP_EN                          27
#define AON_BIT_OTP_OP_EN                            ((u32)0x00000001 << 27)                             /*!<W1Once 0  OTP controller operation enable control This bit could be set to 1 by software and automatically cleared to 0 by hardware 0: OTP controller does NOT perforam any operations even B_OTP_MODE_SEL is given by a valid value. 1: OTP controller performs corresponding operation according to B_OTP_MODE_SEL, B_OTP_ADDR and B_OTP_DATA */
#define AON_SHIFT_OTP_ADDR                           16
#define AON_MASK_OTP_ADDR                            ((u32)0x000007FF << 16)                             /*!<R/W 0  Access Address */
#if IS_CUT_TEST(CONFIG_CHIP_VER)
#define AON_SHIFT_RSVD32                             9
#define AON_MASK_RSVD32                              ((u32)0x0000007F << 9)                              /*!<R/W 0x00  Reserved */
#else
#define AON_SHIFT_RSVD31                             9
#define AON_MASK_RSVD31                              ((u32)0x0000007F << 9)                              /*!<R/W 0x00  Reserved */
#endif
#define AON_SHIFT_OTP_AUTO_RDCHK_CTRL                8
#define AON_BIT_OTP_AUTO_RDCHK_CTRL                  ((u32)0x00000001 << 8)                              /*!<R/W 0  Automatic Read Check Control When this bit is set to 1 in OTP write mode, OTP controller would perform a write-read-check process automatically. Read back data would be compared with original write data and the result would be updated in bit28 of this register 0: Disable auto read check mechanism 1: Enable auto read check mechanism */
#define AON_SHIFT_OTP_DATA                           0
#define AON_MASK_OTP_DATA                            ((u32)0x000000FF << 0)                              /*!<R/W 0  Access Data [7:0] : Read / Write/Data to be compared */
/** @} */

