Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/lib/include/rtl8735b_aon_type.h
/**************************************************************************//**
 * @defgroup AON_REG_OTP_SCAN_TEST_A
 * @brief                                            (@ 0X138)
 * @{
 *****************************************************************************/
#define AON_SHIFT_AX_EF_CRES_SEL                     31
#define AON_BIT_AX_EF_CRES_SEL                       ((u32)0x00000001 << 31)                             /*!<R/W 0  1: for debug , 0: for normal */
#define AON_SHIFT_AX_EF_RSVD                         30
#define AON_BIT_AX_EF_RSVD                           ((u32)0x00000001 << 30)                             /*!<R/W 0  Reserved */
#define AON_SHIFT_AX_EF_SCAN_SADR                    19
#define AON_MASK_AX_EF_SCAN_SADR                     ((u32)0x000007FF << 19)                             /*!<R/W 0  EFuse Scan start Address (unit in byte) */
#define AON_SHIFT_AX_EF_SCAN_EADR                    8
#define AON_MASK_AX_EF_SCAN_EADR                     ((u32)0x000007FF << 8)                              /*!<R/W 0  EFuse Scan End address */
#define AON_SHIFT_AX_EF_SCAN_TRPT                    7
#define AON_BIT_AX_EF_SCAN_TRPT                      ((u32)0x00000001 << 7)                              /*!<R/W1C 0  Test Scan Report: 1 : Fail, 0 : OK */
#define AON_SHIFT_AX_EF_SCAN_FTHR                    0
#define AON_MASK_AX_EF_SCAN_FTHR                     ((u32)0x0000007F << 0)                              /*!<R/W 0  Threshold number of bit error If [6:0]=1 and scan check have any cell bit wasn't equal 1b'1(default). It will report Fail. If [6:0]=2, it mean allow one cell bit fail while HW scan was finlish and the [6:0] will write to 0 and then check result([7])  */
/** @} */

/**************************************************************************//**
 * @defgroup AON_REG_OTP_PRCT_CTRL
 * @brief                                            (@ 0X13C)
 * @{
 *****************************************************************************/
#define AON_SHIFT_B_OTP_SZ_WL_CTRL                   31
#define AON_BIT_B_OTP_SZ_WL_CTRL                     ((u32)0x00000001 << 31)                             /*!<R/W Once 0  Secure Zone Write Lock Control 0: OTP write lock control is disabed. 1: OTP write lock control is enabled. */
#define AON_SHIFT_B_OTP_SSZ_CRC_STS                  22
#define AON_MASK_B_OTP_SSZ_CRC_STS                   ((u32)0x000001FF << 22)                             /*!<R/W1C 0x000000  Super Secure Zone Entry CRC Status Each bit represents one entry CRC status. 1: CRC check failed 0: CRC check passed Bit22 for HUK Bit23 for HUK reserved 32byte Bit24 for JTAG Secure Key1 Bit25 for JTAG Secure Key2 Bit26 for JTAG non-Secure Key1 Bit27 for JTAG non-Secure Key2 Bit28 for RSIP(SCE) Key1 Bit29 for RSIP(SCE) Key2 Bit30 for Reserved 32byte */
#define AON_SHIFT_B_OTP_SZ_CRC_STS                   13
#define AON_MASK_B_OTP_SZ_CRC_STS                    ((u32)0x000001FF << 13)                             /*!<R/W1C 0  Secure Zone Entry CRC Status Each bit represents one entry CRC status. 1: CRC check failed 0: CRC check passed Bit13 for ROTPK1 Bit14 for RTOPK2 Bit15 for IPSec Cipher Key1 Bit16 for IPSec Cipher Key2 Bit17 for ECDSA Pirvate Key1 Bit18 for ECDSA Pirvate Key2 Bit20-19 for Reserved 64byte Bit21 Reserved */
#define AON_SHIFT_B_OTP_LZ_CRC_ER_ADDR               3
#define AON_MASK_B_OTP_LZ_CRC_ER_ADDR                ((u32)0x000003FF << 3)                              /*!<R 0x000  OTP physical address of the first byte of the first CRC check error entry */
#define AON_SHIFT_B_OTP_LZ_CRC_STS                   2
#define AON_BIT_B_OTP_LZ_CRC_STS                     ((u32)0x00000001 << 2)                              /*!<R/W1C 0  Logical Zone CRC Status 1: CRC check failed 0: CRC check passed  */
#define AON_SHIFT_B_OTP_SC_CRC_STS                   1
#define AON_BIT_B_OTP_SC_CRC_STS                     ((u32)0x00000001 << 1)                              /*!<R/W1C 0  Secure Control Zone CRC Status 1: CRC check failed 0: CRC check passed  */
#define AON_SHIFT_B_OTP_PRCT_CTRL                    0
#define AON_BIT_B_OTP_PRCT_CTRL                      ((u32)0x00000001 << 0)                              /*!<R/W 1  OTP Protect Mechanism Control This bit is used to control CRC check protect mechanism is enabled or not. 0: Disable CRC check report generation 1: Enable CRC check report generation */
/** @} */

/**************************************************************************//**
 * @defgroup AON_REG_AON_SW_BOOT0
 * @brief                                            (@ 0X140)
 * @{
 *****************************************************************************/
#define AON_SHIFT_SW0                                0
#define AON_MASK_SW0                                 ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0  SW Control */
/** @} */

/**************************************************************************//**
 * @defgroup AON_REG_AON_FAST_RESUME
 * @brief                                            (@ 0X144)
 * @{
 *****************************************************************************/
#define AON_SHIFT_AON_FAST_RESUME                    0
#define AON_MASK_AON_FAST_RESUME                     ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0  SW Control */
/** @} */

/**************************************************************************//**
 * @defgroup AON_REG_AON_SW_BOOT1
 * @brief                                            (@ 0X148)
 * @{
 *****************************************************************************/
#define AON_SHIFT_SW1                                0
#define AON_MASK_SW1                                 ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0  SW Control */
/** @} */

/**************************************************************************//**
 * @defgroup AON_REG_AON_SW_BOOT2
 * @brief                                            (@ 0X14C)
 * @{
 *****************************************************************************/
#define AON_SHIFT_SW2                                0
#define AON_MASK_SW2                                 ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0  SW Control */
/** @} */

/**************************************************************************//**
 * @defgroup AON_REG_AON_SW_BOOT3
 * @brief                                            (@ 0X150)
 * @{
 *****************************************************************************/
#define AON_SHIFT_SW3                                0
#define AON_MASK_SW3                                 ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0  SW Control */
/** @} */

/**************************************************************************//**
 * @defgroup AON_REG_AON_SW_BOOT4
 * @brief                                            (@ 0X154)
 * @{
 *****************************************************************************/
#define AON_SHIFT_SW4                                0
#define AON_MASK_SW4                                 ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0  SW Control */
/** @} */

/**************************************************************************//**
 * @defgroup AON_REG_AON_WLMAC_MEM_CNTRL
 * @brief                                            (@ 0X158)
 * @{
 *****************************************************************************/
#if IS_CUT_TEST(CONFIG_CHIP_VER)
#define AON_SHIFT_RSVD33                             22
#define AON_MASK_RSVD33                              ((u32)0x000003FF << 22)                             /*!<R/W 0x0   */
#else
#define AON_SHIFT_RSVD32                             22
#define AON_MASK_RSVD32                              ((u32)0x000003FF << 22)                             /*!<R/W 0x0   */
#endif
#define AON_SHIFT_TMCK_WLMAC                         21
#define AON_BIT_TMCK_WLMAC                           ((u32)0x00000001 << 21)                             /*!<R/W 0x0  internal timing bypass wlan mac mmory cells */
#define AON_SHIFT_DVS_WLMAC                          17
#define AON_MASK_DVS_WLMAC                           ((u32)0x0000000F << 17)                             /*!<R/W 0x0  delay option wlan mac memory cells */
#define AON_SHIFT_DVSE_WLMAC_ROM                     16
#define AON_BIT_DVSE_WLMAC_ROM                       ((u32)0x00000001 << 16)                             /*!<R/W 0x0  delay option enable wlan mac memory cells 1 bit for each wlmac bist group */
#define AON_SHIFT_DVSE_WLMAC_AXI_TXDMA               15
#define AON_BIT_DVSE_WLMAC_AXI_TXDMA                 ((u32)0x00000001 << 15)                             /*!<R/W 0x0  delay option enable wlan mac memory cells 1 bit for each wlmac bist group */
#define AON_SHIFT_DVSE_WLMCU_IRAM                    14
#define AON_BIT_DVSE_WLMCU_IRAM                      ((u32)0x00000001 << 14)                             /*!<R/W 0x0  delay option enable wlan mac memory cells 1 bit for each wlmac bist group */
#define AON_SHIFT_DVSE_WLMCU_ERAM1                   13
#define AON_BIT_DVSE_WLMCU_ERAM1                     ((u32)0x00000001 << 13)                             /*!<R/W 0x0  delay option enable wlan mac memory cells 1 bit for each wlmac bist group */
#define AON_SHIFT_DVSE_WLMCU_ERAM0                   12
#define AON_BIT_DVSE_WLMCU_ERAM0                     ((u32)0x00000001 << 12)                             /*!<R/W 0x0  delay option enable wlan mac memory cells 1 bit for each wlmac bist group */
#define AON_SHIFT_DVSE_WLMCU_DRAM                    11
#define AON_BIT_DVSE_WLMCU_DRAM                      ((u32)0x00000001 << 11)                             /*!<R/W 0x0  delay option enable wlan mac memory cells 1 bit for each wlmac bist group */
#define AON_SHIFT_DVSE_WLMAC_TXRPTBUFFER             10
#define AON_BIT_DVSE_WLMAC_TXRPTBUFFER               ((u32)0x00000001 << 10)                             /*!<R/W 0x0  delay option enable wlan mac memory cells 1 bit for each wlmac bist group */
#define AON_SHIFT_DVSE_WLMAC_RXPKTBUFFER             9
#define AON_BIT_DVSE_WLMAC_RXPKTBUFFER               ((u32)0x00000001 << 9)                              /*!<R/W 0x0  delay option enable wlan mac memory cells 1 bit for each wlmac bist group */
#define AON_SHIFT_DVSE_WLMAC_TXPKTBUFFER1            8
#define AON_BIT_DVSE_WLMAC_TXPKTBUFFER1              ((u32)0x00000001 << 8)                              /*!<R/W 0x0  delay option enable wlan mac memory cells 1 bit for each wlmac bist group */
#define AON_SHIFT_DVSE_WLMAC_TXPKTBUFFER0            7
#define AON_BIT_DVSE_WLMAC_TXPKTBUFFER0              ((u32)0x00000001 << 7)                              /*!<R/W 0x0  delay option enable wlan mac memory cells 1 bit for each wlmac bist group */
#define AON_SHIFT_DVSE_WLMAC_TXLLT                   6
#define AON_BIT_DVSE_WLMAC_TXLLT                     ((u32)0x00000001 << 6)                              /*!<R/W 0x0  delay option enable wlan mac memory cells 1 bit for each wlmac bist group */
#define AON_SHIFT_DVSE_WLMAC_MACTX_FIFO              5
#define AON_BIT_DVSE_WLMAC_MACTX_FIFO                ((u32)0x00000001 << 5)                              /*!<R/W 0x0  delay option enable wlan mac memory cells 1 bit for each wlmac bist group */
#define AON_SHIFT_DVSE_WLMAC_MACRX_FIFO              4
#define AON_BIT_DVSE_WLMAC_MACRX_FIFO                ((u32)0x00000001 << 4)                              /*!<R/W 0x0  delay option enable wlan mac memory cells 1 bit for each wlmac bist group */
#define AON_SHIFT_DVSE_WLMAC_TKIPRC4                 3
#define AON_BIT_DVSE_WLMAC_TKIPRC4                   ((u32)0x00000001 << 3)                              /*!<R/W 0x0  delay option enable wlan mac memory cells 1 bit for each wlmac bist group */
#define AON_SHIFT_DVSE_WLMAC_PSF                     2
#define AON_BIT_DVSE_WLMAC_PSF                       ((u32)0x00000001 << 2)                              /*!<R/W 0x0  delay option enable wlan mac memory cells 1 bit for each wlmac bist group */
#define AON_SHIFT_DVSE_WLMAC_RXBACAM                 1
#define AON_BIT_DVSE_WLMAC_RXBACAM                   ((u32)0x00000001 << 1)                              /*!<R/W 0x0  delay option enable wlan mac memory cells 1 bit for each wlmac bist group */
#define AON_SHIFT_DVSE_WLMAC_KEYSRCH                 0
#define AON_BIT_DVSE_WLMAC_KEYSRCH                   ((u32)0x00000001 << 0)                              /*!<R/W 0x0  delay option enable wlan mac memory cells 1 bit for each wlmac bist group */
/** @} */

/**************************************************************************//**
 * @defgroup rtl8735b_AON
 * @{
 * @brief rtl8735b_AON Register Declaration
 *****************************************************************************/
typedef struct {
	__IO uint32_t AON_REG_AON_PWR_CTRL ;                   /*!<   register,  Address offset: 0x000 */
	__IO uint32_t AON_REG_AON_ISO_CTRL ;                   /*!<   register,  Address offset: 0x004 */
	__IO uint32_t AON_REG_AON_FUNC_CTRL ;                  /*!<   register,  Address offset: 0x008 */
	__IO uint32_t AON_REG_AON_CLK_CTRL ;                   /*!<   register,  Address offset: 0x00C */
	__IO uint32_t AON_REG_AON_LDO_CTRL0 ;                  /*!<   register,  Address offset: 0x010 */
	__IO uint32_t AON_REG_WLON_LDO_CTRL0 ;                 /*!<   register,  Address offset: 0x014 */
	__IO uint32_t AON_REG_SWR_SRC_CTRL0 ;                  /*!<   register,  Address offset: 0x018 */
	__IO uint32_t AON_REG_SWR_SRC_CTRL1 ;                  /*!<   register,  Address offset: 0x01C */
	__IO uint32_t AON_REG_SWR_SRC_CTRL2 ;                  /*!<   register,  Address offset: 0x020 */
	__IO uint32_t AON_REG_SWR_SRC_CTRL3 ;                  /*!<   register,  Address offset: 0x024 */
	__IO uint32_t AON_REG_SWR_SRC_CTRL4 ;                  /*!<   register,  Address offset: 0x028 */
	__IO uint32_t AON_REG_SWR_SRC_OCP ;                    /*!<   register,  Address offset: 0x02C */
	__IO uint32_t AON_REG_SWR_ZCD_CTRL ;                   /*!<   register,  Address offset: 0x030 */
	__IO uint32_t AON_REG_SWR_SRC_LV_CTRL ;                /*!<   register,  Address offset: 0x034 */
	__IO uint32_t AON_REG_SWR_CORE_CTRL3 ;                 /*!<   register,  Address offset: 0x038 */
	__IO uint32_t AON_REG_SWR_CORE_CTRL4 ;                 /*!<   register,  Address offset: 0x03C */
	__IO uint32_t AON_REG_AON_XTAL32K_CTRL0 ;              /*!<   register,  Address offset: 0x040 */
	__IO uint32_t AON_REG_AON_XTAL32K_CTRL1 ;              /*!<   register,  Address offset: 0x044 */
	__IO uint32_t AON_REG_AON_OSC32K_CTRL0 ;               /*!<   register,  Address offset: 0x048 */
	__IO uint32_t AON_REG_AON_PLATFORM_VER ;               /*!<   register,  Address offset: 0x04C */
	__IO uint32_t AON_REG_AON_OSC4M_CTRL ;                 /*!<   register,  Address offset: 0x050 */
	__IO uint32_t AON_REG_AON_SW_DBG0 ;                    /*!<   register,  Address offset: 0x054 */
	__IO uint32_t AON_REG_AON_SW_DBG1 ;                    /*!<   register,  Address offset: 0x058 */
	__IO uint32_t AON_REG_AON_XTAL_CLK_CTRL0 ;             /*!<   register,  Address offset: 0x05C */
	__IO uint32_t AON_REG_AON_XTAL_CLK_CTRL1 ;             /*!<   register,  Address offset: 0x060 */
	__IO uint32_t AON_REG_AON_XTAL_CLK_CTRL2 ;             /*!<   register,  Address offset: 0x064 */
	__IO uint32_t AON_REG_AON_XTAL_CLK_CTRL3 ;             /*!<   register,  Address offset: 0x068 */
	__IO uint32_t AON_REG_AON_XTAL_CLK_CTRL4 ;             /*!<   register,  Address offset: 0x06C */
	__IO uint32_t AON_REG_AON_XTAL_CLK_CTRL5 ;             /*!<   register,  Address offset: 0x070 */
	__IO uint32_t AON_REG_AON_XTAL_CLK_CTRL6 ;             /*!<   register,  Address offset: 0x074 */
	__IO uint32_t AON_REG_AON_XTAL_CLK_CTRL7 ;             /*!<   register,  Address offset: 0x078 */
	__IO uint32_t AON_REG_AON_SRC_CLK_CTRL ;               /*!<   register,  Address offset: 0x07C */
	__I  uint32_t AON_REG_AON_CLK_STS ;                    /*!<   register,  Address offset: 0x080 */
	__IO uint32_t AON_REG_AON_WAKE_TIMER ;                 /*!<   register,  Address offset: 0x084 */
	__IO uint32_t AON_REG_AON_PLL_CTRL0 ;                  /*!<   register,  Address offset: 0x088 */
	__IO uint32_t AON_REG_AON_SD_CTRL0 ;                   /*!<   register,  Address offset: 0x08C */
	__IO uint32_t AON_REG_AON_PAD_CTRL ;                   /*!<   register,  Address offset: 0x090 */
	__IO uint32_t AON_REG_AON_GPIOA_0_1_CTRL ;             /*!<   register,  Address offset: 0x094 */
	__IO uint32_t AON_REG_AON_GPIOA_2_3_CTRL ;             /*!<   register,  Address offset: 0x098 */
	__IO uint32_t AON_REG_AON_GPIOA_4_5_CTRL ;             /*!<   register,  Address offset: 0x09C */
	__IO uint32_t AON_REG_AON_IO1_RSVD ;                   /*!<   register,  Address offset: 0x0A0 */
	__IO uint32_t AON_REG_AON_IO2_RSVD ;                   /*!<   register,  Address offset: 0x0A4 */
	__IO uint32_t AON_REG_AON_LSFIF_CMD ;                  /*!<   register,  Address offset: 0x0A8 */
	__IO uint32_t AON_REG_AON_LSFIF_RWD ;                  /*!<   register,  Address offset: 0x0AC */
	__IO uint32_t AON_REG_AON_TEST_MUX_CTRL ;              /*!<   register,  Address offset: 0x0B0 */
	__IO uint32_t AON_REG_AON_WDT_TIMER ;                  /*!<   register,  Address offset: 0x0B4 */
	__IO uint32_t AON_REG_AON_TEST_MUX_CTRL1 ;             /*!<   register,  Address offset: 0x0B8 */
	__IO uint32_t AON_REG_AON_ATLOAD_CTRL1 ;               /*!<   register,  Address offset: 0x0BC */
	__IO uint32_t AON_REG_AON_ATLOAD_CTRL2 ;               /*!<   register,  Address offset: 0x0C0 */
	__I  uint32_t AON_REG_AON_SYS_INFO0 ;                  /*!<   register,  Address offset: 0x0C4 */
	__IO uint32_t AON_REG_AON_SYS_INFO1 ;                  /*!<   register,  Address offset: 0x0C8 */
	__IO uint32_t AON_REG_AON_OTP_SYSCFG2 ;                /*!<   register,  Address offset: 0x0CC */
	__IO uint32_t AON_REG_AON_OTP_SYSCFG3 ;                /*!<   register,  Address offset: 0x0D0 */
	__IO uint32_t AON_REG_AON_OTP_SYSCFG4 ;                /*!<   register,  Address offset: 0x0D4 */
	__IO uint32_t AON_REG_AON_OTP_SYSCFG5 ;                /*!<   register,  Address offset: 0x0D8 */
	__IO uint32_t AON_REG_AON_OTP_SYSCFG6 ;                /*!<   register,  Address offset: 0x0DC */
	__IO uint32_t AON_REG_AON_OTP_SYSCFG7 ;                /*!<   register,  Address offset: 0x0E0 */
	__I  uint32_t AON_REG_AON_DBG_REG ;                    /*!<   register,  Address offset: 0x0E4 */
	__IO uint32_t AON_REG_AON_SYS_CTRL ;                   /*!<   register,  Address offset: 0x0E8 */
	__IO uint32_t AON_REG_AON_SIC_DBG_CTRL ;               /*!<   register,  Address offset: 0x0EC */
	__I  uint32_t AON_REG_AON_GPIO1_WAKE_CTRL ;            /*!<   register,  Address offset: 0x0F0 */
	__I  uint32_t AON_REG_AON_GPIO2_WAKE_CTRL ;            /*!<   register,  Address offset: 0x0F4 */
	__IO uint32_t AON_REG_AON_OTP_CNT_Z_CTRL ;             /*!<   register,  Address offset: 0x0F8 */
	__IO uint32_t AON_REG_AON_PMC_CTRL ;                   /*!<   register,  Address offset: 0x0FC */
	__IO uint32_t AON_REG_AON_PMC_OPT ;                    /*!<   register,  Address offset: 0x100 */
	__IO uint32_t AON_REG_AON_BOOT_REASON ;                /*!<   register,  Address offset: 0x104 */
	__IO uint32_t AON_REG_AON_WL_CTRL ;                    /*!<   register,  Address offset: 0x108 */
	__IO uint32_t AON_REG_AON_SLP_WAKE_EVENT_MSK0 ;        /*!<   register,  Address offset: 0x10C */
	__IO uint32_t AON_REG_AON_SLP_WAKE_EVENT_STATUS0 ;     /*!<   register,  Address offset: 0x110 */
	__IO uint32_t AON_REG_AON_SNF_WAKE_EVENT_MSK0 ;        /*!<   register,  Address offset: 0x114 */
	__IO uint32_t AON_REG_AON_SNF_WAKE_EVENT_STATUS ;      /*!<   register,  Address offset: 0x118 */
	__IO uint32_t AON_REG_AON_PWRMGT_OPTION ;              /*!<   register,  Address offset: 0x11C */
	__IO uint32_t AON_REG_OTP_CTRL_0 ;                     /*!<   register,  Address offset: 0x120 */
	__IO uint32_t AON_REG_OTP_CTRL_1 ;                     /*!<   register,  Address offset: 0x124 */
	__IO uint32_t AON_REG_OTP_AL_CTRL_STS ;                /*!<   register,  Address offset: 0x128 */
	__IO uint32_t AON_REG_OTP_PMC_DBG_CTRL ;               /*!<   register,  Address offset: 0x12C */
	__IO uint32_t AON_REG_OTP_PWR_CTRL ;                   /*!<   register,  Address offset: 0x130 */
	__IO uint32_t AON_REG_OTP_AS_CTRL_A ;                  /*!<   register,  Address offset: 0x134 */
	__IO uint32_t AON_REG_OTP_SCAN_TEST_A ;                /*!<   register,  Address offset: 0x138 */
	__IO uint32_t AON_REG_OTP_PRCT_CTRL ;                  /*!<   register,  Address offset: 0x13C */
	__IO uint32_t AON_REG_AON_SW_BOOT0 ;                   /*!<   register,  Address offset: 0x140 */
	__IO uint32_t AON_REG_AON_FAST_RESUME ;                /*!<   register,  Address offset: 0x144 */
	__IO uint32_t AON_REG_AON_SW_BOOT1 ;                   /*!<   register,  Address offset: 0x148 */
	__IO uint32_t AON_REG_AON_SW_BOOT2 ;                   /*!<   register,  Address offset: 0x14C */
	__IO uint32_t AON_REG_AON_SW_BOOT3 ;                   /*!<   register,  Address offset: 0x150 */
	__IO uint32_t AON_REG_AON_SW_BOOT4 ;                   /*!<   register,  Address offset: 0x154 */
	__IO uint32_t AON_REG_AON_WLMAC_MEM_CNTRL ;            /*!<   register,          Address offset: 0x158 */
} AON_TypeDef;
/** @} */

#endif
